#include <ntifs.h>
#ifndef WINDOWS_10_21H2_X64_H
#define WINDOWS_10_21H2_X64_H
#pragma pack(8)
typedef struct _NOK_BATTERY_REPORTING_SCALE NOK_BATTERY_REPORTING_SCALE, * NOK_PBATTERY_REPORTING_SCALE;
typedef struct _NOK_CMP_OFFSET_ARRAY NOK_CMP_OFFSET_ARRAY, * NOK_PCMP_OFFSET_ARRAY;
typedef struct _NOK_DEBUG_DEVICE_ADDRESS NOK_DEBUG_DEVICE_ADDRESS, * NOK_PDEBUG_DEVICE_ADDRESS;
typedef struct _NOK_DEBUG_MEMORY_REQUIREMENTS NOK_DEBUG_MEMORY_REQUIREMENTS, * NOK_PDEBUG_MEMORY_REQUIREMENTS;
typedef struct _NOK_DOCK_INTERFACE NOK_DOCK_INTERFACE, * NOK_PDOCK_INTERFACE;
typedef struct _NOK_FEATURE_ERROR NOK_FEATURE_ERROR, * NOK_PFEATURE_ERROR;
typedef struct _NOK_FEATURE_LOGGED_TRAITS NOK_FEATURE_LOGGED_TRAITS, * NOK_PFEATURE_LOGGED_TRAITS;
typedef struct _NOK_FEATURE_STATE_CHANGE_SUBSCRIPTION__ NOK_FEATURE_STATE_CHANGE_SUBSCRIPTION__, * NOK_PFEATURE_STATE_CHANGE_SUBSCRIPTION__;
typedef struct _NOK_HAL_PRIVATE_DISPATCH NOK_HAL_PRIVATE_DISPATCH, * NOK_PHAL_PRIVATE_DISPATCH;
typedef struct _NOK_LIST_ENTRY32 NOK_LIST_ENTRY32, * NOK_PLIST_ENTRY32;
typedef struct _NOK_LIST_ENTRY64 NOK_LIST_ENTRY64, * NOK_PLIST_ENTRY64;
typedef struct _NOK_PEPHANDLE__ NOK_PEPHANDLE__, * NOK_PPEPHANDLE__;
typedef struct _NOK_POHANDLE__ NOK_POHANDLE__, * NOK_PPOHANDLE__;
typedef struct _NOK_POWER_ACTION_POLICY NOK_POWER_ACTION_POLICY, * NOK_PPOWER_ACTION_POLICY;
typedef struct _NOK_PO_MEMORY_IMAGE NOK_PO_MEMORY_IMAGE, * NOK_PPO_MEMORY_IMAGE;

typedef union _NOK_PS_INTERLOCKED_TIMER_DELAY_VALUES NOK_PS_INTERLOCKED_TIMER_DELAY_VALUES, * NOK_PPS_INTERLOCKED_TIMER_DELAY_VALUES;
typedef union _NOK_PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS NOK_PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS, * NOK_PPS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS;
typedef union _NOK_RTL_RUN_ONCE NOK_RTL_RUN_ONCE, * NOK_PRTL_RUN_ONCE;
typedef union _NOK_SLIST_HEADER NOK_SLIST_HEADER, * NOK_PSLIST_HEADER;
typedef union _NOK_TIMELINE_BITMAP NOK_TIMELINE_BITMAP, * NOK_PTIMELINE_BITMAP;
typedef union _NOK_ULARGE_INTEGER NOK_ULARGE_INTEGER, * NOK_PULARGE_INTEGER;
typedef union _NOK_WHEAP_ERROR_RECORD_WRAPPER_FLAGS NOK_WHEAP_ERROR_RECORD_WRAPPER_FLAGS, * NOK_PWHEAP_ERROR_RECORD_WRAPPER_FLAGS;
typedef union _NOK_WHEA_ERROR_PACKET_FLAGS NOK_WHEA_ERROR_PACKET_FLAGS, * NOK_PWHEA_ERROR_PACKET_FLAGS;
typedef union _NOK_WHEA_ERROR_RECORD_HEADER_FLAGS NOK_WHEA_ERROR_RECORD_HEADER_FLAGS, * NOK_PWHEA_ERROR_RECORD_HEADER_FLAGS;
typedef union _NOK_WHEA_ERROR_RECORD_HEADER_VALIDBITS NOK_WHEA_ERROR_RECORD_HEADER_VALIDBITS, * NOK_PWHEA_ERROR_RECORD_HEADER_VALIDBITS;
typedef union _NOK_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS NOK_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS, * NOK_PWHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS;
typedef union _NOK_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS NOK_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS, * NOK_PWHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS;
typedef union _NOK_WHEA_ERROR_STATUS NOK_WHEA_ERROR_STATUS, * NOK_PWHEA_ERROR_STATUS;
typedef union _NOK_WHEA_EVENT_LOG_ENTRY_FLAGS NOK_WHEA_EVENT_LOG_ENTRY_FLAGS, * NOK_PWHEA_EVENT_LOG_ENTRY_FLAGS;
typedef union _NOK_WHEA_MEMORY_ERROR_SECTION_VALIDBITS NOK_WHEA_MEMORY_ERROR_SECTION_VALIDBITS, * NOK_PWHEA_MEMORY_ERROR_SECTION_VALIDBITS;
typedef union _NOK_WHEA_NOTIFICATION_FLAGS NOK_WHEA_NOTIFICATION_FLAGS, * NOK_PWHEA_NOTIFICATION_FLAGS;
typedef union _NOK_WHEA_PERSISTENCE_INFO NOK_WHEA_PERSISTENCE_INFO, * NOK_PWHEA_PERSISTENCE_INFO;
typedef union _NOK_WHEA_PROCESSOR_GENERIC_ERROR_SECTION_VALIDBITS NOK_WHEA_PROCESSOR_GENERIC_ERROR_SECTION_VALIDBITS, * NOK_PWHEA_PROCESSOR_GENERIC_ERROR_SECTION_VALIDBITS;
typedef union _NOK_WHEA_REVISION NOK_WHEA_REVISION, * NOK_PWHEA_REVISION;
typedef union _NOK_WHEA_TIMESTAMP NOK_WHEA_TIMESTAMP, * NOK_PWHEA_TIMESTAMP;
typedef union _NOK_WHEA_XPF_PROCESSOR_ERROR_SECTION_VALIDBITS NOK_WHEA_XPF_PROCESSOR_ERROR_SECTION_VALIDBITS, * NOK_PWHEA_XPF_PROCESSOR_ERROR_SECTION_VALIDBITS;
typedef union _NOK_XPF_MCE_FLAGS NOK_XPF_MCE_FLAGS, * NOK_PXPF_MCE_FLAGS;
typedef union _NOK_XPF_MC_BANK_FLAGS NOK_XPF_MC_BANK_FLAGS, * NOK_PXPF_MC_BANK_FLAGS;
typedef union _NOK__m128 NOK__m128, * NOK_P_m128;
typedef union _NOK__m64 NOK__m64, * NOK_P_m64;
typedef union _NOK_u NOK_u, * NOK_Pu;
typedef union _NOK_wil_details_FeatureStateCache NOK_wil_details_FeatureStateCache, * NOK_Pwil_details_FeatureStateCache;
typedef union _NOK_wil_details_RecordedState NOK_wil_details_RecordedState, * NOK_Pwil_details_RecordedState;
typedef union _NOK_wil_details_ReportedState NOK_wil_details_ReportedState, * NOK_Pwil_details_ReportedState;
//0x8 bytes (sizeof)
typedef struct _NOK_BATTERY_REPORTING_SCALE
{
    ULONG Granularity;                                                      //0x0
    ULONG Capacity;                                                         //0x4
}NOK_BATTERY_REPORTING_SCALE, * NOK_PBATTERY_REPORTING_SCALE;
//0x18 bytes (sizeof)
typedef struct _NOK_CMP_OFFSET_ARRAY
{
    ULONG FileOffset;                                                       //0x0
    VOID* DataBuffer;                                                       //0x8
    ULONG DataLength;                                                       //0x10
}NOK_CMP_OFFSET_ARRAY, * NOK_PCMP_OFFSET_ARRAY;
//0x18 bytes (sizeof)
typedef struct _NOK_DEBUG_DEVICE_ADDRESS
{
    UCHAR Type;                                                             //0x0
    UCHAR Valid;                                                            //0x1
    union
    {
        UCHAR Reserved[2];                                                  //0x2
        struct
        {
            UCHAR BitWidth;                                                 //0x2
            UCHAR AccessSize;                                               //0x3
        };
    };
    UCHAR* TranslatedAddress;                                               //0x8
    ULONG Length;                                                           //0x10
}NOK_DEBUG_DEVICE_ADDRESS, * NOK_PDEBUG_DEVICE_ADDRESS;
//0x8 bytes (sizeof)
typedef union _NOK_LARGE_INTEGER
{
    struct
    {
        ULONG LowPart;                                                      //0x0
        LONG HighPart;                                                      //0x4
    };
    struct
    {
        ULONG LowPart;                                                      //0x0
        LONG HighPart;                                                      //0x4
    } u;                                                                    //0x0
    LONGLONG QuadPart;                                                      //0x0
}NOK_LARGE_INTEGER, * NOK_PLARGE_INTEGER;
//0x4 bytes (sizeof)
typedef enum _NOK_PROFILE_DEPARTURE_STYLE
{
    NOK_PDS_UPDATE_DEFAULT = 1,
    NOK_PDS_UPDATE_ON_REMOVE = 2,
    NOK_PDS_UPDATE_ON_INTERFACE = 3,
    NOK_PDS_UPDATE_ON_EJECT = 4
}NOK_PROFILE_DEPARTURE_STYLE, * NOK_PPROFILE_DEPARTURE_STYLE;
//0x68 bytes (sizeof)
typedef struct _NOK_FEATURE_ERROR
{
    HRESULT hr;                                                             //0x0
    USHORT lineNumber;                                                      //0x4
    CHAR* file;                                                             //0x8
    CHAR* process;                                                          //0x10
    CHAR* modulePath;                                                       //0x18
    ULONG callerReturnAddressOffset;                                        //0x20
    CHAR* callerModule;                                                     //0x28
    CHAR* message;                                                          //0x30
    USHORT originLineNumber;                                                //0x38
    CHAR* originFile;                                                       //0x40
    CHAR* originModule;                                                     //0x48
    ULONG originCallerReturnAddressOffset;                                  //0x50
    CHAR* originCallerModule;                                               //0x58
    CHAR* originName;                                                       //0x60
}NOK_FEATURE_ERROR, * NOK_PFEATURE_ERROR;
//0x6 bytes (sizeof)
typedef struct _NOK_FEATURE_LOGGED_TRAITS
{
    USHORT version;                                                         //0x0
    USHORT baseVersion;                                                     //0x2
    UCHAR stage;                                                            //0x4
}NOK_FEATURE_LOGGED_TRAITS, * NOK_PFEATURE_LOGGED_TRAITS;
//0x4 bytes (sizeof)
typedef struct _NOK_FEATURE_STATE_CHANGE_SUBSCRIPTION__
{
    LONG unused;                                                            //0x0
}NOK_FEATURE_STATE_CHANGE_SUBSCRIPTION__, * NOK_PFEATURE_STATE_CHANGE_SUBSCRIPTION__;
//0x20 bytes (sizeof)
typedef struct _NOK_INTERFACE
{
    USHORT Size;                                                            //0x0
    USHORT Version;                                                         //0x2
    VOID* Context;                                                          //0x8
    VOID (*InterfaceReference)(VOID* arg1);                                 //0x10
    VOID (*InterfaceDereference)(VOID* arg1);                               //0x18
}NOK_INTERFACE, * NOK_PINTERFACE;
//0x10 bytes (sizeof)
typedef struct _NOK_LIST_ENTRY
{
    NOK_PLIST_ENTRY Flink;                                              //0x0
    NOK_PLIST_ENTRY Blink;                                              //0x8
}NOK_LIST_ENTRY, * NOK_PLIST_ENTRY;
//0x8 bytes (sizeof)
typedef struct _NOK_LIST_ENTRY32
{
    ULONG Flink;                                                            //0x0
    ULONG Blink;                                                            //0x4
}NOK_LIST_ENTRY32, * NOK_PLIST_ENTRY32;
//0x4 bytes (sizeof)
typedef struct _NOK_PEPHANDLE__
{
    LONG unused;                                                            //0x0
}NOK_PEPHANDLE__, * NOK_PPEPHANDLE__;
//0x4 bytes (sizeof)
typedef struct _NOK_POHANDLE__
{
    LONG unused;                                                            //0x0
}NOK_POHANDLE__, * NOK_PPOHANDLE__;
//0x4 bytes (sizeof)
typedef enum _NOK_POWER_ACTION
{
    NOK_PowerActionNone = 0,
    NOK_PowerActionReserved = 1,
    NOK_PowerActionSleep = 2,
    NOK_PowerActionHibernate = 3,
    NOK_PowerActionShutdown = 4,
    NOK_PowerActionShutdownReset = 5,
    NOK_PowerActionShutdownOff = 6,
    NOK_PowerActionWarmEject = 7,
    NOK_PowerActionDisplayOff = 8
}NOK_POWER_ACTION, * NOK_PPOWER_ACTION;
//0x8 bytes (sizeof)
typedef struct _NOK_PROCESSOR_IDLESTATE_INFO
{
    ULONG TimeCheck;                                                        //0x0
    UCHAR DemotePercent;                                                    //0x4
    UCHAR PromotePercent;                                                   //0x5
    UCHAR Spare[2];                                                         //0x6
}NOK_PROCESSOR_IDLESTATE_INFO, * NOK_PPROCESSOR_IDLESTATE_INFO;
//0x20 bytes (sizeof)
typedef struct _NOK_PROCESSOR_IDLESTATE_POLICY
{
    USHORT Revision;                                                        //0x0
    union
    {
        USHORT AsUSHORT;                                                    //0x2
        USHORT AllowScaling:1;                                              //0x2
        USHORT Disabled:1;                                                  //0x2
        USHORT Reserved:14;                                                 //0x2
    } Flags;                                                                //0x2
    ULONG PolicyCount;                                                      //0x4
    NOK_PROCESSOR_IDLESTATE_INFO Policy[3];                              //0x8
}NOK_PROCESSOR_IDLESTATE_POLICY, * NOK_PPROCESSOR_IDLESTATE_POLICY;
//0x1c bytes (sizeof)
typedef struct _NOK_PROCESSOR_PERFSTATE_POLICY
{
    ULONG Revision;                                                         //0x0
    UCHAR MaxThrottle;                                                      //0x4
    UCHAR MinThrottle;                                                      //0x5
    UCHAR BusyAdjThreshold;                                                 //0x6
    union
    {
        UCHAR Spare;                                                        //0x7
        union
        {
            UCHAR AsUCHAR;                                                  //0x7
            UCHAR NoDomainAccounting:1;                                     //0x7
            UCHAR IncreasePolicy:2;                                         //0x7
            UCHAR DecreasePolicy:2;                                         //0x7
            UCHAR Reserved:3;                                               //0x7
        } Flags;                                                            //0x7
    };
    ULONG TimeCheck;                                                        //0x8
    ULONG IncreaseTime;                                                     //0xc
    ULONG DecreaseTime;                                                     //0x10
    ULONG IncreasePercent;                                                  //0x14
    ULONG DecreasePercent;                                                  //0x18
}NOK_PROCESSOR_PERFSTATE_POLICY, * NOK_PPROCESSOR_PERFSTATE_POLICY;
//0x10 bytes (sizeof)
typedef struct _NOK_RTL_HP_ENV_HANDLE
{
    VOID* h[2];                                                             //0x0
}NOK_RTL_HP_ENV_HANDLE, * NOK_PRTL_HP_ENV_HANDLE;
//0x4 bytes (sizeof)
typedef enum _NOK_SYSTEM_POWER_STATE
{
    NOK_PowerSystemUnspecified = 0,
    NOK_PowerSystemWorking = 1,
    NOK_PowerSystemSleeping1 = 2,
    NOK_PowerSystemSleeping2 = 3,
    NOK_PowerSystemSleeping3 = 4,
    NOK_PowerSystemHibernate = 5,
    NOK_PowerSystemShutdown = 6,
    NOK_PowerSystemMaximum = 7
}NOK_SYSTEM_POWER_STATE, * NOK_PSYSTEM_POWER_STATE;
//0xc bytes (sizeof)
typedef struct _NOK_POWER_ACTION_POLICY
{
    NOK_POWER_ACTION Action;                                               //0x0
    ULONG Flags;                                                            //0x4
    ULONG EventCode;                                                        //0x8
}NOK_POWER_ACTION_POLICY, * NOK_PPOWER_ACTION_POLICY;
//0x10 bytes (sizeof)
typedef struct _NOK_LIST_ENTRY64
{
    ULONGLONG Flink;                                                        //0x0
    ULONGLONG Blink;                                                        //0x8
}NOK_LIST_ENTRY64, * NOK_PLIST_ENTRY64;
//0x80 bytes (sizeof)
typedef struct _NOK_ACCESS_REASONS
{
    ULONG Data[32];                                                         //0x0
}NOK_ACCESS_REASONS, * NOK_PACCESS_REASONS;
//0x8 bytes (sizeof)
typedef struct _NOK_LUID
{
    ULONG LowPart;                                                          //0x0
    LONG HighPart;                                                          //0x4
}NOK_LUID, * NOK_PLUID;
//0x8 bytes (sizeof)
typedef struct _NOK_ACL
{
    UCHAR AclRevision;                                                      //0x0
    UCHAR Sbz1;                                                             //0x1
    USHORT AclSize;                                                         //0x2
    USHORT AceCount;                                                        //0x4
    USHORT Sbz2;                                                            //0x6
}NOK_ACL, * NOK_PACL;
//0x24 bytes (sizeof)
typedef struct _NOK_DESCRIPTION_HEADER
{
    ULONG Signature;                                                        //0x0
    ULONG Length;                                                           //0x4
    UCHAR Revision;                                                         //0x8
    UCHAR Checksum;                                                         //0x9
    CHAR OEMID[6];                                                          //0xa
    CHAR OEMTableID[8];                                                     //0x10
    ULONG OEMRevision;                                                      //0x18
    CHAR CreatorID[4];                                                      //0x1c
    ULONG CreatorRev;                                                       //0x20
}NOK_DESCRIPTION_HEADER, * NOK_PDESCRIPTION_HEADER;
//0x8 bytes (sizeof)
typedef struct _NOK_ACPI_METHOD_ARGUMENT_V1
{
    USHORT Type;                                                            //0x0
    USHORT DataLength;                                                      //0x2
    union
    {
        ULONG Argument;                                                     //0x4
        UCHAR Data[1];                                                      //0x4
    };
}NOK_ACPI_METHOD_ARGUMENT_V1, * NOK_PACPI_METHOD_ARGUMENT_V1;
//0x28 bytes (sizeof)
typedef struct _NOK_VACB
{
    VOID* BaseAddress;                                                      //0x0
    NOK_PSHARED_CACHE_MAP SharedCacheMap;                               //0x8
    union
    {
        NOK_LARGE_INTEGER FileOffset;                                    //0x10
        USHORT ActiveCount;                                                 //0x10
        NOK_LIST_ENTRY Links;                                           //0x10
    } Overlay;                                                              //0x10
    NOK_VACB_ARRAY_HEADER* ArrayHead;                                   //0x20
}NOK_VACB, * NOK_PVACB;
//0x28 bytes (sizeof)
typedef struct _NOK_ACTIVATION_CONTEXT_STACK
{
    NOK_PRTL_ACTIVATION_CONTEXT_STACK_FRAME ActiveFrame;                //0x0
    NOK_LIST_ENTRY FrameListCache;                                      //0x8
    ULONG Flags;                                                            //0x18
    ULONG NextCookieSequenceNumber;                                         //0x1c
    ULONG StackId;                                                          //0x20
}NOK_ACTIVATION_CONTEXT_STACK, * NOK_PACTIVATION_CONTEXT_STACK;
//0x18 bytes (sizeof)
typedef struct _NOK_ACTIVATION_CONTEXT_STACK32
{
    ULONG ActiveFrame;                                                      //0x0
    NOK_LIST_ENTRY32 FrameListCache;                                     //0x4
    ULONG Flags;                                                            //0xc
    ULONG NextCookieSequenceNumber;                                         //0x10
    ULONG StackId;                                                          //0x14
}NOK_ACTIVATION_CONTEXT_STACK32, * NOK_PACTIVATION_CONTEXT_STACK32;
//0x8 bytes (sizeof)
typedef struct _NOK_EX_PUSH_LOCK
{
    union
    {
        struct
        {
            ULONGLONG Locked:1;                                             //0x0
            ULONGLONG Waiting:1;                                            //0x0
            ULONGLONG Waking:1;                                             //0x0
            ULONGLONG MultipleShared:1;                                     //0x0
            ULONGLONG Shared:60;                                            //0x0
        };
        ULONGLONG Value;                                                    //0x0
        VOID* Ptr;                                                          //0x0
    };
}NOK_EX_PUSH_LOCK, * NOK_PEX_PUSH_LOCK;
//0x18 bytes (sizeof)
typedef struct _NOK_EVENT_PAYLOAD_PREDICATE
{
    USHORT FieldIndex;                                                      //0x0
    USHORT CompareOp;                                                       //0x2
    ULONGLONG Value[2];                                                     //0x8
}NOK_EVENT_PAYLOAD_PREDICATE, * NOK_PEVENT_PAYLOAD_PREDICATE;
//0x18 bytes (sizeof)
typedef struct _NOK_HALP_DMA_TRANSLATION_BUFFER
{
    NOK_PHALP_DMA_TRANSLATION_BUFFER Next;                              //0x0
    ULONG EntryCount;                                                       //0x8
    NOK_PHALP_DMA_TRANSLATION_ENTRY Entries;                            //0x10
}NOK_HALP_DMA_TRANSLATION_BUFFER, * NOK_PHALP_DMA_TRANSLATION_BUFFER;
//0x8 bytes (sizeof)
typedef struct _NOK_RTL_SRWLOCK
{
    union
    {
        struct
        {
            ULONGLONG Locked:1;                                             //0x0
            ULONGLONG Waiting:1;                                            //0x0
            ULONGLONG Waking:1;                                             //0x0
            ULONGLONG MultipleShared:1;                                     //0x0
            ULONGLONG Shared:60;                                            //0x0
        };
        ULONGLONG Value;                                                    //0x0
        VOID* Ptr;                                                          //0x0
    };
}NOK_RTL_SRWLOCK, * NOK_PRTL_SRWLOCK;
//0x18 bytes (sizeof)
typedef struct _NOK_ALPC_HANDLE_TABLE
{
    NOK_PALPC_HANDLE_ENTRY Handles;                                     //0x0
    ULONG TotalHandles;                                                     //0x8
    ULONG Flags;                                                            //0xc
    NOK_EX_PUSH_LOCK Lock;                                              //0x10
}NOK_ALPC_HANDLE_TABLE, * NOK_PALPC_HANDLE_TABLE;
//0x8 bytes (sizeof)
typedef struct _NOK_ALPC_COMPLETION_LIST_STATE
{
    union
    {
        struct
        {
            ULONGLONG Head:24;                                              //0x0
            ULONGLONG Tail:24;                                              //0x0
            ULONGLONG ActiveThreadCount:16;                                 //0x0
        } s1;                                                               //0x0
        LONGLONG Value;                                                     //0x0
    } u1;                                                                   //0x0
}NOK_ALPC_COMPLETION_LIST_STATE, * NOK_PALPC_COMPLETION_LIST_STATE;
//0x180 bytes (sizeof)
typedef struct _NOK_ALPC_COMPLETION_LIST_HEADER
{
    ULONGLONG StartMagic;                                                   //0x0
    ULONG TotalSize;                                                        //0x8
    ULONG ListOffset;                                                       //0xc
    ULONG ListSize;                                                         //0x10
    ULONG BitmapOffset;                                                     //0x14
    ULONG BitmapSize;                                                       //0x18
    ULONG DataOffset;                                                       //0x1c
    ULONG DataSize;                                                         //0x20
    ULONG AttributeFlags;                                                   //0x24
    ULONG AttributeSize;                                                    //0x28
    volatile NOK_ALPC_COMPLETION_LIST_STATE State;                      //0x40
    volatile ULONG LastMessageId;                                           //0x48
    volatile ULONG LastCallbackId;                                          //0x4c
    volatile ULONG PostCount;                                               //0x80
    volatile ULONG ReturnCount;                                             //0xc0
    volatile ULONG LogSequenceNumber;                                       //0x100
    NOK_RTL_SRWLOCK UserLock;                                           //0x140
    ULONGLONG EndMagic;                                                     //0x148
}NOK_ALPC_COMPLETION_LIST_HEADER, * NOK_PALPC_COMPLETION_LIST_HEADER;
//0x8 bytes (sizeof)
typedef struct _NOK_SINGLE_LIST_ENTRY
{
    NOK_PSINGLE_LIST_ENTRY Next;                                        //0x0
}NOK_SINGLE_LIST_ENTRY, * NOK_PSINGLE_LIST_ENTRY;
//0x18 bytes (sizeof)
typedef struct _NOK_ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY
{
    NOK_SINGLE_LIST_ENTRY ListEntry;                                    //0x0
    NOK_PIO_MINI_COMPLETION_PACKET_USER Packet;                         //0x8
    NOK_PALPC_COMPLETION_PACKET_LOOKASIDE Lookaside;                    //0x10
}NOK_ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY, * NOK_PALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY;
//0x50 bytes (sizeof)
typedef struct _NOK_ALPC_COMPLETION_PACKET_LOOKASIDE
{
    ULONGLONG Lock;                                                         //0x0
    ULONG Size;                                                             //0x8
    ULONG ActiveCount;                                                      //0xc
    ULONG PendingNullCount;                                                 //0x10
    ULONG PendingCheckCompletionListCount;                                  //0x14
    ULONG PendingDelete;                                                    //0x18
    NOK_SINGLE_LIST_ENTRY FreeListHead;                                 //0x20
    VOID* CompletionPort;                                                   //0x28
    VOID* CompletionKey;                                                    //0x30
    NOK_ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY Entry[1];                //0x38
}NOK_ALPC_COMPLETION_PACKET_LOOKASIDE, * NOK_PALPC_COMPLETION_PACKET_LOOKASIDE;
//0x8 bytes (sizeof)
typedef union _NOK_KALPC_DIRECT_EVENT
{
    ULONGLONG Value;                                                        //0x0
    ULONGLONG DirectType:1;                                                 //0x0
    ULONGLONG EventReferenced:1;                                            //0x0
    ULONGLONG EventObjectBits:62;                                           //0x0
}NOK_KALPC_DIRECT_EVENT, * NOK_PKALPC_DIRECT_EVENT;
//0x8 bytes (sizeof)
typedef struct _NOK_ALPC_HANDLE_ENTRY
{
    VOID* Object;                                                           //0x0
}NOK_ALPC_HANDLE_ENTRY, * NOK_PALPC_HANDLE_ENTRY;
//0x28 bytes (sizeof)
typedef struct _NOK_ACTIVATION_CONTEXT_STACK64
{
    ULONGLONG ActiveFrame;                                                  //0x0
    NOK_LIST_ENTRY64 FrameListCache;                                     //0x8
    ULONG Flags;                                                            //0x18
    ULONG NextCookieSequenceNumber;                                         //0x1c
    ULONG StackId;                                                          //0x20
}NOK_ACTIVATION_CONTEXT_STACK64, * NOK_PACTIVATION_CONTEXT_STACK64;
//0x8 bytes (sizeof)
typedef struct _NOK_ALPC_MESSAGE_ATTRIBUTES
{
    ULONG AllocatedAttributes;                                              //0x0
    ULONG ValidAttributes;                                                  //0x4
}NOK_ALPC_MESSAGE_ATTRIBUTES, * NOK_PALPC_MESSAGE_ATTRIBUTES;
//0x4 bytes (sizeof)
typedef enum _NOK_SECURITY_IMPERSONATION_LEVEL
{
    NOK_SecurityAnonymous = 0,
    NOK_SecurityIdentification = 1,
    NOK_SecurityImpersonation = 2,
    NOK_SecurityDelegation = 3
}NOK_SECURITY_IMPERSONATION_LEVEL, * NOK_PSECURITY_IMPERSONATION_LEVEL;
//0x48 bytes (sizeof)
typedef struct _NOK_ALPC_COMMUNICATION_INFO
{
    NOK_PALPC_PORT ConnectionPort;                                      //0x0
    NOK_PALPC_PORT ServerCommunicationPort;                             //0x8
    NOK_PALPC_PORT ClientCommunicationPort;                             //0x10
    NOK_LIST_ENTRY CommunicationList;                                   //0x18
    NOK_ALPC_HANDLE_TABLE HandleTable;                                  //0x28
    NOK_PKALPC_MESSAGE CloseMessage;                                    //0x40
}NOK_ALPC_COMMUNICATION_INFO, * NOK_PALPC_COMMUNICATION_INFO;
//0x8 bytes (sizeof)
typedef struct _NOK_ALPC_WORK_ON_BEHALF_TICKET
{
    ULONG ThreadId;                                                         //0x0
    ULONG ThreadCreationTimeLow;                                            //0x4
}NOK_ALPC_WORK_ON_BEHALF_TICKET, * NOK_PALPC_WORK_ON_BEHALF_TICKET;
//0x1c bytes (sizeof)
typedef struct _NOK_AMD64_DBGKD_CONTROL_SET
{
    ULONG TraceFlag;                                                        //0x0
    ULONGLONG Dr7;                                                          //0x4
    ULONGLONG CurrentSymbolStart;                                           //0xc
    ULONGLONG CurrentSymbolEnd;                                             //0x14
}NOK_AMD64_DBGKD_CONTROL_SET, * NOK_PAMD64_DBGKD_CONTROL_SET;
//0x8 bytes (sizeof)
typedef struct _NOK_ARBITER_ADD_RESERVED_PARAMETERS
{
    NOK_PDEVICE_OBJECT ReserveDevice;                                   //0x0
}NOK_ARBITER_ADD_RESERVED_PARAMETERS, * NOK_PARBITER_ADD_RESERVED_PARAMETERS;
//0x50 bytes (sizeof)
typedef struct _NOK_ARBITER_ALLOCATION_STATE
{
    ULONGLONG Start;                                                        //0x0
    ULONGLONG End;                                                          //0x8
    ULONGLONG CurrentMinimum;                                               //0x10
    ULONGLONG CurrentMaximum;                                               //0x18
    NOK_PARBITER_LIST_ENTRY Entry;                                      //0x20
    NOK_PARBITER_ALTERNATIVE CurrentAlternative;                        //0x28
    ULONG AlternativeCount;                                                 //0x30
    NOK_PARBITER_ALTERNATIVE Alternatives;                              //0x38
    USHORT Flags;                                                           //0x40
    UCHAR RangeAttributes;                                                  //0x42
    UCHAR RangeAvailableAttributes;                                         //0x43
    ULONGLONG WorkSpace;                                                    //0x48
}NOK_ARBITER_ALLOCATION_STATE, * NOK_PARBITER_ALLOCATION_STATE;
//0x40 bytes (sizeof)
typedef struct _NOK_ARBITER_ALTERNATIVE
{
    ULONGLONG Minimum;                                                      //0x0
    ULONGLONG Maximum;                                                      //0x8
    ULONGLONG Length;                                                       //0x10
    ULONGLONG Alignment;                                                    //0x18
    LONG Priority;                                                          //0x20
    ULONG Flags;                                                            //0x24
    NOK_PIO_RESOURCE_DESCRIPTOR Descriptor;                             //0x28
    ULONG Reserved[3];                                                      //0x30
}NOK_ARBITER_ALTERNATIVE, * NOK_PARBITER_ALTERNATIVE;
//0x8 bytes (sizeof)
typedef struct _NOK_ARBITER_BOOT_ALLOCATION_PARAMETERS
{
    NOK_PLIST_ENTRY ArbitrationList;                                    //0x0
}NOK_ARBITER_BOOT_ALLOCATION_PARAMETERS, * NOK_PARBITER_BOOT_ALLOCATION_PARAMETERS;
//0x18 bytes (sizeof)
typedef struct _NOK_ARBITER_CONFLICT_INFO
{
    NOK_PDEVICE_OBJECT OwningObject;                                    //0x0
    ULONGLONG Start;                                                        //0x8
    ULONGLONG End;                                                          //0x10
}NOK_ARBITER_CONFLICT_INFO, * NOK_PARBITER_CONFLICT_INFO;
//0x10 bytes (sizeof)
typedef struct _NOK_ARBITER_ORDERING
{
    ULONGLONG Start;                                                        //0x0
    ULONGLONG End;                                                          //0x8
}NOK_ARBITER_ORDERING, * NOK_PARBITER_ORDERING;
//0x4 bytes (sizeof)
typedef enum _NOK_ARBITER_ACTION
{
    NOK_ArbiterActionTestAllocation = 0,
    NOK_ArbiterActionRetestAllocation = 1,
    NOK_ArbiterActionCommitAllocation = 2,
    NOK_ArbiterActionRollbackAllocation = 3,
    NOK_ArbiterActionQueryAllocatedResources = 4,
    NOK_ArbiterActionWriteReservedResources = 5,
    NOK_ArbiterActionQueryConflict = 6,
    NOK_ArbiterActionQueryArbitrate = 7,
    NOK_ArbiterActionAddReserved = 8,
    NOK_ArbiterActionBootAllocation = 9
}NOK_ARBITER_ACTION, * NOK_PARBITER_ACTION;
//0xc bytes (sizeof)
typedef struct _NOK_SECURITY_QUALITY_OF_SERVICE
{
    ULONG Length;                                                           //0x0
    NOK_SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;                  //0x4
    UCHAR ContextTrackingMode;                                              //0x8
    UCHAR EffectiveOnly;                                                    //0x9
}NOK_SECURITY_QUALITY_OF_SERVICE, * NOK_PSECURITY_QUALITY_OF_SERVICE;
//0x10 bytes (sizeof)
typedef struct _NOK_ARBITER_ORDERING_LIST
{
    USHORT Count;                                                           //0x0
    USHORT Maximum;                                                         //0x2
    NOK_PARBITER_ORDERING Orderings;                                    //0x8
}NOK_ARBITER_ORDERING_LIST, * NOK_PARBITER_ORDERING_LIST;
//0x28 bytes (sizeof)
typedef struct _NOK_RTL_RANGE
{
    ULONGLONG Start;                                                        //0x0
    ULONGLONG End;                                                          //0x8
    VOID* UserData;                                                         //0x10
    VOID* Owner;                                                            //0x18
    UCHAR Attributes;                                                       //0x20
    UCHAR Flags;                                                            //0x21
}NOK_RTL_RANGE, * NOK_PRTL_RANGE;
//0x8 bytes (sizeof)
typedef struct _NOK_ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS
{
    NOK_PCM_PARTIAL_RESOURCE_LIST* AllocatedResources;                  //0x0
}NOK_ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS, * NOK_PARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS;
//0x8 bytes (sizeof)
typedef struct _NOK_ARBITER_QUERY_ARBITRATE_PARAMETERS
{
    NOK_PLIST_ENTRY ArbitrationList;                                    //0x0
}NOK_ARBITER_QUERY_ARBITRATE_PARAMETERS, * NOK_PARBITER_QUERY_ARBITRATE_PARAMETERS;
//0x20 bytes (sizeof)
typedef struct _NOK_ARBITER_QUERY_CONFLICT_PARAMETERS
{
    NOK_PDEVICE_OBJECT PhysicalDeviceObject;                            //0x0
    NOK_PIO_RESOURCE_DESCRIPTOR ConflictingResource;                    //0x8
    ULONG* ConflictCount;                                                   //0x10
    NOK_PARBITER_CONFLICT_INFO* Conflicts;                              //0x18
}NOK_ARBITER_QUERY_CONFLICT_PARAMETERS, * NOK_PARBITER_QUERY_CONFLICT_PARAMETERS;
//0x18 bytes (sizeof)
typedef struct _NOK_ARBITER_RETEST_ALLOCATION_PARAMETERS
{
    NOK_PLIST_ENTRY ArbitrationList;                                    //0x0
    ULONG AllocateFromCount;                                                //0x8
    NOK_PCM_PARTIAL_RESOURCE_DESCRIPTOR AllocateFrom;                   //0x10
}NOK_ARBITER_RETEST_ALLOCATION_PARAMETERS, * NOK_PARBITER_RETEST_ALLOCATION_PARAMETERS;
//0x18 bytes (sizeof)
typedef struct _NOK_ARBITER_TEST_ALLOCATION_PARAMETERS
{
    NOK_PLIST_ENTRY ArbitrationList;                                    //0x0
    ULONG AllocateFromCount;                                                //0x8
    NOK_PCM_PARTIAL_RESOURCE_DESCRIPTOR AllocateFrom;                   //0x10
}NOK_ARBITER_TEST_ALLOCATION_PARAMETERS, * NOK_PARBITER_TEST_ALLOCATION_PARAMETERS;
//0x20 bytes (sizeof)
typedef struct _NOK_ARBITER_PARAMETERS
{
    union
    {
        NOK_ARBITER_TEST_ALLOCATION_PARAMETERS TestAllocation;          //0x0
        NOK_ARBITER_RETEST_ALLOCATION_PARAMETERS RetestAllocation;      //0x0
        NOK_ARBITER_BOOT_ALLOCATION_PARAMETERS BootAllocation;          //0x0
        NOK_ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS QueryAllocatedResources; //0x0
        NOK_ARBITER_QUERY_CONFLICT_PARAMETERS QueryConflict;            //0x0
        NOK_ARBITER_QUERY_ARBITRATE_PARAMETERS QueryArbitrate;          //0x0
        NOK_ARBITER_ADD_RESERVED_PARAMETERS AddReserved;                //0x0
    } Parameters;                                                           //0x0
}NOK_ARBITER_PARAMETERS, * NOK_PARBITER_PARAMETERS;
//0x28 bytes (sizeof)
typedef struct _NOK_ISRDPCSTATS_SEQUENCE
{
    ULONG SequenceNumber;                                                   //0x0
    ULONGLONG IsrTime;                                                      //0x8
    ULONGLONG IsrCount;                                                     //0x10
    ULONGLONG DpcTime;                                                      //0x18
    ULONGLONG DpcCount;                                                     //0x20
}NOK_ISRDPCSTATS_SEQUENCE, * NOK_PISRDPCSTATS_SEQUENCE;
//0x60 bytes (sizeof)
typedef struct _NOK_ISRDPCSTATS
{
    ULONGLONG IsrTime;                                                      //0x0
    ULONGLONG IsrTimeStart;                                                 //0x8
    ULONGLONG IsrCount;                                                     //0x10
    ULONGLONG DpcTime;                                                      //0x18
    ULONGLONG DpcTimeStart;                                                 //0x20
    ULONGLONG DpcCount;                                                     //0x28
    UCHAR IsrActive;                                                        //0x30
    UCHAR Reserved[7];                                                      //0x31
    NOK_ISRDPCSTATS_SEQUENCE DpcWatchdog;                               //0x38
}NOK_ISRDPCSTATS, * NOK_PISRDPCSTATS;
//0x18 bytes (sizeof)
typedef struct _NOK_ARM64_DBGKD_CONTROL_SET
{
    ULONG Continue;                                                         //0x0
    ULONG TraceFlag;                                                        //0x4
    ULONGLONG CurrentSymbolStart;                                           //0x8
    ULONGLONG CurrentSymbolEnd;                                             //0x10
}NOK_ARM64_DBGKD_CONTROL_SET, * NOK_PARM64_DBGKD_CONTROL_SET;
//0xc bytes (sizeof)
typedef struct _NOK_ARMCE_DBGKD_CONTROL_SET
{
    ULONG Continue;                                                         //0x0
    ULONG CurrentSymbolStart;                                               //0x4
    ULONG CurrentSymbolEnd;                                                 //0x8
}NOK_ARMCE_DBGKD_CONTROL_SET, * NOK_PARMCE_DBGKD_CONTROL_SET;
//0xc bytes (sizeof)
typedef struct _NOK_ARM_DBGKD_CONTROL_SET
{
    ULONG Continue;                                                         //0x0
    ULONG CurrentSymbolStart;                                               //0x4
    ULONG CurrentSymbolEnd;                                                 //0x8
}NOK_ARM_DBGKD_CONTROL_SET, * NOK_PARM_DBGKD_CONTROL_SET;
//0x4 bytes (sizeof)
typedef struct _NOK_ARM_LOADER_BLOCK
{
    ULONG PlaceHolder;                                                      //0x0
}NOK_ARM_LOADER_BLOCK, * NOK_PARM_LOADER_BLOCK;
//0x194 bytes (sizeof)
typedef struct _NOK_ASYNC_READ_THREAD_STATS
{
    ULONG CurrentLoad[101];                                                 //0x0
}NOK_ASYNC_READ_THREAD_STATS, * NOK_PASYNC_READ_THREAD_STATS;
//0x6 bytes (sizeof)
typedef struct _NOK_SID_IDENTIFIER_AUTHORITY
{
    UCHAR Value[6];                                                         //0x0
}NOK_SID_IDENTIFIER_AUTHORITY, * NOK_PSID_IDENTIFIER_AUTHORITY;
//0xc bytes (sizeof)
typedef struct _NOK_SID
{
    UCHAR Revision;                                                         //0x0
    UCHAR SubAuthorityCount;                                                //0x1
    NOK_SID_IDENTIFIER_AUTHORITY IdentifierAuthority;                   //0x2
    ULONG SubAuthority[1];                                                  //0x8
}NOK_SID, * NOK_PSID;
//0x10 bytes (sizeof)
typedef struct _NOK_ARC_DISK_INFORMATION
{
    NOK_LIST_ENTRY DiskSignatures;                                      //0x0
}NOK_ARC_DISK_INFORMATION, * NOK_PARC_DISK_INFORMATION;
//0x10 bytes (sizeof)
typedef struct _NOK_GENERIC_MAPPING
{
    ULONG GenericRead;                                                      //0x0
    ULONG GenericWrite;                                                     //0x4
    ULONG GenericExecute;                                                   //0x8
    ULONG GenericAll;                                                       //0xc
}NOK_GENERIC_MAPPING, * NOK_PGENERIC_MAPPING;
//0x30 bytes (sizeof)
typedef struct _NOK_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION
{
    ULONG SecurityAttributeCount;                                           //0x0
    NOK_LIST_ENTRY SecurityAttributesList;                              //0x8
    ULONG WorkingSecurityAttributeCount;                                    //0x18
    NOK_LIST_ENTRY WorkingSecurityAttributesList;                       //0x20
}NOK_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION, * NOK_PAUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION;
//0x30 bytes (sizeof)
typedef struct _NOK_BITMAP_RANGE
{
    NOK_LIST_ENTRY Links;                                               //0x0
    LONGLONG BasePage;                                                      //0x10
    ULONG FirstDirtyPage;                                                   //0x18
    ULONG LastDirtyPage;                                                    //0x1c
    ULONG DirtyPages;                                                       //0x20
    ULONG* Bitmap;                                                          //0x28
}NOK_BITMAP_RANGE, * NOK_PBITMAP_RANGE;
//0x10 bytes (sizeof)
typedef struct _NOK_SLIST_ENTRY
{
    NOK_PSLIST_ENTRY Next;                                              //0x0
}NOK_SLIST_ENTRY, * NOK_PSLIST_ENTRY;
//0x30 bytes (sizeof)
typedef struct _NOK_BLOB
{
    union
    {
        NOK_LIST_ENTRY ResourceList;                                    //0x0
        NOK_SLIST_ENTRY FreeListEntry;                                  //0x0
    };
    union
    {
        struct
        {
            UCHAR ReferenceCache:1;                                         //0x10
            UCHAR Lookaside:1;                                              //0x10
            UCHAR Initializing:1;                                           //0x10
            UCHAR Deleted:1;                                                //0x10
        } s1;                                                               //0x10
        UCHAR Flags;                                                        //0x10
    } u1;                                                                   //0x10
    UCHAR ResourceId;                                                       //0x11
    SHORT CachedReferences;                                                 //0x12
    LONGLONG ReferenceCount;                                                //0x18
    NOK_EX_PUSH_LOCK Lock;                                              //0x20
}NOK_BLOB, * NOK_PBLOB;
//0x4 bytes (sizeof)
typedef enum _NOK_BOOT_ENTROPY_SOURCE_ID
{
    NOK_BootEntropySourceNone = 0,
    NOK_BootEntropySourceSeedfile = 1,
    NOK_BootEntropySourceExternal = 2,
    NOK_BootEntropySourceTpm = 3,
    NOK_BootEntropySourceRdrand = 4,
    NOK_BootEntropySourceTime = 5,
    NOK_BootEntropySourceAcpiOem0 = 6,
    NOK_BootEntropySourceUefi = 7,
    NOK_BootEntropySourceCng = 8,
    NOK_BootEntropySourceTcbTpm = 9,
    NOK_BootEntropySourceTcbRdrand = 10,
    NOK_BootMaxEntropySources = 10
}NOK_BOOT_ENTROPY_SOURCE_ID, * NOK_PBOOT_ENTROPY_SOURCE_ID;
//0x4 bytes (sizeof)
typedef enum _NOK_BOOT_ENTROPY_SOURCE_RESULT_CODE
{
    NOK_BootEntropySourceStructureUninitialized = 0,
    NOK_BootEntropySourceDisabledByPolicy = 1,
    NOK_BootEntropySourceNotPresent = 2,
    NOK_BootEntropySourceError = 3,
    NOK_BootEntropySourceSuccess = 4
}NOK_BOOT_ENTROPY_SOURCE_RESULT_CODE, * NOK_PBOOT_ENTROPY_SOURCE_RESULT_CODE;
//0x10 bytes (sizeof)
typedef struct _NOK_BUS_EXTENSION_LIST
{
    VOID* Next;                                                             //0x0
    NOK_PPI_BUS_EXTENSION BusExtension;                                 //0x8
}NOK_BUS_EXTENSION_LIST, * NOK_PBUS_EXTENSION_LIST;
//0x20 bytes (sizeof)
typedef struct _NOK_ALPC_PROCESS_CONTEXT
{
    NOK_EX_PUSH_LOCK Lock;                                              //0x0
    NOK_LIST_ENTRY ViewListHead;                                        //0x8
    volatile ULONGLONG PagedPoolQuotaCache;                                 //0x18
}NOK_ALPC_PROCESS_CONTEXT, * NOK_PALPC_PROCESS_CONTEXT;
//0x10 bytes (sizeof)
typedef union _NOK_SLIST_HEADER
{
    struct
    {
        ULONGLONG Alignment;                                                //0x0
        ULONGLONG Region;                                                   //0x8
    };
    struct
    {
        ULONGLONG Depth:16;                                                 //0x0
        ULONGLONG Sequence:48;                                              //0x0
        ULONGLONG Reserved:4;                                               //0x8
        ULONGLONG NextEntry:60;                                             //0x8
    } HeaderX64;                                                            //0x0
}NOK_SLIST_HEADER, * NOK_PSLIST_HEADER;
//0x4 bytes (sizeof)
typedef enum _NOK_PROCESSOR_CACHE_TYPE
{
    NOK_CacheUnified = 0,
    NOK_CacheInstruction = 1,
    NOK_CacheData = 2,
    NOK_CacheTrace = 3
}NOK_PROCESSOR_CACHE_TYPE, * NOK_PPROCESSOR_CACHE_TYPE;
//0x20 bytes (sizeof)
typedef struct _NOK_CACHE_MANAGER_CALLBACKS
{
    UCHAR (*AcquireForLazyWrite)(VOID* arg1, UCHAR arg2);                   //0x0
    VOID (*ReleaseFromLazyWrite)(VOID* arg1);                               //0x8
    UCHAR (*AcquireForReadAhead)(VOID* arg1, UCHAR arg2);                   //0x10
    VOID (*ReleaseFromReadAhead)(VOID* arg1);                               //0x18
}NOK_CACHE_MANAGER_CALLBACKS, * NOK_PCACHE_MANAGER_CALLBACKS;
//0x18 bytes (sizeof)
typedef struct _NOK_DISPATCHER_HEADER
{
    union
    {
        volatile LONG Lock;                                                 //0x0
        LONG LockNV;                                                        //0x0
        struct
        {
            UCHAR Type;                                                     //0x0
            UCHAR Signalling;                                               //0x1
            UCHAR Size;                                                     //0x2
            UCHAR Reserved1;                                                //0x3
        };
        struct
        {
            UCHAR TimerType;                                                //0x0
            union
            {
                UCHAR TimerControlFlags;                                    //0x1
                struct
                {
                    UCHAR Absolute:1;                                       //0x1
                    UCHAR Wake:1;                                           //0x1
                    UCHAR EncodedTolerableDelay:6;                          //0x1
                };
            };
            UCHAR Hand;                                                     //0x2
            union
            {
                UCHAR TimerMiscFlags;                                       //0x3
                struct
                {
                    UCHAR Index:6;                                          //0x3
                    UCHAR Inserted:1;                                       //0x3
                    volatile UCHAR Expired:1;                               //0x3
                };
            };
        };
        struct
        {
            UCHAR Timer2Type;                                               //0x0
            union
            {
                UCHAR Timer2Flags;                                          //0x1
                struct
                {
                    UCHAR Timer2Inserted:1;                                 //0x1
                    UCHAR Timer2Expiring:1;                                 //0x1
                    UCHAR Timer2CancelPending:1;                            //0x1
                    UCHAR Timer2SetPending:1;                               //0x1
                    UCHAR Timer2Running:1;                                  //0x1
                    UCHAR Timer2Disabled:1;                                 //0x1
                    UCHAR Timer2ReservedFlags:2;                            //0x1
                };
            };
            UCHAR Timer2ComponentId;                                        //0x2
            UCHAR Timer2RelativeId;                                         //0x3
        };
        struct
        {
            UCHAR QueueType;                                                //0x0
            union
            {
                UCHAR QueueControlFlags;                                    //0x1
                struct
                {
                    UCHAR Abandoned:1;                                      //0x1
                    UCHAR DisableIncrement:1;                               //0x1
                    UCHAR QueueReservedControlFlags:6;                      //0x1
                };
            };
            UCHAR QueueSize;                                                //0x2
            UCHAR QueueReserved;                                            //0x3
        };
        struct
        {
            UCHAR ThreadType;                                               //0x0
            UCHAR ThreadReserved;                                           //0x1
            union
            {
                UCHAR ThreadControlFlags;                                   //0x2
                struct
                {
                    UCHAR CycleProfiling:1;                                 //0x2
                    UCHAR CounterProfiling:1;                               //0x2
                    UCHAR GroupScheduling:1;                                //0x2
                    UCHAR AffinitySet:1;                                    //0x2
                    UCHAR Tagged:1;                                         //0x2
                    UCHAR EnergyProfiling:1;                                //0x2
                    UCHAR SchedulerAssist:1;                                //0x2
                    UCHAR ThreadReservedControlFlags:1;                     //0x2
                };
            };
            union
            {
                UCHAR DebugActive;                                          //0x3
                struct
                {
                    UCHAR ActiveDR7:1;                                      //0x3
                    UCHAR Instrumented:1;                                   //0x3
                    UCHAR Minimal:1;                                        //0x3
                    UCHAR Reserved4:2;                                      //0x3
                    UCHAR AltSyscall:1;                                     //0x3
                    UCHAR UmsScheduled:1;                                   //0x3
                    UCHAR UmsPrimary:1;                                     //0x3
                };
            };
        };
        struct
        {
            UCHAR MutantType;                                               //0x0
            UCHAR MutantSize;                                               //0x1
            UCHAR DpcActive;                                                //0x2
            UCHAR MutantReserved;                                           //0x3
        };
    };
    LONG SignalState;                                                       //0x4
    NOK_LIST_ENTRY WaitListHead;                                        //0x8
}NOK_DISPATCHER_HEADER, * NOK_PDISPATCHER_HEADER;
//0x4 bytes (sizeof)
typedef enum _NOK_ARBITER_REQUEST_SOURCE
{
    NOK_ArbiterRequestUndefined = -1,
    NOK_ArbiterRequestLegacyReported = 0,
    NOK_ArbiterRequestHalReported = 1,
    NOK_ArbiterRequestLegacyAssigned = 2,
    NOK_ArbiterRequestPnpDetected = 3,
    NOK_ArbiterRequestPnpEnumerated = 4
}NOK_ARBITER_REQUEST_SOURCE, * NOK_PARBITER_REQUEST_SOURCE;
//0x28 bytes (sizeof)
typedef struct _NOK_CALL_HASH_ENTRY
{
    NOK_LIST_ENTRY ListEntry;                                           //0x0
    VOID* CallersAddress;                                                   //0x10
    VOID* CallersCaller;                                                    //0x18
    ULONG CallCount;                                                        //0x20
}NOK_CALL_HASH_ENTRY, * NOK_PCALL_HASH_ENTRY;
//0x20 bytes (sizeof)
typedef struct _NOK_CC_ASYNC_READ_CONTEXT
{
    UCHAR (*CompletionRoutine)(VOID* arg1);                                 //0x0
    VOID* Context;                                                          //0x8
    NOK_PMDL Mdl;                                                       //0x10
    CHAR RequestorMode;                                                     //0x18
    ULONG NestingLevel;                                                     //0x1c
}NOK_CC_ASYNC_READ_CONTEXT, * NOK_PCC_ASYNC_READ_CONTEXT;
//0x18 bytes (sizeof)
typedef struct _NOK_DIRTY_PAGE_STATISTICS
{
    ULONGLONG DirtyPages;                                                   //0x0
    ULONGLONG DirtyPagesLastScan;                                           //0x8
    ULONG DirtyPagesScheduledLastScan;                                      //0x10
}NOK_DIRTY_PAGE_STATISTICS, * NOK_PDIRTY_PAGE_STATISTICS;
//0x408 bytes (sizeof)
typedef struct _NOK_CALL_PERFORMANCE_DATA
{
    ULONGLONG SpinLock;                                                     //0x0
    NOK_LIST_ENTRY HashTable[64];                                       //0x8
}NOK_CALL_PERFORMANCE_DATA, * NOK_PCALL_PERFORMANCE_DATA;
//0x8 bytes (sizeof)
typedef struct _NOK_CM_BIG_DATA
{
    USHORT Signature;                                                       //0x0
    USHORT Count;                                                           //0x2
    ULONG List;                                                             //0x4
}NOK_CM_BIG_DATA, * NOK_PCM_BIG_DATA;
//0x8 bytes (sizeof)
typedef struct _NOK_CHILD_LIST
{
    ULONG Count;                                                            //0x0
    ULONG List;                                                             //0x4
}NOK_CHILD_LIST, * NOK_PCHILD_LIST;
//0x10 bytes (sizeof)
typedef struct _NOK_CLIENT_ID
{
    VOID* UniqueProcess;                                                    //0x0
    VOID* UniqueThread;                                                     //0x8
}NOK_CLIENT_ID, * NOK_PCLIENT_ID;
//0x8 bytes (sizeof)
typedef struct _NOK_CLIENT_ID32
{
    ULONG UniqueProcess;                                                    //0x0
    ULONG UniqueThread;                                                     //0x4
}NOK_CLIENT_ID32, * NOK_PCLIENT_ID32;
//0x10 bytes (sizeof)
typedef struct _NOK_CLIENT_ID64
{
    ULONGLONG UniqueProcess;                                                //0x0
    ULONGLONG UniqueThread;                                                 //0x8
}NOK_CLIENT_ID64, * NOK_PCLIENT_ID64;
//0x8 bytes (sizeof)
typedef struct _NOK_CMSI_RW_LOCK
{
    VOID* Reserved;                                                         //0x0
}NOK_CMSI_RW_LOCK, * NOK_PCMSI_RW_LOCK;
//0x30 bytes (sizeof)
typedef struct _NOK_CC_EXTERNAL_CACHE_INFO
{
    VOID (*Callback)(VOID* arg1, ULONGLONG arg2, ULONG arg3);               //0x0
    NOK_DIRTY_PAGE_STATISTICS DirtyPageStatistics;                      //0x8
    NOK_LIST_ENTRY Links;                                               //0x20
}NOK_CC_EXTERNAL_CACHE_INFO, * NOK_PCC_EXTERNAL_CACHE_INFO;
//0x4 bytes (sizeof)
typedef enum _NOK_CM_DIRTY_VECTOR_OPERATION
{
    NOK_DirtyVectorModified = 0,
    NOK_DirtyDataCaptureStart = 1,
    NOK_DirtyDataCaptureEnd = 2
}NOK_CM_DIRTY_VECTOR_OPERATION, * NOK_PCM_DIRTY_VECTOR_OPERATION;
//0x10 bytes (sizeof)
typedef struct _NOK_GUID
{
    ULONG Data1;                                                            //0x0
    USHORT Data2;                                                           //0x4
    USHORT Data3;                                                           //0x6
    UCHAR Data4[8];                                                         //0x8
}NOK_GUID, * NOK_PGUID;
//0x10 bytes (sizeof)
typedef struct _NOK_CMSI_PROCESS_TUPLE
{
    VOID* ProcessHandle;                                                    //0x0
    VOID* ProcessReference;                                                 //0x8
}NOK_CMSI_PROCESS_TUPLE, * NOK_PCMSI_PROCESS_TUPLE;
//0x20 bytes (sizeof)
typedef struct _NOK_CMP_DISCARD_AND_REPLACE_KCB_CONTEXT
{
    NOK_PCM_KEY_CONTROL_BLOCK BaseKcb;                                  //0x0
    LONG PrepareStatus;                                                     //0x8
    NOK_LIST_ENTRY ClonedKcbListHead;                                   //0x10
}NOK_CMP_DISCARD_AND_REPLACE_KCB_CONTEXT, * NOK_PCMP_DISCARD_AND_REPLACE_KCB_CONTEXT;
//0x8 bytes (sizeof)
typedef struct _NOK_CM_KEY_INDEX
{
    USHORT Signature;                                                       //0x0
    USHORT Count;                                                           //0x2
    ULONG List[1];                                                          //0x4
}NOK_CM_KEY_INDEX, * NOK_PCM_KEY_INDEX;
//0x4 bytes (sizeof)
typedef struct _NOK_CM_COMPONENT_HASH
{
    ULONG Hash;                                                             //0x0
}NOK_CM_COMPONENT_HASH, * NOK_PCM_COMPONENT_HASH;
//0x4 bytes (sizeof)
typedef struct _NOK_CM_PATH_HASH
{
    ULONG Hash;                                                             //0x0
}NOK_CM_PATH_HASH, * NOK_PCM_PATH_HASH;
//0x48 bytes (sizeof)
typedef struct _NOK_CM_DIRTY_VECTOR_LOG_ENTRY
{
    NOK_PETHREAD Thread;                                                //0x0
    NOK_CM_DIRTY_VECTOR_OPERATION Operation;                              //0x8
    union
    {
        struct
        {
            ULONG Start;                                                    //0xc
            ULONG Length;                                                   //0x10
        } DirtyVectorModifiedContext;                                       //0xc
        struct
        {
            ULONG RangeCount;                                               //0xc
            ULONG SetBitCount;                                              //0x10
        } DirtyDataCaptureContext;                                          //0xc
        struct
        {
            ULONG Context1;                                                 //0xc
            ULONG Context2;                                                 //0x10
        } Raw;                                                              //0xc
    } Data;                                                                 //0xc
    VOID* Stack[6];                                                         //0x18
}NOK_CM_DIRTY_VECTOR_LOG_ENTRY, * NOK_PCM_DIRTY_VECTOR_LOG_ENTRY;
//0x4 bytes (sizeof)
typedef struct _NOK_CM_FAST_LEAF_HINT
{
    union
    {
        UCHAR Characters[4];                                                //0x0
        ULONG FullHint;                                                     //0x0
    };
}NOK_CM_FAST_LEAF_HINT, * NOK_PCM_FAST_LEAF_HINT;
//0x14 bytes (sizeof)
typedef struct _NOK_CM_PARTIAL_RESOURCE_DESCRIPTOR
{
    UCHAR Type;                                                             //0x0
    UCHAR ShareDisposition;                                                 //0x1
    USHORT Flags;                                                           //0x2
    union
    {
        struct
        {
            NOK_LARGE_INTEGER Start;                                     //0x4
            ULONG Length;                                                   //0xc
        } Generic;                                                          //0x4
        struct
        {
            NOK_LARGE_INTEGER Start;                                     //0x4
            ULONG Length;                                                   //0xc
        } Port;                                                             //0x4
        struct
        {
            USHORT Level;                                                   //0x4
            USHORT Group;                                                   //0x6
            ULONG Vector;                                                   //0x8
            ULONGLONG Affinity;                                             //0xc
        } Interrupt;                                                        //0x4
        struct
        {
            union
            {
                struct
                {
                    USHORT Group;                                           //0x4
                    USHORT MessageCount;                                    //0x6
                    ULONG Vector;                                           //0x8
                    ULONGLONG Affinity;                                     //0xc
                } Raw;                                                      //0x4
                struct
                {
                    USHORT Level;                                           //0x4
                    USHORT Group;                                           //0x6
                    ULONG Vector;                                           //0x8
                    ULONGLONG Affinity;                                     //0xc
                } Translated;                                               //0x4
            };
        } MessageInterrupt;                                                 //0x4
        struct
        {
            NOK_LARGE_INTEGER Start;                                     //0x4
            ULONG Length;                                                   //0xc
        } Memory;                                                           //0x4
        struct
        {
            ULONG Channel;                                                  //0x4
            ULONG Port;                                                     //0x8
            ULONG Reserved1;                                                //0xc
        } Dma;                                                              //0x4
        struct
        {
            ULONG Channel;                                                  //0x4
            ULONG RequestLine;                                              //0x8
            UCHAR TransferWidth;                                            //0xc
            UCHAR Reserved1;                                                //0xd
            UCHAR Reserved2;                                                //0xe
            UCHAR Reserved3;                                                //0xf
        } DmaV3;                                                            //0x4
        struct
        {
            ULONG Data[3];                                                  //0x4
        } DevicePrivate;                                                    //0x4
        struct
        {
            ULONG Start;                                                    //0x4
            ULONG Length;                                                   //0x8
            ULONG Reserved;                                                 //0xc
        } BusNumber;                                                        //0x4
        struct
        {
            ULONG DataSize;                                                 //0x4
            ULONG Reserved1;                                                //0x8
            ULONG Reserved2;                                                //0xc
        } DeviceSpecificData;                                               //0x4
        struct
        {
            NOK_LARGE_INTEGER Start;                                     //0x4
            ULONG Length40;                                                 //0xc
        } Memory40;                                                         //0x4
        struct
        {
            NOK_LARGE_INTEGER Start;                                     //0x4
            ULONG Length48;                                                 //0xc
        } Memory48;                                                         //0x4
        struct
        {
            NOK_LARGE_INTEGER Start;                                     //0x4
            ULONG Length64;                                                 //0xc
        } Memory64;                                                         //0x4
        struct
        {
            UCHAR Class;                                                    //0x4
            UCHAR Type;                                                     //0x5
            UCHAR Reserved1;                                                //0x6
            UCHAR Reserved2;                                                //0x7
            ULONG IdLowPart;                                                //0x8
            ULONG IdHighPart;                                               //0xc
        } Connection;                                                       //0x4
    } u;                                                                    //0x4
}NOK_CM_PARTIAL_RESOURCE_DESCRIPTOR, * NOK_PCM_PARTIAL_RESOURCE_DESCRIPTOR;
//0x8 bytes (sizeof)
typedef struct _NOK_CM_INDEX
{
    ULONG Cell;                                                             //0x0
    union
    {
        NOK_CM_FAST_LEAF_HINT NameHint;                                 //0x4
        NOK_CM_COMPONENT_HASH HashKey;                                  //0x4
    };
}NOK_CM_INDEX, * NOK_PCM_INDEX;
//0x8 bytes (sizeof)
typedef struct _NOK_CM_INDEX_HINT_BLOCK
{
    ULONG Count;                                                            //0x0
    ULONG HashKey[1];                                                       //0x4
}NOK_CM_INDEX_HINT_BLOCK, * NOK_PCM_INDEX_HINT_BLOCK;
//0x10 bytes (sizeof)
typedef struct _NOK_CM_INTENT_LOCK
{
    ULONG OwnerCount;                                                       //0x0
    NOK_PCM_KCB_UOW* OwnerTable;                                        //0x8
}NOK_CM_INTENT_LOCK, * NOK_PCM_INTENT_LOCK;
//0x18 bytes (sizeof)
typedef struct _NOK_CMP_VOLUME_MANAGER
{
    NOK_CMSI_RW_LOCK VolumeContextListLock;                             //0x0
    NOK_LIST_ENTRY VolumeContextListHead;                               //0x8
}NOK_CMP_VOLUME_MANAGER, * NOK_PCMP_VOLUME_MANAGER;
//0x28 bytes (sizeof)
typedef struct _NOK_SECURITY_DESCRIPTOR
{
    UCHAR Revision;                                                         //0x0
    UCHAR Sbz1;                                                             //0x1
    USHORT Control;                                                         //0x2
    VOID* Owner;                                                            //0x8
    VOID* Group;                                                            //0x10
    NOK_PACL Sacl;                                                      //0x18
    NOK_PACL Dacl;                                                      //0x20
}NOK_SECURITY_DESCRIPTOR, * NOK_PSECURITY_DESCRIPTOR;
//0x30 bytes (sizeof)
typedef struct _NOK_CM_KCB_LAYER_INFO
{
    NOK_LIST_ENTRY LayerListEntry;                                      //0x0
    NOK_PCM_KEY_CONTROL_BLOCK Kcb;                                      //0x10
    NOK_PCM_KCB_LAYER_INFO LowerLayer;                                  //0x18
    NOK_LIST_ENTRY UpperLayerListHead;                                  //0x20
}NOK_CM_KCB_LAYER_INFO, * NOK_PCM_KCB_LAYER_INFO;
//0x48 bytes (sizeof)
typedef struct _NOK_CMP_VOLUME_CONTEXT
{
    NOK_LIST_ENTRY VolumeContextListEntry;                              //0x0
    NOK_PCMP_VOLUME_MANAGER VolumeManager;                              //0x10
    LONGLONG RefCount;                                                      //0x18
    NOK_GUID VolumeGuid;                                                //0x20
    VOID* VolumeFileObject;                                                 //0x30
    NOK_CMSI_RW_LOCK VolumeContextLock;                                 //0x38
    UCHAR DeviceUsageNotificationSent;                                      //0x40
}NOK_CMP_VOLUME_CONTEXT, * NOK_PCMP_VOLUME_CONTEXT;
//0x8 bytes (sizeof)
typedef struct _NOK_BLOB_COUNTERS
{
    ULONG CreatedObjects;                                                   //0x0
    ULONG DeletedObjects;                                                   //0x4
}NOK_BLOB_COUNTERS, * NOK_PBLOB_COUNTERS;
//0x14 bytes (sizeof)
typedef struct _NOK_SECURITY_DESCRIPTOR_RELATIVE
{
    UCHAR Revision;                                                         //0x0
    UCHAR Sbz1;                                                             //0x1
    USHORT Control;                                                         //0x2
    ULONG Owner;                                                            //0x4
    ULONG Group;                                                            //0x8
    ULONG Sacl;                                                             //0xc
    ULONG Dacl;                                                             //0x10
}NOK_SECURITY_DESCRIPTOR_RELATIVE, * NOK_PSECURITY_DESCRIPTOR_RELATIVE;
//0x18 bytes (sizeof)
typedef struct _NOK_CM_KEY_VALUE
{
    USHORT Signature;                                                       //0x0
    USHORT NameLength;                                                      //0x2
    ULONG DataLength;                                                       //0x4
    ULONG Data;                                                             //0x8
    ULONG Type;                                                             //0xc
    USHORT Flags;                                                           //0x10
    USHORT Spare;                                                           //0x12
    WCHAR Name[1];                                                          //0x14
}NOK_CM_KEY_VALUE, * NOK_PCM_KEY_VALUE;
//0x10 bytes (sizeof)
typedef struct _NOK_CM_KEY_REFERENCE
{
    ULONG KeyCell;                                                          //0x0
    NOK_PHHIVE KeyHive;                                                 //0x8
}NOK_CM_KEY_REFERENCE, * NOK_PCM_KEY_REFERENCE;
//0x20 bytes (sizeof)
typedef struct _NOK_DEBUG_MEMORY_REQUIREMENTS
{
    NOK_LARGE_INTEGER Start;                                             //0x0
    NOK_LARGE_INTEGER MaxEnd;                                            //0x8
    VOID* VirtualAddress;                                                   //0x10
    ULONG Length;                                                           //0x18
    UCHAR Cached;                                                           //0x1c
    UCHAR Aligned;                                                          //0x1d
}NOK_DEBUG_MEMORY_REQUIREMENTS, * NOK_PDEBUG_MEMORY_REQUIREMENTS;
//0x20 bytes (sizeof)
typedef struct _NOK_CM_KEY_HASH
{
    NOK_CM_PATH_HASH ConvKey;                                           //0x0
    NOK_PCM_KEY_HASH NextHash;                                          //0x8
    NOK_PHHIVE KeyHive;                                                 //0x10
    ULONG KeyCell;                                                          //0x18
}NOK_CM_KEY_HASH, * NOK_PCM_KEY_HASH;
//0x28 bytes (sizeof)
typedef struct _NOK_CM_KEY_SECURITY
{
    USHORT Signature;                                                       //0x0
    USHORT Reserved;                                                        //0x2
    ULONG Flink;                                                            //0x4
    ULONG Blink;                                                            //0x8
    ULONG ReferenceCount;                                                   //0xc
    ULONG DescriptorLength;                                                 //0x10
    NOK_SECURITY_DESCRIPTOR_RELATIVE Descriptor;                        //0x14
}NOK_CM_KEY_SECURITY, * NOK_PCM_KEY_SECURITY;
//0x4 bytes (sizeof)
typedef enum _NOK_HSTORAGE_TYPE
{
    NOK_Stable = 0,
    NOK_Volatile = 1,
    NOK_InvalidStorage = 2
}NOK_HSTORAGE_TYPE, * NOK_PHSTORAGE_TYPE;
//0x50 bytes (sizeof)
typedef struct _NOK_CM_KEY_NODE
{
    USHORT Signature;                                                       //0x0
    USHORT Flags;                                                           //0x2
    NOK_LARGE_INTEGER LastWriteTime;                                     //0x4
    UCHAR AccessBits;                                                       //0xc
    UCHAR LayerSemantics:2;                                                 //0xd
    UCHAR Spare1:5;                                                         //0xd
    UCHAR InheritClass:1;                                                   //0xd
    USHORT Spare2;                                                          //0xe
    ULONG Parent;                                                           //0x10
    ULONG SubKeyCounts[2];                                                  //0x14
    union
    {
        struct
        {
            ULONG SubKeyLists[2];                                           //0x1c
            NOK_CHILD_LIST ValueList;                                   //0x24
        };
        NOK_CM_KEY_REFERENCE ChildHiveReference;                        //0x1c
    };
    ULONG Security;                                                         //0x2c
    ULONG Class;                                                            //0x30
    ULONG MaxNameLen:16;                                                    //0x34
    ULONG UserFlags:4;                                                      //0x34
    ULONG VirtControlFlags:4;                                               //0x34
    ULONG Debug:8;                                                          //0x34
    ULONG MaxClassLen;                                                      //0x38
    ULONG MaxValueNameLen;                                                  //0x3c
    ULONG MaxValueDataLen;                                                  //0x40
    ULONG WorkVar;                                                          //0x44
    USHORT NameLength;                                                      //0x48
    USHORT ClassLength;                                                     //0x4a
    WCHAR Name[1];                                                          //0x4c
}NOK_CM_KEY_NODE, * NOK_PCM_KEY_NODE;
//0x18 bytes (sizeof)
typedef struct _NOK_CM_NAME_HASH
{
    NOK_CM_COMPONENT_HASH ConvKey;                                      //0x0
    NOK_PCM_NAME_HASH NextHash;                                         //0x8
    USHORT NameLength;                                                      //0x10
    WCHAR Name[1];                                                          //0x12
}NOK_CM_NAME_HASH, * NOK_PCM_NAME_HASH;
//0x20 bytes (sizeof)
typedef struct _NOK_CM_NAME_CONTROL_BLOCK
{
    ULONG Compressed:1;                                                     //0x0
    ULONG RefCount:31;                                                      //0x0
    union
    {
        NOK_CM_NAME_HASH NameHash;                                      //0x8
        struct
        {
            NOK_CM_COMPONENT_HASH ConvKey;                              //0x8
            NOK_PCM_KEY_HASH NextHash;                                  //0x10
            USHORT NameLength;                                              //0x18
            WCHAR Name[1];                                                  //0x1a
        };
    };
}NOK_CM_NAME_CONTROL_BLOCK, * NOK_PCM_NAME_CONTROL_BLOCK;
//0x28 bytes (sizeof)
typedef struct _NOK_CM_WORKITEM
{
    NOK_LIST_ENTRY ListEntry;                                           //0x0
    ULONG Private;                                                          //0x10
    VOID (*WorkerRoutine)(VOID* arg1);                                      //0x18
    VOID* Parameter;                                                        //0x20
}NOK_CM_WORKITEM, * NOK_PCM_WORKITEM;
//0x50 bytes (sizeof)
typedef struct _NOK_CM_PARSE_DEBUG_INFO
{
    NOK_PCM_KEY_CONTROL_BLOCK SymlinkCachedKcb;                         //0x0
    NOK_PCM_KEY_CONTROL_BLOCK StartingKcb;                              //0x8
    NOK_PCM_KEY_CONTROL_BLOCK KcbCacheResult;                           //0x10
    NOK_PCM_KEY_CONTROL_BLOCK WalkResult;                               //0x18
    NOK_PCM_KEY_CONTROL_BLOCK DeepestKcbFound;                          //0x20
    UCHAR KcbCacheLevels;                                                   //0x28
    UCHAR WalkLevels;                                                       //0x29
    UCHAR FailureCount;                                                     //0x2a
    struct
    {
        LONG Status;                                                        //0x2c
        ULONG Point;                                                        //0x30
    } FailurePoints[4];                                                     //0x2c
}NOK_CM_PARSE_DEBUG_INFO, * NOK_PCM_PARSE_DEBUG_INFO;
//0x1f8 bytes (sizeof)
typedef struct _NOK_PO_HIBER_PERF
{
    ULONGLONG HiberIoTicks;                                                 //0x0
    ULONGLONG HiberIoCpuTicks;                                              //0x8
    ULONGLONG HiberInitTicks;                                               //0x10
    ULONGLONG HiberHiberFileTicks;                                          //0x18
    ULONGLONG HiberCompressTicks;                                           //0x20
    ULONGLONG HiberSharedBufferTicks;                                       //0x28
    ULONGLONG HiberChecksumTicks;                                           //0x30
    ULONGLONG HiberChecksumIoTicks;                                         //0x38
    NOK_LARGE_INTEGER TotalHibernateTime;                                //0x40
    NOK_LARGE_INTEGER HibernateCompleteTimestamp;                        //0x48
    ULONG POSTTime;                                                         //0x50
    ULONG ResumeBootMgrTime;                                                //0x54
    ULONG BootmgrUserInputTime;                                             //0x58
    ULONGLONG ResumeAppTicks;                                               //0x60
    ULONGLONG ResumeAppStartTimestamp;                                      //0x68
    ULONGLONG ResumeLibraryInitTicks;                                       //0x70
    ULONGLONG ResumeInitTicks;                                              //0x78
    ULONGLONG ResumeRestoreImageStartTimestamp;                             //0x80
    ULONGLONG ResumeHiberFileTicks;                                         //0x88
    ULONGLONG ResumeIoTicks;                                                //0x90
    ULONGLONG ResumeDecompressTicks;                                        //0x98
    ULONGLONG ResumeAllocateTicks;                                          //0xa0
    ULONGLONG ResumeUserInOutTicks;                                         //0xa8
    ULONGLONG ResumeMapTicks;                                               //0xb0
    ULONGLONG ResumeUnmapTicks;                                             //0xb8
    ULONGLONG ResumeChecksumTicks;                                          //0xc0
    ULONGLONG ResumeChecksumIoTicks;                                        //0xc8
    ULONGLONG ResumeKernelSwitchTimestamp;                                  //0xd0
    ULONGLONG CyclesPerMs;                                                  //0xd8
    ULONGLONG WriteLogDataTimestamp;                                        //0xe0
    ULONGLONG KernelReturnFromHandler;                                      //0xe8
    ULONGLONG TimeStampCounterAtSwitchTime;                                 //0xf0
    ULONGLONG HalTscOffset;                                                 //0xf8
    ULONGLONG HvlTscOffset;                                                 //0x100
    ULONGLONG SleeperThreadEnd;                                             //0x108
    ULONGLONG PostCmosUpdateTimestamp;                                      //0x110
    ULONGLONG KernelReturnSystemPowerStateTimestamp;                        //0x118
    ULONGLONG IoBoundedness;                                                //0x120
    ULONGLONG KernelDecompressTicks;                                        //0x128
    ULONGLONG KernelIoTicks;                                                //0x130
    ULONGLONG KernelCopyTicks;                                              //0x138
    ULONGLONG ReadCheckCount;                                               //0x140
    ULONGLONG KernelInitTicks;                                              //0x148
    ULONGLONG KernelResumeHiberFileTicks;                                   //0x150
    ULONGLONG KernelIoCpuTicks;                                             //0x158
    ULONGLONG KernelSharedBufferTicks;                                      //0x160
    ULONGLONG KernelAnimationTicks;                                         //0x168
    ULONGLONG KernelChecksumTicks;                                          //0x170
    ULONGLONG KernelChecksumIoTicks;                                        //0x178
    NOK_LARGE_INTEGER AnimationStart;                                    //0x180
    NOK_LARGE_INTEGER AnimationStop;                                     //0x188
    ULONG DeviceResumeTime;                                                 //0x190
    ULONGLONG SecurePagesProcessed;                                         //0x198
    ULONGLONG BootPagesProcessed;                                           //0x1a0
    ULONGLONG KernelPagesProcessed;                                         //0x1a8
    ULONGLONG BootBytesWritten;                                             //0x1b0
    ULONGLONG KernelBytesWritten;                                           //0x1b8
    ULONGLONG BootPagesWritten;                                             //0x1c0
    ULONGLONG KernelPagesWritten;                                           //0x1c8
    ULONGLONG BytesWritten;                                                 //0x1d0
    ULONG PagesWritten;                                                     //0x1d8
    ULONG FileRuns;                                                         //0x1dc
    ULONG NoMultiStageResumeReason;                                         //0x1e0
    ULONG MaxHuffRatio;                                                     //0x1e4
    ULONGLONG AdjustedTotalResumeTime;                                      //0x1e8
    ULONGLONG ResumeCompleteTimestamp;                                      //0x1f0
}NOK_PO_HIBER_PERF, * NOK_PPO_HIBER_PERF;
//0x28 bytes (sizeof)
typedef struct _NOK_SUPPORTED_RANGE
{
    NOK_PSUPPORTED_RANGE Next;                                          //0x0
    ULONG SystemAddressSpace;                                               //0x8
    LONGLONG SystemBase;                                                    //0x10
    LONGLONG Base;                                                          //0x18
    LONGLONG Limit;                                                         //0x20
}NOK_SUPPORTED_RANGE, * NOK_PSUPPORTED_RANGE;
//0x18 bytes (sizeof)
typedef struct _NOK_CM_KEY_HASH_TABLE_ENTRY
{
    NOK_EX_PUSH_LOCK Lock;                                              //0x0
    NOK_PKTHREAD Owner;                                                 //0x8
    NOK_PCM_KEY_HASH Entry;                                             //0x10
}NOK_CM_KEY_HASH_TABLE_ENTRY, * NOK_PCM_KEY_HASH_TABLE_ENTRY;
//0x1c bytes (sizeof)
typedef struct _NOK_CM_PARTIAL_RESOURCE_LIST
{
    USHORT Version;                                                         //0x0
    USHORT Revision;                                                        //0x2
    ULONG Count;                                                            //0x4
    NOK_CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];           //0x8
}NOK_CM_PARTIAL_RESOURCE_LIST, * NOK_PCM_PARTIAL_RESOURCE_LIST;
//0x18 bytes (sizeof)
typedef struct _NOK_SEP_TOKEN_PRIVILEGES
{
    ULONGLONG Present;                                                      //0x0
    ULONGLONG Enabled;                                                      //0x8
    ULONGLONG EnabledByDefault;                                             //0x10
}NOK_SEP_TOKEN_PRIVILEGES, * NOK_PSEP_TOKEN_PRIVILEGES;
//0x88 bytes (sizeof)
typedef struct _NOK_CM_RM
{
    NOK_LIST_ENTRY RmListEntry;                                         //0x0
    NOK_LIST_ENTRY TransactionListHead;                                 //0x10
    VOID* TmHandle;                                                         //0x20
    VOID* Tm;                                                               //0x28
    VOID* RmHandle;                                                         //0x30
    VOID* KtmRm;                                                            //0x38
    ULONG RefCount;                                                         //0x40
    ULONG ContainerNum;                                                     //0x44
    ULONGLONG ContainerSize;                                                //0x48
    NOK_PCMHIVE CmHive;                                                 //0x50
    VOID* LogFileObject;                                                    //0x58
    VOID* MarshallingContext;                                               //0x60
    ULONG RmFlags;                                                          //0x68
    LONG LogStartStatus1;                                                   //0x6c
    LONG LogStartStatus2;                                                   //0x70
    ULONGLONG BaseLsn;                                                      //0x78
    NOK_PERESOURCE RmLock;                                              //0x80
}NOK_CM_RM, * NOK_PCM_RM;
//0x14 bytes (sizeof)
typedef struct _NOK_CM_UOW_KEY_STATE_MODIFICATION
{
    ULONG RefCount;                                                         //0x0
    ULONG SubKeyListCount[2];                                               //0x4
    ULONG NewSubKeyList[2];                                                 //0xc
}NOK_CM_UOW_KEY_STATE_MODIFICATION, * NOK_PCM_UOW_KEY_STATE_MODIFICATION;
//0x4 bytes (sizeof)
typedef struct _NOK_CM_UOW_SET_SD_DATA
{
    ULONG SecurityCell;                                                     //0x0
}NOK_CM_UOW_SET_SD_DATA, * NOK_PCM_UOW_SET_SD_DATA;
//0x10 bytes (sizeof)
typedef struct _NOK_CM_UOW_SET_VALUE_KEY_DATA
{
    ULONG PreparedCell;                                                     //0x0
    ULONG OldValueCell;                                                     //0x4
    USHORT NameLength;                                                      //0x8
    ULONG DataSize;                                                         //0xc
}NOK_CM_UOW_SET_VALUE_KEY_DATA, * NOK_PCM_UOW_SET_VALUE_KEY_DATA;
//0xc bytes (sizeof)
typedef struct _NOK_CM_UOW_SET_VALUE_LIST_DATA
{
    ULONG RefCount;                                                         //0x0
    NOK_CHILD_LIST ValueList;                                           //0x4
}NOK_CM_UOW_SET_VALUE_LIST_DATA, * NOK_PCM_UOW_SET_VALUE_LIST_DATA;
//0x8 bytes (sizeof)
typedef union _NOK_CM_TRANS_PTR
{
    ULONGLONG LightWeight:1;                                                //0x0
    VOID* TransPtr;                                                         //0x0
}NOK_CM_TRANS_PTR, * NOK_PCM_TRANS_PTR;
//0xb8 bytes (sizeof)
typedef struct _NOK_CM_TRANS
{
    NOK_LIST_ENTRY TransactionListEntry;                                //0x0
    NOK_LIST_ENTRY KCBUoWListHead;                                      //0x10
    NOK_LIST_ENTRY LazyCommitListEntry;                                 //0x20
    union
    {
        struct
        {
            ULONG Prepared:1;                                               //0x30
            ULONG Aborted:1;                                                //0x30
            ULONG Committed:1;                                              //0x30
            ULONG Initializing:1;                                           //0x30
            ULONG Invalid:1;                                                //0x30
            ULONG UseReservation:1;                                         //0x30
            ULONG TmCallbacksActive:1;                                      //0x30
            ULONG LightWeight:1;                                            //0x30
            ULONG Freed1:1;                                                 //0x30
            ULONG Freed2:1;                                                 //0x30
            ULONG Spare1:2;                                                 //0x30
            ULONG Freed:1;                                                  //0x30
            ULONG Spare:19;                                                 //0x30
        };
        ULONG TransState;                                                   //0x30
    };
    NOK_CM_TRANS_PTR Trans;                                              //0x38
    NOK_PCM_RM CmRm;                                                    //0x40
    NOK_PKENLISTMENT KtmEnlistmentObject;                               //0x48
    VOID* KtmEnlistmentHandle;                                              //0x50
    NOK_GUID KtmUow;                                                    //0x58
    ULONGLONG StartLsn;                                                     //0x68
    ULONG HiveCount;                                                        //0x70
    NOK_PCMHIVE HiveArray[8];                                           //0x78
}NOK_CM_TRANS, * NOK_PCM_TRANS;
//0xc bytes (sizeof)
typedef struct _NOK_COMPRESSED_DATA_INFO
{
    USHORT CompressionFormatAndEngine;                                      //0x0
    UCHAR CompressionUnitShift;                                             //0x2
    UCHAR ChunkShift;                                                       //0x3
    UCHAR ClusterShift;                                                     //0x4
    UCHAR Reserved;                                                         //0x5
    USHORT NumberOfChunks;                                                  //0x6
    ULONG CompressedChunkSizes[1];                                          //0x8
}NOK_COMPRESSED_DATA_INFO, * NOK_PCOMPRESSED_DATA_INFO;
//0x4 bytes (sizeof)
typedef struct _NOK_DEVICE_FLAGS
{
    ULONG Failed:1;                                                         //0x0
    ULONG ReadOnly:1;                                                       //0x0
    ULONG Removable:1;                                                      //0x0
    ULONG ConsoleIn:1;                                                      //0x0
    ULONG ConsoleOut:1;                                                     //0x0
    ULONG Input:1;                                                          //0x0
    ULONG Output:1;                                                         //0x0
}NOK_DEVICE_FLAGS, * NOK_PDEVICE_FLAGS;
//0x4 bytes (sizeof)
typedef enum _NOK_CONFIGURATION_CLASS
{
    NOK_SystemClass = 0,
    NOK_ProcessorClass = 1,
    NOK_CacheClass = 2,
    NOK_AdapterClass = 3,
    NOK_ControllerClass = 4,
    NOK_PeripheralClass = 5,
    NOK_MemoryClass = 6,
    NOK_MaximumClass = 7
}NOK_CONFIGURATION_CLASS, * NOK_PCONFIGURATION_CLASS;
//0x10 bytes (sizeof)
typedef struct _NOK_M128A
{
    ULONGLONG Low;                                                          //0x0
    LONGLONG High;                                                          //0x8
}NOK_M128A, * NOK_PM128A;
//0x38 bytes (sizeof)
typedef struct _NOK_CM_KEY_SECURITY_CACHE
{
    ULONG Cell;                                                             //0x0
    ULONG ConvKey;                                                          //0x4
    NOK_LIST_ENTRY List;                                                //0x8
    ULONG DescriptorLength;                                                 //0x18
    ULONG RealRefCount;                                                     //0x1c
    NOK_SECURITY_DESCRIPTOR_RELATIVE Descriptor;                        //0x20
}NOK_CM_KEY_SECURITY_CACHE, * NOK_PCM_KEY_SECURITY_CACHE;
//0x8 bytes (sizeof)
typedef struct _NOK_EX_FAST_REF
{
    union
    {
        VOID* Object;                                                       //0x0
        ULONGLONG RefCnt:4;                                                 //0x0
        ULONGLONG Value;                                                    //0x0
    };
}NOK_EX_FAST_REF, * NOK_PEX_FAST_REF;
//0x4 bytes (sizeof)
typedef enum _NOK_HARDWARE_COUNTER_TYPE
{
    NOK_PMCCounter = 0,
    NOK_MaxHardwareCounterType = 1
}NOK_HARDWARE_COUNTER_TYPE, * NOK_PHARDWARE_COUNTER_TYPE;
//0x28 bytes (sizeof)
typedef struct _NOK_KDEVICE_QUEUE
{
    SHORT Type;                                                             //0x0
    SHORT Size;                                                             //0x2
    NOK_LIST_ENTRY DeviceListHead;                                      //0x8
    ULONGLONG Lock;                                                         //0x18
    union
    {
        UCHAR Busy;                                                         //0x20
        struct
        {
            LONGLONG Reserved:8;                                            //0x20
            LONGLONG Hint:56;                                               //0x20
        };
    };
}NOK_KDEVICE_QUEUE, * NOK_PKDEVICE_QUEUE;
//0x10 bytes (sizeof)
typedef struct _NOK_UNICODE_STRING
{
    USHORT Length;                                                          //0x0
    USHORT MaximumLength;                                                   //0x2
    WCHAR* Buffer;                                                          //0x8
}NOK_UNICODE_STRING, * NOK_PUNICODE_STRING;
//0x10 bytes (sizeof)
typedef struct _NOK_CUSTOM_SYSTEM_EVENT_TRIGGER_CONFIG
{
    ULONG Size;                                                             //0x0
    WCHAR* TriggerId;                                                       //0x8
}NOK_CUSTOM_SYSTEM_EVENT_TRIGGER_CONFIG, * NOK_PCUSTOM_SYSTEM_EVENT_TRIGGER_CONFIG;
//0x14 bytes (sizeof)
typedef struct _NOK_IA64_DBGKD_CONTROL_SET
{
    ULONG Continue;                                                         //0x0
    ULONGLONG CurrentSymbolStart;                                           //0x4
    ULONGLONG CurrentSymbolEnd;                                             //0xc
}NOK_IA64_DBGKD_CONTROL_SET, * NOK_PIA64_DBGKD_CONTROL_SET;
//0x8 bytes (sizeof)
typedef struct _NOK_DBGKD_BREAKPOINTEX
{
    ULONG BreakPointCount;                                                  //0x0
    LONG ContinueStatus;                                                    //0x4
}NOK_DBGKD_BREAKPOINTEX, * NOK_PDBGKD_BREAKPOINTEX;
//0xc bytes (sizeof)
typedef struct _NOK_DBGKD_CONTEXT_EX
{
    ULONG Offset;                                                           //0x0
    ULONG ByteCount;                                                        //0x4
    ULONG BytesCopied;                                                      //0x8
}NOK_DBGKD_CONTEXT_EX, * NOK_PDBGKD_CONTEXT_EX;
//0x4 bytes (sizeof)
typedef struct _NOK_DBGKD_CONTINUE
{
    LONG ContinueStatus;                                                    //0x0
}NOK_DBGKD_CONTINUE, * NOK_PDBGKD_CONTINUE;
//0xc bytes (sizeof)
typedef struct _NOK_PPC_DBGKD_CONTROL_SET
{
    ULONG Continue;                                                         //0x0
    ULONG CurrentSymbolStart;                                               //0x4
    ULONG CurrentSymbolEnd;                                                 //0x8
}NOK_PPC_DBGKD_CONTROL_SET, * NOK_PPPC_DBGKD_CONTROL_SET;
//0x10 bytes (sizeof)
typedef struct _NOK_DBGKD_FILL_MEMORY
{
    ULONGLONG Address;                                                      //0x0
    ULONG Length;                                                           //0x8
    USHORT Flags;                                                           //0xc
    USHORT PatternLength;                                                   //0xe
}NOK_DBGKD_FILL_MEMORY, * NOK_PDBGKD_FILL_MEMORY;
//0x4 bytes (sizeof)
typedef struct _NOK_DBGKD_GET_CONTEXT
{
    ULONG Unused;                                                           //0x0
}NOK_DBGKD_GET_CONTEXT, * NOK_PDBGKD_GET_CONTEXT;
//0x1c bytes (sizeof)
typedef struct _NOK_DBGKD_GET_INTERNAL_BREAKPOINT32
{
    ULONG BreakpointAddress;                                                //0x0
    ULONG Flags;                                                            //0x4
    ULONG Calls;                                                            //0x8
    ULONG MaxCallsPerPeriod;                                                //0xc
    ULONG MinInstructions;                                                  //0x10
    ULONG MaxInstructions;                                                  //0x14
    ULONG TotalInstructions;                                                //0x18
}NOK_DBGKD_GET_INTERNAL_BREAKPOINT32, * NOK_PDBGKD_GET_INTERNAL_BREAKPOINT32;
//0x20 bytes (sizeof)
typedef struct _NOK_DBGKD_GET_INTERNAL_BREAKPOINT64
{
    ULONGLONG BreakpointAddress;                                            //0x0
    ULONG Flags;                                                            //0x8
    ULONG Calls;                                                            //0xc
    ULONG MaxCallsPerPeriod;                                                //0x10
    ULONG MinInstructions;                                                  //0x14
    ULONG MaxInstructions;                                                  //0x18
    ULONG TotalInstructions;                                                //0x1c
}NOK_DBGKD_GET_INTERNAL_BREAKPOINT64, * NOK_PDBGKD_GET_INTERNAL_BREAKPOINT64;
//0x14 bytes (sizeof)
typedef struct _NOK_DBGKD_GET_SET_BUS_DATA
{
    ULONG BusDataType;                                                      //0x0
    ULONG BusNumber;                                                        //0x4
    ULONG SlotNumber;                                                       //0x8
    ULONG Offset;                                                           //0xc
    ULONG Length;                                                           //0x10
}NOK_DBGKD_GET_SET_BUS_DATA, * NOK_PDBGKD_GET_SET_BUS_DATA;
//0x28 bytes (sizeof)
typedef struct _NOK_DBGKD_GET_VERSION32
{
    USHORT MajorVersion;                                                    //0x0
    USHORT MinorVersion;                                                    //0x2
    USHORT ProtocolVersion;                                                 //0x4
    USHORT Flags;                                                           //0x6
    ULONG KernBase;                                                         //0x8
    ULONG PsLoadedModuleList;                                               //0xc
    USHORT MachineType;                                                     //0x10
    USHORT ThCallbackStack;                                                 //0x12
    USHORT NextCallback;                                                    //0x14
    USHORT FramePointer;                                                    //0x16
    ULONG KiCallUserMode;                                                   //0x18
    ULONG KeUserCallbackDispatcher;                                         //0x1c
    ULONG BreakpointWithStatus;                                             //0x20
    ULONG DebuggerDataList;                                                 //0x24
}NOK_DBGKD_GET_VERSION32, * NOK_PDBGKD_GET_VERSION32;
//0x28 bytes (sizeof)
typedef struct _NOK_DBGKD_GET_VERSION64
{
    USHORT MajorVersion;                                                    //0x0
    USHORT MinorVersion;                                                    //0x2
    UCHAR ProtocolVersion;                                                  //0x4
    UCHAR KdSecondaryVersion;                                               //0x5
    USHORT Flags;                                                           //0x6
    USHORT MachineType;                                                     //0x8
    UCHAR MaxPacketType;                                                    //0xa
    UCHAR MaxStateChange;                                                   //0xb
    UCHAR MaxManipulate;                                                    //0xc
    UCHAR Simulation;                                                       //0xd
    USHORT Unused[1];                                                       //0xe
    ULONGLONG KernBase;                                                     //0x10
    ULONGLONG PsLoadedModuleList;                                           //0x18
    ULONGLONG DebuggerDataList;                                             //0x20
}NOK_DBGKD_GET_VERSION64, * NOK_PDBGKD_GET_VERSION64;
//0x18 bytes (sizeof)
typedef struct _NOK_DBGKD_LOAD_SYMBOLS32
{
    ULONG PathNameLength;                                                   //0x0
    ULONG BaseOfDll;                                                        //0x4
    ULONG ProcessId;                                                        //0x8
    ULONG CheckSum;                                                         //0xc
    ULONG SizeOfImage;                                                      //0x10
    UCHAR UnloadSymbols;                                                    //0x14
}NOK_DBGKD_LOAD_SYMBOLS32, * NOK_PDBGKD_LOAD_SYMBOLS32;
//0x28 bytes (sizeof)
typedef struct _NOK_DBGKD_LOAD_SYMBOLS64
{
    ULONG PathNameLength;                                                   //0x0
    ULONGLONG BaseOfDll;                                                    //0x8
    ULONGLONG ProcessId;                                                    //0x10
    ULONG CheckSum;                                                         //0x18
    ULONG SizeOfImage;                                                      //0x1c
    UCHAR UnloadSymbols;                                                    //0x20
}NOK_DBGKD_LOAD_SYMBOLS64, * NOK_PDBGKD_LOAD_SYMBOLS64;
//0x4 bytes (sizeof)
typedef struct _NOK_DBGKD_QUERY_SPECIAL_CALLS
{
    ULONG NumberOfSpecialCalls;                                             //0x0
}NOK_DBGKD_QUERY_SPECIAL_CALLS, * NOK_PDBGKD_QUERY_SPECIAL_CALLS;
//0x18 bytes (sizeof)
typedef struct _NOK_DBGKD_QUERY_MEMORY
{
    ULONGLONG Address;                                                      //0x0
    ULONGLONG Reserved;                                                     //0x8
    ULONG AddressSpace;                                                     //0x10
    ULONG Flags;                                                            //0x14
}NOK_DBGKD_QUERY_MEMORY, * NOK_PDBGKD_QUERY_MEMORY;
//0xc bytes (sizeof)
typedef struct _NOK_DBGKD_READ_MEMORY32
{
    ULONG TargetBaseAddress;                                                //0x0
    ULONG TransferCount;                                                    //0x4
    ULONG ActualBytesRead;                                                  //0x8
}NOK_DBGKD_READ_MEMORY32, * NOK_PDBGKD_READ_MEMORY32;
//0x10 bytes (sizeof)
typedef struct _NOK_DBGKD_READ_MEMORY64
{
    ULONGLONG TargetBaseAddress;                                            //0x0
    ULONG TransferCount;                                                    //0x8
    ULONG ActualBytesRead;                                                  //0xc
}NOK_DBGKD_READ_MEMORY64, * NOK_PDBGKD_READ_MEMORY64;
//0x10 bytes (sizeof)
typedef struct _NOK_DBGKD_READ_WRITE_IO64
{
    ULONGLONG IoAddress;                                                    //0x0
    ULONG DataSize;                                                         //0x8
    ULONG DataValue;                                                        //0xc
}NOK_DBGKD_READ_WRITE_IO64, * NOK_PDBGKD_READ_WRITE_IO64;
//0xc bytes (sizeof)
typedef struct _NOK_DBGKD_READ_WRITE_IO32
{
    ULONG DataSize;                                                         //0x0
    ULONG IoAddress;                                                        //0x4
    ULONG DataValue;                                                        //0x8
}NOK_DBGKD_READ_WRITE_IO32, * NOK_PDBGKD_READ_WRITE_IO32;
//0x18 bytes (sizeof)
typedef struct _NOK_DBGKD_READ_WRITE_IO_EXTENDED32
{
    ULONG DataSize;                                                         //0x0
    ULONG InterfaceType;                                                    //0x4
    ULONG BusNumber;                                                        //0x8
    ULONG AddressSpace;                                                     //0xc
    ULONG IoAddress;                                                        //0x10
    ULONG DataValue;                                                        //0x14
}NOK_DBGKD_READ_WRITE_IO_EXTENDED32, * NOK_PDBGKD_READ_WRITE_IO_EXTENDED32;
//0x20 bytes (sizeof)
typedef struct _NOK_DBGKD_READ_WRITE_IO_EXTENDED64
{
    ULONG DataSize;                                                         //0x0
    ULONG InterfaceType;                                                    //0x4
    ULONG BusNumber;                                                        //0x8
    ULONG AddressSpace;                                                     //0xc
    ULONGLONG IoAddress;                                                    //0x10
    ULONG DataValue;                                                        //0x18
}NOK_DBGKD_READ_WRITE_IO_EXTENDED64, * NOK_PDBGKD_READ_WRITE_IO_EXTENDED64;
//0xc bytes (sizeof)
typedef struct _NOK_DBGKD_READ_WRITE_MSR
{
    ULONG Msr;                                                              //0x0
    ULONG DataValueLow;                                                     //0x4
    ULONG DataValueHigh;                                                    //0x8
}NOK_DBGKD_READ_WRITE_MSR, * NOK_PDBGKD_READ_WRITE_MSR;
//0x4 bytes (sizeof)
typedef struct _NOK_DBGKD_RESTORE_BREAKPOINT
{
    ULONG BreakPointHandle;                                                 //0x0
}NOK_DBGKD_RESTORE_BREAKPOINT, * NOK_PDBGKD_RESTORE_BREAKPOINT;
//0x18 bytes (sizeof)
typedef struct _NOK_DBGKD_SEARCH_MEMORY
{
    union
    {
        ULONGLONG SearchAddress;                                            //0x0
        ULONGLONG FoundAddress;                                             //0x0
    };
    ULONGLONG SearchLength;                                                 //0x8
    ULONG PatternLength;                                                    //0x10
}NOK_DBGKD_SEARCH_MEMORY, * NOK_PDBGKD_SEARCH_MEMORY;
//0x4 bytes (sizeof)
typedef struct _NOK_DBGKD_SET_CONTEXT
{
    ULONG ContextFlags;                                                     //0x0
}NOK_DBGKD_SET_CONTEXT, * NOK_PDBGKD_SET_CONTEXT;
//0x8 bytes (sizeof)
typedef struct _NOK_DBGKD_SET_INTERNAL_BREAKPOINT32
{
    ULONG BreakpointAddress;                                                //0x0
    ULONG Flags;                                                            //0x4
}NOK_DBGKD_SET_INTERNAL_BREAKPOINT32, * NOK_PDBGKD_SET_INTERNAL_BREAKPOINT32;
//0x10 bytes (sizeof)
typedef struct _NOK_DBGKD_SET_INTERNAL_BREAKPOINT64
{
    ULONGLONG BreakpointAddress;                                            //0x0
    ULONG Flags;                                                            //0x8
}NOK_DBGKD_SET_INTERNAL_BREAKPOINT64, * NOK_PDBGKD_SET_INTERNAL_BREAKPOINT64;
//0x4 bytes (sizeof)
typedef struct _NOK_DBGKD_SET_SPECIAL_CALL32
{
    ULONG SpecialCall;                                                      //0x0
}NOK_DBGKD_SET_SPECIAL_CALL32, * NOK_PDBGKD_SET_SPECIAL_CALL32;
//0x8 bytes (sizeof)
typedef struct _NOK_DBGKD_SET_SPECIAL_CALL64
{
    ULONGLONG SpecialCall;                                                  //0x0
}NOK_DBGKD_SET_SPECIAL_CALL64, * NOK_PDBGKD_SET_SPECIAL_CALL64;
//0x8 bytes (sizeof)
typedef struct _NOK_DBGKD_WRITE_BREAKPOINT32
{
    ULONG BreakPointAddress;                                                //0x0
    ULONG BreakPointHandle;                                                 //0x4
}NOK_DBGKD_WRITE_BREAKPOINT32, * NOK_PDBGKD_WRITE_BREAKPOINT32;
//0x4 bytes (sizeof)
typedef struct _NOK_DBGKD_SWITCH_PARTITION
{
    ULONG Partition;                                                        //0x0
}NOK_DBGKD_SWITCH_PARTITION, * NOK_PDBGKD_SWITCH_PARTITION;
//0x10 bytes (sizeof)
typedef struct _NOK_DBGKD_WRITE_BREAKPOINT64
{
    ULONGLONG BreakPointAddress;                                            //0x0
    ULONG BreakPointHandle;                                                 //0x8
}NOK_DBGKD_WRITE_BREAKPOINT64, * NOK_PDBGKD_WRITE_BREAKPOINT64;
//0xc bytes (sizeof)
typedef struct _NOK_DBGKD_WRITE_MEMORY32
{
    ULONG TargetBaseAddress;                                                //0x0
    ULONG TransferCount;                                                    //0x4
    ULONG ActualBytesWritten;                                               //0x8
}NOK_DBGKD_WRITE_MEMORY32, * NOK_PDBGKD_WRITE_MEMORY32;
//0x18 bytes (sizeof)
typedef struct _NOK_DBGKD_WRITE_CUSTOM_BREAKPOINT
{
    ULONGLONG BreakPointAddress;                                            //0x0
    ULONGLONG BreakPointInstruction;                                        //0x8
    ULONG BreakPointHandle;                                                 //0x10
    UCHAR BreakPointInstructionSize;                                        //0x14
    UCHAR BreakPointInstructionAlignment;                                   //0x15
}NOK_DBGKD_WRITE_CUSTOM_BREAKPOINT, * NOK_PDBGKD_WRITE_CUSTOM_BREAKPOINT;
//0x10 bytes (sizeof)
typedef struct _NOK_DBGKD_WRITE_MEMORY64
{
    ULONGLONG TargetBaseAddress;                                            //0x0
    ULONG TransferCount;                                                    //0x8
    ULONG ActualBytesWritten;                                               //0xc
}NOK_DBGKD_WRITE_MEMORY64, * NOK_PDBGKD_WRITE_MEMORY64;
//0x10 bytes (sizeof)
typedef struct _NOK_X86_DBGKD_CONTROL_SET
{
    ULONG TraceFlag;                                                        //0x0
    ULONG Dr7;                                                              //0x4
    ULONG CurrentSymbolStart;                                               //0x8
    ULONG CurrentSymbolEnd;                                                 //0xc
}NOK_X86_DBGKD_CONTROL_SET, * NOK_PX86_DBGKD_CONTROL_SET;
//0x1c bytes (sizeof)
typedef struct _NOK_DBGKD_ANY_CONTROL_SET
{
    union
    {
        NOK_X86_DBGKD_CONTROL_SET X86ControlSet;                        //0x0
        ULONG AlphaControlSet;                                              //0x0
        NOK_IA64_DBGKD_CONTROL_SET IA64ControlSet;                      //0x0
        NOK_AMD64_DBGKD_CONTROL_SET Amd64ControlSet;                    //0x0
        NOK_ARM_DBGKD_CONTROL_SET ArmControlSet;                        //0x0
        NOK_ARM64_DBGKD_CONTROL_SET Arm64ControlSet;                    //0x0
        NOK_ARMCE_DBGKD_CONTROL_SET ArmCeControlSet;                    //0x0
        NOK_PPC_DBGKD_CONTROL_SET PpcControlSet;                        //0x0
    };
}NOK_DBGKD_ANY_CONTROL_SET, * NOK_PDBGKD_ANY_CONTROL_SET;
//0x98 bytes (sizeof)
typedef struct _NOK_EXCEPTION_RECORD
{
    LONG ExceptionCode;                                                     //0x0
    ULONG ExceptionFlags;                                                   //0x4
    NOK_PEXCEPTION_RECORD ExceptionRecord;                              //0x8
    VOID* ExceptionAddress;                                                 //0x10
    ULONG NumberParameters;                                                 //0x18
    ULONGLONG ExceptionInformation[15];                                     //0x20
}NOK_EXCEPTION_RECORD, * NOK_PEXCEPTION_RECORD;
//0x50 bytes (sizeof)
typedef struct _NOK_EXCEPTION_RECORD32
{
    LONG ExceptionCode;                                                     //0x0
    ULONG ExceptionFlags;                                                   //0x4
    ULONG ExceptionRecord;                                                  //0x8
    ULONG ExceptionAddress;                                                 //0xc
    ULONG NumberParameters;                                                 //0x10
    ULONG ExceptionInformation[15];                                         //0x14
}NOK_EXCEPTION_RECORD32, * NOK_PEXCEPTION_RECORD32;
//0x8 bytes (sizeof)
typedef struct _NOK_EX_RUNDOWN_REF
{
    union
    {
        ULONGLONG Count;                                                    //0x0
        VOID* Ptr;                                                          //0x0
    };
}NOK_EX_RUNDOWN_REF, * NOK_PEX_RUNDOWN_REF;
//0x8 bytes (sizeof)
typedef struct _NOK_DEBUG_TRANSPORT_DATA
{
    ULONG HwContextSize;                                                    //0x0
    UCHAR UseSerialFraming;                                                 //0x4
    UCHAR ValidUSBCoreId;                                                   //0x5
    UCHAR USBCoreId;                                                        //0x6
}NOK_DEBUG_TRANSPORT_DATA, * NOK_PDEBUG_TRANSPORT_DATA;
//0x4 bytes (sizeof)
typedef enum _NOK_KD_NAMESPACE_ENUM
{
    NOK_KdNameSpacePCI = 0,
    NOK_KdNameSpaceACPI = 1,
    NOK_KdNameSpaceAny = 2,
    NOK_KdNameSpaceNone = 3,
    NOK_KdNameSpaceMax = 4
}NOK_KD_NAMESPACE_ENUM, * NOK_PKD_NAMESPACE_ENUM;
//0x4 bytes (sizeof)
typedef enum _NOK_INTERFACE_TYPE
{
    NOK_InterfaceTypeUndefined = -1,
    NOK_Internal = 0,
    NOK_Isa = 1,
    NOK_Eisa = 2,
    NOK_MicroChannel = 3,
    NOK_TurboChannel = 4,
    NOK_PCIBus = 5,
    NOK_VMEBus = 6,
    NOK_NuBus = 7,
    NOK_PCMCIABus = 8,
    NOK_CBus = 9,
    NOK_MPIBus = 10,
    NOK_MPSABus = 11,
    NOK_ProcessorInternal = 12,
    NOK_InternalPowerBus = 13,
    NOK_PNPISABus = 14,
    NOK_PNPBus = 15,
    NOK_Vmcs = 16,
    NOK_ACPIBus = 17,
    NOK_MaximumInterfaceType = 18
}NOK_INTERFACE_TYPE, * NOK_PINTERFACE_TYPE;
//0x18 bytes (sizeof)
typedef struct _NOK_DELAY_ACK_FO
{
    NOK_LIST_ENTRY Links;                                               //0x0
    NOK_PFILE_OBJECT OriginalFileObject;                                //0x10
}NOK_DELAY_ACK_FO, * NOK_PDELAY_ACK_FO;
//0x4 bytes (sizeof)
typedef enum _NOK_DEVICE_POWER_STATE
{
    NOK_PowerDeviceUnspecified = 0,
    NOK_PowerDeviceD0 = 1,
    NOK_PowerDeviceD1 = 2,
    NOK_PowerDeviceD2 = 3,
    NOK_PowerDeviceD3 = 4,
    NOK_PowerDeviceMaximum = 5
}NOK_DEVICE_POWER_STATE, * NOK_PDEVICE_POWER_STATE;
//0x10 bytes (sizeof)
typedef struct _NOK_DEVICE_DATA_SET_RANGE
{
    LONGLONG StartingOffset;                                                //0x0
    ULONGLONG LengthInBytes;                                                //0x8
}NOK_DEVICE_DATA_SET_RANGE, * NOK_PDEVICE_DATA_SET_RANGE;
//0x24 bytes (sizeof)
typedef struct _NOK_CM_FULL_RESOURCE_DESCRIPTOR
{
    NOK_INTERFACE_TYPE InterfaceType;                                     //0x0
    ULONG BusNumber;                                                        //0x4
    NOK_CM_PARTIAL_RESOURCE_LIST PartialResourceList;                   //0x8
}NOK_CM_FULL_RESOURCE_DESCRIPTOR, * NOK_PCM_FULL_RESOURCE_DESCRIPTOR;
//0x1c bytes (sizeof)
typedef struct _NOK_DEVICE_DSM_DEFINITION
{
    ULONG Action;                                                           //0x0
    UCHAR SingleRange;                                                      //0x4
    ULONG ParameterBlockAlignment;                                          //0x8
    ULONG ParameterBlockLength;                                             //0xc
    UCHAR HasOutput;                                                        //0x10
    ULONG OutputBlockAlignment;                                             //0x14
    ULONG OutputBlockLength;                                                //0x18
}NOK_DEVICE_DSM_DEFINITION, * NOK_PDEVICE_DSM_DEFINITION;
//0x10 bytes (sizeof)
typedef struct _NOK_DEVICE_FAULT_CONFIGURATION
{
    VOID (*FaultHandler)(VOID* arg1, NOK_PFAULT_INFORMATION arg2);      //0x0
    VOID* FaultContext;                                                     //0x8
}NOK_DEVICE_FAULT_CONFIGURATION, * NOK_PDEVICE_FAULT_CONFIGURATION;
//0x4 bytes (sizeof)
typedef enum _NOK_CONFIGURATION_TYPE
{
    NOK_ArcSystem = 0,
    NOK_CentralProcessor = 1,
    NOK_FloatingPointProcessor = 2,
    NOK_PrimaryIcache = 3,
    NOK_PrimaryDcache = 4,
    NOK_SecondaryIcache = 5,
    NOK_SecondaryDcache = 6,
    NOK_SecondaryCache = 7,
    NOK_EisaAdapter = 8,
    NOK_TcAdapter = 9,
    NOK_ScsiAdapter = 10,
    NOK_DtiAdapter = 11,
    NOK_MultiFunctionAdapter = 12,
    NOK_DiskController = 13,
    NOK_TapeController = 14,
    NOK_CdromController = 15,
    NOK_WormController = 16,
    NOK_SerialController = 17,
    NOK_NetworkController = 18,
    NOK_DisplayController = 19,
    NOK_ParallelController = 20,
    NOK_PointerController = 21,
    NOK_KeyboardController = 22,
    NOK_AudioController = 23,
    NOK_OtherController = 24,
    NOK_DiskPeripheral = 25,
    NOK_FloppyDiskPeripheral = 26,
    NOK_TapePeripheral = 27,
    NOK_ModemPeripheral = 28,
    NOK_MonitorPeripheral = 29,
    NOK_PrinterPeripheral = 30,
    NOK_PointerPeripheral = 31,
    NOK_KeyboardPeripheral = 32,
    NOK_TerminalPeripheral = 33,
    NOK_OtherPeripheral = 34,
    NOK_LinePeripheral = 35,
    NOK_NetworkPeripheral = 36,
    NOK_SystemMemory = 37,
    NOK_DockingInformation = 38,
    NOK_RealModeIrqRoutingTable = 39,
    NOK_RealModePCIEnumeration = 40,
    NOK_MaximumType = 41
}NOK_CONFIGURATION_TYPE, * NOK_PCONFIGURATION_TYPE;
//0x1c bytes (sizeof)
typedef struct _NOK_DEVICE_MANAGE_DATA_SET_ATTRIBUTES
{
    ULONG Size;                                                             //0x0
    ULONG Action;                                                           //0x4
    ULONG Flags;                                                            //0x8
    ULONG ParameterBlockOffset;                                             //0xc
    ULONG ParameterBlockLength;                                             //0x10
    ULONG DataSetRangesOffset;                                              //0x14
    ULONG DataSetRangesLength;                                              //0x18
}NOK_DEVICE_MANAGE_DATA_SET_ATTRIBUTES, * NOK_PDEVICE_MANAGE_DATA_SET_ATTRIBUTES;
//0x24 bytes (sizeof)
typedef struct _NOK_DEVICE_MANAGE_DATA_SET_ATTRIBUTES_OUTPUT
{
    ULONG Size;                                                             //0x0
    ULONG Action;                                                           //0x4
    ULONG Flags;                                                            //0x8
    ULONG OperationStatus;                                                  //0xc
    ULONG ExtendedError;                                                    //0x10
    ULONG TargetDetailedError;                                              //0x14
    ULONG ReservedStatus;                                                   //0x18
    ULONG OutputBlockOffset;                                                //0x1c
    ULONG OutputBlockLength;                                                //0x20
}NOK_DEVICE_MANAGE_DATA_SET_ATTRIBUTES_OUTPUT, * NOK_PDEVICE_MANAGE_DATA_SET_ATTRIBUTES_OUTPUT;
//0x48 bytes (sizeof)
typedef struct _NOK_DEVICE_MAP
{
    NOK_POBJECT_DIRECTORY DosDevicesDirectory;                          //0x0
    NOK_POBJECT_DIRECTORY GlobalDosDevicesDirectory;                    //0x8
    VOID* DosDevicesDirectoryHandle;                                        //0x10
    volatile LONG ReferenceCount;                                           //0x18
    ULONG DriveMap;                                                         //0x1c
    UCHAR DriveType[32];                                                    //0x20
    NOK_PEJOB ServerSilo;                                               //0x40
}NOK_DEVICE_MAP, * NOK_PDEVICE_MAP;
//0x18 bytes (sizeof)
typedef struct _NOK_KEVENT
{
    NOK_DISPATCHER_HEADER Header;                                       //0x0
}NOK_KEVENT, * NOK_PKEVENT;
//0x18 bytes (sizeof)
typedef struct _NOK_CURDIR
{
    NOK_UNICODE_STRING DosPath;                                         //0x0
    VOID* Handle;                                                           //0x10
}NOK_CURDIR, * NOK_PCURDIR;
//0x50 bytes (sizeof)
typedef union _NOK_u
{
    NOK_CM_KEY_NODE KeyNode;                                            //0x0
    NOK_CM_KEY_VALUE KeyValue;                                          //0x0
    NOK_CM_KEY_SECURITY KeySecurity;                                    //0x0
    NOK_CM_KEY_INDEX KeyIndex;                                          //0x0
    NOK_CM_BIG_DATA ValueData;                                          //0x0
    ULONG KeyList[1];                                                       //0x0
    WCHAR KeyString[1];                                                     //0x0
}NOK_u, * NOK_Pu;
//0x4 bytes (sizeof)
typedef enum _NOK_DEVICE_RELATION_LEVEL
{
    NOK_RELATION_LEVEL_REMOVE_EJECT = 0,
    NOK_RELATION_LEVEL_DEPENDENT = 1,
    NOK_RELATION_LEVEL_DIRECT_DESCENDANT = 2
}NOK_DEVICE_RELATION_LEVEL, * NOK_PDEVICE_RELATION_LEVEL;
//0x4 bytes (sizeof)
typedef enum _NOK_PNP_DEVICE_DELETE_TYPE
{
    NOK_QueryRemoveDevice = 0,
    NOK_CancelRemoveDevice = 1,
    NOK_RemoveDevice = 2,
    NOK_SurpriseRemoveDevice = 3,
    NOK_EjectDevice = 4,
    NOK_RemoveFailedDevice = 5,
    NOK_RemoveUnstartedFailedDevice = 6,
    NOK_MaxDeviceDeleteType = 7
}NOK_PNP_DEVICE_DELETE_TYPE, * NOK_PPNP_DEVICE_DELETE_TYPE;
//0x60 bytes (sizeof)
typedef struct _NOK_DEFERRED_WRITE
{
    SHORT NodeTypeCode;                                                     //0x0
    SHORT NodeByteSize;                                                     //0x2
    NOK_PFILE_OBJECT FileObject;                                        //0x8
    ULONG BytesToWrite;                                                     //0x10
    NOK_LIST_ENTRY DeferredWriteLinks;                                  //0x18
    NOK_PKEVENT Event;                                                  //0x28
    VOID (*PostRoutine)(VOID* arg1, VOID* arg2);                            //0x30
    VOID* Context1;                                                         //0x38
    VOID* Context2;                                                         //0x40
    NOK_PCC_PARTITION Partition;                                        //0x48
    UCHAR SoftThrottle;                                                     //0x50
    NOK_LARGE_INTEGER TimeAdded;                                         //0x58
}NOK_DEFERRED_WRITE, * NOK_PDEFERRED_WRITE;
//0x10 bytes (sizeof)
typedef struct _NOK_DEVICE_RELATIONS
{
    ULONG Count;                                                            //0x0
    NOK_PDEVICE_OBJECT Objects[1];                                      //0x8
}NOK_DEVICE_RELATIONS, * NOK_PDEVICE_RELATIONS;
//0x68 bytes (sizeof)
typedef struct _NOK_PO_DEVICE_NOTIFY
{
    NOK_LIST_ENTRY Link;                                                //0x0
    NOK_LIST_ENTRY PowerChildren;                                       //0x10
    NOK_LIST_ENTRY PowerParents;                                        //0x20
    NOK_PDEVICE_OBJECT TargetDevice;                                    //0x30
    UCHAR OrderLevel;                                                       //0x38
    NOK_PDEVICE_OBJECT DeviceObject;                                    //0x40
    WCHAR* DeviceName;                                                      //0x48
    WCHAR* DriverName;                                                      //0x50
    ULONG ChildCount;                                                       //0x58
    ULONG ActiveChild;                                                      //0x5c
    ULONG ParentCount;                                                      //0x60
    ULONG ActiveParent;                                                     //0x64
}NOK_PO_DEVICE_NOTIFY, * NOK_PPO_DEVICE_NOTIFY;
//0x4 bytes (sizeof)
typedef enum _NOK_DMA_SPEED
{
    NOK_Compatible = 0,
    NOK_TypeA = 1,
    NOK_TypeB = 2,
    NOK_TypeC = 3,
    NOK_TypeF = 4,
    NOK_MaximumDmaSpeed = 5
}NOK_DMA_SPEED, * NOK_PDMA_SPEED;
//0x4 bytes (sizeof)
typedef enum _NOK_REQUESTER_TYPE
{
    NOK_KernelRequester = 0,
    NOK_UserProcessRequester = 1,
    NOK_UserSharedServiceRequester = 2
}NOK_REQUESTER_TYPE, * NOK_PREQUESTER_TYPE;
//0x28 bytes (sizeof)
typedef struct _NOK_DIAGNOSTIC_BUFFER
{
    ULONGLONG Size;                                                         //0x0
    NOK_REQUESTER_TYPE CallerType;                                        //0x8
    union
    {
        struct
        {
            ULONGLONG ProcessImageNameOffset;                               //0x10
            ULONG ProcessId;                                                //0x18
            ULONG ServiceTag;                                               //0x1c
        };
        struct
        {
            ULONGLONG DeviceDescriptionOffset;                              //0x10
            ULONGLONG DevicePathOffset;                                     //0x18
        };
    };
    ULONGLONG ReasonOffset;                                                 //0x20
}NOK_DIAGNOSTIC_BUFFER, * NOK_PDIAGNOSTIC_BUFFER;
//0x38 bytes (sizeof)
typedef struct _NOK_DIRTY_PAGE_THRESHOLDS
{
    ULONGLONG DirtyPageThreshold;                                           //0x0
    ULONGLONG DirtyPageThresholdTop;                                        //0x8
    ULONGLONG DirtyPageThresholdBottom;                                     //0x10
    ULONG DirtyPageTarget;                                                  //0x18
    ULONGLONG AggregateAvailablePages;                                      //0x20
    ULONGLONG AggregateDirtyPages;                                          //0x28
    ULONG AvailableHistory;                                                 //0x30
}NOK_DIRTY_PAGE_THRESHOLDS, * NOK_PDIRTY_PAGE_THRESHOLDS;
//0x20 bytes (sizeof)
typedef struct _NOK_DBGK_SILOSTATE
{
    NOK_EX_PUSH_LOCK ErrorPortLock;                                     //0x0
    NOK_PDBGKP_ERROR_PORT ErrorPort;                                    //0x8
    NOK_PEPROCESS ErrorProcess;                                         //0x10
    NOK_PKEVENT ErrorPortRegisteredEvent;                               //0x18
}NOK_DBGK_SILOSTATE, * NOK_PDBGK_SILOSTATE;
//0x10 bytes (sizeof)
typedef struct _NOK_DISALLOWED_GUIDS
{
    USHORT Count;                                                           //0x0
    NOK_PGUID Guids;                                                    //0x8
}NOK_DISALLOWED_GUIDS, * NOK_PDISALLOWED_GUIDS;
//0x4c bytes (sizeof)
typedef struct _NOK_SYSTEM_POWER_CAPABILITIES
{
    UCHAR PowerButtonPresent;                                               //0x0
    UCHAR SleepButtonPresent;                                               //0x1
    UCHAR LidPresent;                                                       //0x2
    UCHAR SystemS1;                                                         //0x3
    UCHAR SystemS2;                                                         //0x4
    UCHAR SystemS3;                                                         //0x5
    UCHAR SystemS4;                                                         //0x6
    UCHAR SystemS5;                                                         //0x7
    UCHAR HiberFilePresent;                                                 //0x8
    UCHAR FullWake;                                                         //0x9
    UCHAR VideoDimPresent;                                                  //0xa
    UCHAR ApmPresent;                                                       //0xb
    UCHAR UpsPresent;                                                       //0xc
    UCHAR ThermalControl;                                                   //0xd
    UCHAR ProcessorThrottle;                                                //0xe
    UCHAR ProcessorMinThrottle;                                             //0xf
    UCHAR ProcessorMaxThrottle;                                             //0x10
    UCHAR FastSystemS4;                                                     //0x11
    UCHAR Hiberboot;                                                        //0x12
    UCHAR WakeAlarmPresent;                                                 //0x13
    UCHAR AoAc;                                                             //0x14
    UCHAR DiskSpinDown;                                                     //0x15
    UCHAR HiberFileType;                                                    //0x16
    UCHAR AoAcConnectivitySupported;                                        //0x17
    UCHAR spare3[6];                                                        //0x18
    UCHAR SystemBatteriesPresent;                                           //0x1e
    UCHAR BatteriesAreShortTerm;                                            //0x1f
    NOK_BATTERY_REPORTING_SCALE BatteryScale[3];                         //0x20
    NOK_SYSTEM_POWER_STATE AcOnLineWake;                                  //0x38
    NOK_SYSTEM_POWER_STATE SoftLidWake;                                   //0x3c
    NOK_SYSTEM_POWER_STATE RtcWake;                                       //0x40
    NOK_SYSTEM_POWER_STATE MinDeviceWakeState;                            //0x44
    NOK_SYSTEM_POWER_STATE DefaultLowLatencyWake;                         //0x48
}NOK_SYSTEM_POWER_CAPABILITIES, * NOK_PSYSTEM_POWER_CAPABILITIES;
//0x10 bytes (sizeof)
typedef struct _NOK_DMA_ADAPTER
{
    USHORT Version;                                                         //0x0
    USHORT Size;                                                            //0x2
    NOK_PDMA_OPERATIONS DmaOperations;                                  //0x8
}NOK_DMA_ADAPTER, * NOK_PDMA_ADAPTER;
//0x14 bytes (sizeof)
typedef struct _NOK_DMA_ADAPTER_INFO_V1
{
    ULONG ReadDmaCounterAvailable;                                          //0x0
    ULONG ScatterGatherLimit;                                               //0x4
    ULONG DmaAddressWidth;                                                  //0x8
    ULONG Flags;                                                            //0xc
    ULONG MinimumTransferUnit;                                              //0x10
}NOK_DMA_ADAPTER_INFO_V1, * NOK_PDMA_ADAPTER_INFO_V1;
//0x18 bytes (sizeof)
typedef struct _NOK_DMA_ADAPTER_INFO
{
    ULONG Version;                                                          //0x0
    NOK_DMA_ADAPTER_INFO_V1 V1;                                         //0x4
}NOK_DMA_ADAPTER_INFO, * NOK_PDMA_ADAPTER_INFO;
//0x48 bytes (sizeof)
typedef struct _NOK_CONTROLLER_OBJECT
{
    SHORT Type;                                                             //0x0
    SHORT Size;                                                             //0x2
    VOID* ControllerExtension;                                              //0x8
    NOK_KDEVICE_QUEUE DeviceWaitQueue;                                  //0x10
    ULONG Spare1;                                                           //0x38
    NOK_LARGE_INTEGER Spare2;                                            //0x40
}NOK_CONTROLLER_OBJECT, * NOK_PCONTROLLER_OBJECT;
//0x40 bytes (sizeof)
typedef struct _NOK_KDPC
{
    union
    {
        ULONG TargetInfoAsUlong;                                            //0x0
        struct
        {
            UCHAR Type;                                                     //0x0
            UCHAR Importance;                                               //0x1
            volatile USHORT Number;                                         //0x2
        };
    };
    NOK_SINGLE_LIST_ENTRY DpcListEntry;                                 //0x8
    ULONGLONG ProcessorHistory;                                             //0x10
    VOID (*DeferredRoutine)(NOK_PKDPC arg1, VOID* arg2, VOID* arg3, VOID* arg4); //0x18
    VOID* DeferredContext;                                                  //0x20
    VOID* SystemArgument1;                                                  //0x28
    VOID* SystemArgument2;                                                  //0x30
    VOID* DpcData;                                                          //0x38
}NOK_KDPC, * NOK_PKDPC;
//0x40 bytes (sizeof)
typedef struct _NOK_ACPI_CACHED_TABLE
{
    NOK_LIST_ENTRY Links;                                               //0x0
    NOK_LARGE_INTEGER PhysicalAddress;                                   //0x10
    NOK_DESCRIPTION_HEADER Header;                                      //0x18
}NOK_ACPI_CACHED_TABLE, * NOK_PACPI_CACHED_TABLE;
//0x70 bytes (sizeof)
typedef struct _NOK_DMA_IOMMU_INTERFACE
{
    ULONG Version;                                                          //0x0
    LONG (*CreateDomain)(UCHAR arg1, NOK_PIOMMU_DMA_DOMAIN* arg2);      //0x8
    LONG (*DeleteDomain)(NOK_PIOMMU_DMA_DOMAIN arg1);                   //0x10
    LONG (*AttachDevice)(NOK_PIOMMU_DMA_DOMAIN arg1, NOK_PDEVICE_OBJECT arg2, ULONG arg3, ULONG arg4); //0x18
    LONG (*DetachDevice)(NOK_PIOMMU_DMA_DOMAIN arg1, NOK_PDEVICE_OBJECT arg2, ULONG arg3); //0x20
    LONG (*FlushDomain)(NOK_PIOMMU_DMA_DOMAIN arg1);                    //0x28
    LONG (*FlushDomainByVaList)(NOK_PIOMMU_DMA_DOMAIN arg1, UCHAR arg2, ULONG arg3, VOID* arg4); //0x30
    LONG (*QueryInputMappings)(NOK_PDEVICE_OBJECT arg1, NOK_PINPUT_MAPPING_ELEMENT arg2, ULONG arg3, ULONG* arg4); //0x38
    LONG (*MapLogicalRange)(NOK_PIOMMU_DMA_DOMAIN arg1, ULONG arg2, NOK_PMDL arg3, ULONGLONG arg4); //0x40
    LONG (*UnmapLogicalRange)(NOK_PIOMMU_DMA_DOMAIN arg1, ULONGLONG arg2, ULONGLONG arg3); //0x48
    LONG (*MapIdentityRange)(NOK_PIOMMU_DMA_DOMAIN arg1, ULONG arg2, NOK_PMDL arg3); //0x50
    LONG (*UnmapIdentityRange)(NOK_PIOMMU_DMA_DOMAIN arg1, NOK_PMDL arg2); //0x58
    LONG (*SetDeviceFaultReporting)(NOK_PDEVICE_OBJECT arg1, ULONG arg2, UCHAR arg3, NOK_PDEVICE_FAULT_CONFIGURATION arg4); //0x60
    LONG (*ConfigureDomain)(NOK_PIOMMU_DMA_DOMAIN arg1, NOK_PDOMAIN_CONFIGURATION arg2); //0x68
}NOK_DMA_IOMMU_INTERFACE, * NOK_PDMA_IOMMU_INTERFACE;
//0x4 bytes (sizeof)
typedef enum _NOK_DMA_COMPLETION_STATUS
{
    NOK_DmaComplete = 0,
    NOK_DmaAborted = 1,
    NOK_DmaError = 2,
    NOK_DmaCancelled = 3
}NOK_DMA_COMPLETION_STATUS, * NOK_PDMA_COMPLETION_STATUS;
//0x8 bytes (sizeof)
typedef struct _NOK_DMA_REQUEST_LINE_BINDING_DESCRIPTION
{
    ULONG RequestLine;                                                      //0x0
    ULONG ChannelNumber;                                                    //0x4
}NOK_DMA_REQUEST_LINE_BINDING_DESCRIPTION, * NOK_PDMA_REQUEST_LINE_BINDING_DESCRIPTION;
//0x10 bytes (sizeof)
typedef struct _NOK_DMA_COMMON_BUFFER_ENTRY
{
    VOID* VirtualAddress;                                                   //0x0
    NOK_LARGE_INTEGER LogicalAddress;                                    //0x8
}NOK_DMA_COMMON_BUFFER_ENTRY, * NOK_PDMA_COMMON_BUFFER_ENTRY;
//0x4 bytes (sizeof)
typedef enum _NOK_IO_ALLOCATION_ACTION
{
    NOK_KeepObject = 1,
    NOK_DeallocateObject = 2,
    NOK_DeallocateObjectKeepRegisters = 3
}NOK_IO_ALLOCATION_ACTION, * NOK_PIO_ALLOCATION_ACTION;
//0x18 bytes (sizeof)
typedef struct _NOK_KDEVICE_QUEUE_ENTRY
{
    NOK_LIST_ENTRY DeviceListEntry;                                     //0x0
    ULONG SortKey;                                                          //0x10
    UCHAR Inserted;                                                         //0x14
}NOK_KDEVICE_QUEUE_ENTRY, * NOK_PKDEVICE_QUEUE_ENTRY;
//0xc bytes (sizeof)
typedef struct _NOK_DMA_TRANSFER_INFO_V1
{
    ULONG MapRegisterCount;                                                 //0x0
    ULONG ScatterGatherElementCount;                                        //0x4
    ULONG ScatterGatherListSize;                                            //0x8
}NOK_DMA_TRANSFER_INFO_V1, * NOK_PDMA_TRANSFER_INFO_V1;
//0x10 bytes (sizeof)
typedef struct _NOK_DMA_TRANSFER_INFO_V2
{
    ULONG MapRegisterCount;                                                 //0x0
    ULONG ScatterGatherElementCount;                                        //0x4
    ULONG ScatterGatherListSize;                                            //0x8
    ULONG LogicalPageCount;                                                 //0xc
}NOK_DMA_TRANSFER_INFO_V2, * NOK_PDMA_TRANSFER_INFO_V2;
//0x14 bytes (sizeof)
typedef struct _NOK_DMA_TRANSFER_INFO
{
    ULONG Version;                                                          //0x0
    union
    {
        NOK_DMA_TRANSFER_INFO_V1 V1;                                    //0x4
        NOK_DMA_TRANSFER_INFO_V2 V2;                                    //0x4
    };
}NOK_DMA_TRANSFER_INFO, * NOK_PDMA_TRANSFER_INFO;
//0x50 bytes (sizeof)
typedef struct _NOK_DMA_FUNCTION_TABLE
{
    VOID (*InitializeController)(VOID* arg1);                               //0x0
    UCHAR (*ValidateRequestLineBinding)(VOID* arg1, NOK_PDMA_REQUEST_LINE_BINDING_DESCRIPTION arg2); //0x8
    ULONG (*QueryMaxFragments)(VOID* arg1, ULONG arg2, ULONG arg3);         //0x10
    VOID (*ProgramChannel)(VOID* arg1, ULONG arg2, ULONG arg3, NOK_PDMA_SCATTER_GATHER_LIST arg4, NOK_LARGE_INTEGER arg5, UCHAR arg6, UCHAR arg7); //0x18
    LONG (*ConfigureChannel)(VOID* arg1, ULONG arg2, ULONG arg3, VOID* arg4); //0x20
    VOID (*FlushChannel)(VOID* arg1, ULONG arg2);                           //0x28
    UCHAR (*HandleInterrupt)(VOID* arg1, ULONG* arg2, NOK_PDMA_INTERRUPT_TYPE arg3); //0x30
    ULONG (*ReadDmaCounter)(VOID* arg1, ULONG arg2);                        //0x38
    VOID (*ReportCommonBuffer)(VOID* arg1, ULONG arg2, VOID* arg3, NOK_LARGE_INTEGER arg4); //0x40
    UCHAR (*CancelTransfer)(VOID* arg1, ULONG arg2);                        //0x48
}NOK_DMA_FUNCTION_TABLE, * NOK_PDMA_FUNCTION_TABLE;
//0x20 bytes (sizeof)
typedef struct _NOK_DOMAIN_CONFIGURATION_ARM64
{
    NOK_LARGE_INTEGER Ttbr0;                                             //0x0
    NOK_LARGE_INTEGER Ttbr1;                                             //0x8
    ULONG Mair0;                                                            //0x10
    ULONG Mair1;                                                            //0x14
    UCHAR InputSize0;                                                       //0x18
    UCHAR InputSize1;                                                       //0x19
    UCHAR CoherentTableWalks;                                               //0x1a
    UCHAR TranslationEnabled;                                               //0x1b
}NOK_DOMAIN_CONFIGURATION_ARM64, * NOK_PDOMAIN_CONFIGURATION_ARM64;
//0x28 bytes (sizeof)
typedef struct _NOK_DOMAIN_CONFIGURATION
{
    NOK_DOMAIN_CONFIGURATION_ARCH Type;                                   //0x0
    NOK_DOMAIN_CONFIGURATION_ARM64 Arm64;                               //0x8
}NOK_DOMAIN_CONFIGURATION, * NOK_PDOMAIN_CONFIGURATION;
//0x30 bytes (sizeof)
typedef struct _NOK_CRITICAL_PROCESS_EXCEPTION_DATA
{
    NOK_GUID ReportId;                                                  //0x0
    NOK_UNICODE_STRING ModuleName;                                      //0x10
    ULONG ModuleTimestamp;                                                  //0x20
    ULONG ModuleSize;                                                       //0x24
    ULONGLONG Offset;                                                       //0x28
}NOK_CRITICAL_PROCESS_EXCEPTION_DATA, * NOK_PCRITICAL_PROCESS_EXCEPTION_DATA;
//0x28 bytes (sizeof)
typedef struct _NOK_DRIVER_EXTENSION
{
    NOK_PDRIVER_OBJECT DriverObject;                                    //0x0
    LONG (*AddDevice)(NOK_PDRIVER_OBJECT arg1, NOK_PDEVICE_OBJECT arg2); //0x8
    ULONG Count;                                                            //0x10
    NOK_UNICODE_STRING ServiceKeyName;                                  //0x18
}NOK_DRIVER_EXTENSION, * NOK_PDRIVER_EXTENSION;
//0x10 bytes (sizeof)
typedef struct _NOK_RTL_BITMAP
{
    ULONG SizeOfBitMap;                                                     //0x0
    ULONG* Buffer;                                                          //0x8
}NOK_RTL_BITMAP, * NOK_PRTL_BITMAP;
//0x8 bytes (sizeof)
typedef struct _NOK_QUAD
{
    union
    {
        LONGLONG UseThisFieldToCopy;                                        //0x0
        double DoNotUseThisField;                                           //0x0
    };
}NOK_QUAD, * NOK_PQUAD;
//0x14 bytes (sizeof)
typedef struct _NOK_DEVPROPKEY
{
    NOK_GUID fmtid;                                                     //0x0
    ULONG pid;                                                              //0x10
}NOK_DEVPROPKEY, * NOK_PDEVPROPKEY;
//0x48 bytes (sizeof)
typedef struct _NOK_DMA_COMMON_BUFFER_VECTOR
{
    NOK_LIST_ENTRY ListEntry;                                           //0x0
    ULONGLONG SizeOfEntries;                                                //0x10
    ULONG NumberOfEntries;                                                  //0x18
    NOK_PHALP_DMA_DOMAIN_OBJECT Domain;                                 //0x20
    NOK_PMDL Mdl;                                                       //0x28
    VOID* BaseAddress;                                                      //0x30
    ULONGLONG BaseLogicalAddress;                                           //0x38
    NOK_PDMA_COMMON_BUFFER_ENTRY Entries;                               //0x40
}NOK_DMA_COMMON_BUFFER_VECTOR, * NOK_PDMA_COMMON_BUFFER_VECTOR;
//0x10 bytes (sizeof)
typedef struct _NOK_STRING
{
    USHORT Length;                                                          //0x0
    USHORT MaximumLength;                                                   //0x2
    CHAR* Buffer;                                                           //0x8
}NOK_STRING, * NOK_PSTRING;
//0x18 bytes (sizeof)
typedef struct _NOK_RTL_BALANCED_NODE
{
    union
    {
        NOK_PRTL_BALANCED_NODE Children[2];                             //0x0
        struct
        {
            NOK_PRTL_BALANCED_NODE Left;                                //0x0
            NOK_PRTL_BALANCED_NODE Right;                               //0x8
        };
    };
    union
    {
        struct
        {
            UCHAR Red:1;                                                    //0x10
            UCHAR Balance:2;                                                //0x10
        };
        ULONGLONG ParentValue;                                              //0x10
    };
}NOK_RTL_BALANCED_NODE, * NOK_PRTL_BALANCED_NODE;
//0x18 bytes (sizeof)
typedef struct _NOK_ECP_LIST
{
    ULONG Signature;                                                        //0x0
    ULONG Flags;                                                            //0x4
    NOK_LIST_ENTRY EcpList;                                             //0x8
}NOK_ECP_LIST, * NOK_PECP_LIST;
//0x1 bytes (sizeof)
typedef union _NOK_KEXECUTE_OPTIONS
{
    UCHAR ExecuteDisable:1;                                                 //0x0
    UCHAR ExecuteEnable:1;                                                  //0x0
    UCHAR DisableThunkEmulation:1;                                          //0x0
    UCHAR Permanent:1;                                                      //0x0
    UCHAR ExecuteDispatchEnable:1;                                          //0x0
    UCHAR ImageDispatchEnable:1;                                            //0x0
    UCHAR DisableExceptionChainValidation:1;                                //0x0
    UCHAR Spare:1;                                                          //0x0
    volatile UCHAR ExecuteOptions;                                          //0x0
    UCHAR ExecuteOptionsNV;                                                 //0x0
}NOK_KEXECUTE_OPTIONS, * NOK_PKEXECUTE_OPTIONS;
//0x1 bytes (sizeof)
typedef struct _NOK_flags
{
    UCHAR Removable:1;                                                      //0x0
    UCHAR GroupAssigned:1;                                                  //0x0
    UCHAR GroupCommitted:1;                                                 //0x0
    UCHAR GroupAssignmentFixed:1;                                           //0x0
    UCHAR ProcessorOnly:1;                                                  //0x0
    UCHAR SmtSetsPresent:1;                                                 //0x0
    UCHAR Fill:2;                                                           //0x0
}NOK_flags, * NOK_Pflags;
//0x20 bytes (sizeof)
typedef struct _NOK_CACHE_UNINITIALIZE_EVENT
{
    NOK_PCACHE_UNINITIALIZE_EVENT Next;                                 //0x0
    NOK_KEVENT Event;                                                   //0x8
}NOK_CACHE_UNINITIALIZE_EVENT, * NOK_PCACHE_UNINITIALIZE_EVENT;
//0xa8 bytes (sizeof)
typedef struct _NOK_KAFFINITY_EX
{
    USHORT Count;                                                           //0x0
    USHORT Size;                                                            //0x2
    ULONG Reserved;                                                         //0x4
    ULONGLONG Bitmap[20];                                                   //0x8
}NOK_KAFFINITY_EX, * NOK_PKAFFINITY_EX;
//0x38 bytes (sizeof)
typedef struct _NOK_EFI_FIRMWARE_INFORMATION
{
    ULONG FirmwareVersion;                                                  //0x0
    NOK_PVIRTUAL_EFI_RUNTIME_SERVICES VirtualEfiRuntimeServices;        //0x8
    LONG SetVirtualAddressMapStatus;                                        //0x10
    ULONG MissedMappingsCount;                                              //0x14
    NOK_LIST_ENTRY FirmwareResourceList;                                //0x18
    VOID* EfiMemoryMap;                                                     //0x28
    ULONG EfiMemoryMapSize;                                                 //0x30
    ULONG EfiMemoryMapDescriptorSize;                                       //0x34
}NOK_EFI_FIRMWARE_INFORMATION, * NOK_PEFI_FIRMWARE_INFORMATION;
//0x20 bytes (sizeof)
typedef struct _NOK_WORK_QUEUE_ITEM
{
    NOK_LIST_ENTRY List;                                                //0x0
    VOID (*WorkerRoutine)(VOID* arg1);                                      //0x10
    VOID* Parameter;                                                        //0x18
}NOK_WORK_QUEUE_ITEM, * NOK_PWORK_QUEUE_ITEM;
//0x10 bytes (sizeof)
typedef struct _NOK_OWNER_ENTRY
{
    ULONGLONG OwnerThread;                                                  //0x0
    union
    {
        struct
        {
            ULONG IoPriorityBoosted:1;                                      //0x8
            ULONG OwnerReferenced:1;                                        //0x8
            ULONG IoQoSPriorityBoosted:1;                                   //0x8
            ULONG OwnerCount:29;                                            //0x8
        };
        ULONG TableSize;                                                    //0x8
    };
}NOK_OWNER_ENTRY, * NOK_POWNER_ENTRY;
//0x6c bytes (sizeof)
typedef struct _NOK_OBP_SYSTEM_DOS_DEVICE_STATE
{
    ULONG GlobalDeviceMap;                                                  //0x0
    ULONG LocalDeviceCount[26];                                             //0x4
}NOK_OBP_SYSTEM_DOS_DEVICE_STATE, * NOK_POBP_SYSTEM_DOS_DEVICE_STATE;
//0x4 bytes (sizeof)
typedef enum _NOK_DUMP_EVENTS
{
    NOK_DUMP_EVENT_NONE = 0,
    NOK_DUMP_EVENT_HIBER_RESUME = 1,
    NOK_DUMP_EVENT_HIBER_RESUME_END = 2
}NOK_DUMP_EVENTS, * NOK_PDUMP_EVENTS;
//0x4 bytes (sizeof)
typedef struct _NOK_MMSECTION_FLAGS
{
    ULONG BeingDeleted:1;                                                   //0x0
    ULONG BeingCreated:1;                                                   //0x0
    ULONG BeingPurged:1;                                                    //0x0
    ULONG NoModifiedWriting:1;                                              //0x0
    ULONG FailAllIo:1;                                                      //0x0
    ULONG Image:1;                                                          //0x0
    ULONG Based:1;                                                          //0x0
    ULONG File:1;                                                           //0x0
    ULONG AttemptingDelete:1;                                               //0x0
    ULONG PrefetchCreated:1;                                                //0x0
    ULONG PhysicalMemory:1;                                                 //0x0
    ULONG ImageControlAreaOnRemovableMedia:1;                               //0x0
    ULONG Reserve:1;                                                        //0x0
    ULONG Commit:1;                                                         //0x0
    ULONG NoChange:1;                                                       //0x0
    ULONG WasPurged:1;                                                      //0x0
    ULONG UserReference:1;                                                  //0x0
    ULONG GlobalMemory:1;                                                   //0x0
    ULONG DeleteOnClose:1;                                                  //0x0
    ULONG FilePointerNull:1;                                                //0x0
    ULONG PreferredNode:6;                                                  //0x0
    ULONG GlobalOnlyPerSession:1;                                           //0x0
    ULONG UserWritable:1;                                                   //0x0
    ULONG SystemVaAllocated:1;                                              //0x0
    ULONG PreferredFsCompressionBoundary:1;                                 //0x0
    ULONG UsingFileExtents:1;                                               //0x0
    ULONG PageSize64K:1;                                                    //0x0
}NOK_MMSECTION_FLAGS, * NOK_PMMSECTION_FLAGS;
//0x8 bytes (sizeof)
typedef struct _NOK_JOBOBJECT_WAKE_FILTER
{
    ULONG HighEdgeFilter;                                                   //0x0
    ULONG LowEdgeFilter;                                                    //0x4
}NOK_JOBOBJECT_WAKE_FILTER, * NOK_PJOBOBJECT_WAKE_FILTER;
//0x58 bytes (sizeof)
typedef struct _NOK_KAPC
{
    UCHAR Type;                                                             //0x0
    UCHAR SpareByte0;                                                       //0x1
    UCHAR Size;                                                             //0x2
    UCHAR SpareByte1;                                                       //0x3
    ULONG SpareLong0;                                                       //0x4
    NOK_PKTHREAD Thread;                                                //0x8
    NOK_LIST_ENTRY ApcListEntry;                                        //0x10
    VOID* Reserved[3];                                                      //0x20
    VOID* NormalContext;                                                    //0x38
    VOID* SystemArgument1;                                                  //0x40
    VOID* SystemArgument2;                                                  //0x48
    CHAR ApcStateIndex;                                                     //0x50
    CHAR ApcMode;                                                           //0x51
    UCHAR Inserted;                                                         //0x52
}NOK_KAPC, * NOK_PKAPC;
//0x4 bytes (sizeof)
typedef struct _NOK_ETW_BUFFER_CONTEXT
{
    union
    {
        struct
        {
            UCHAR ProcessorNumber;                                          //0x0
            UCHAR Alignment;                                                //0x1
        };
        USHORT ProcessorIndex;                                              //0x0
    };
    USHORT LoggerId;                                                        //0x2
}NOK_ETW_BUFFER_CONTEXT, * NOK_PETW_BUFFER_CONTEXT;
//0x10 bytes (sizeof)
typedef struct _NOK_ETW_COUNTERS
{
    LONG GuidCount;                                                         //0x0
    LONG PoolUsage[2];                                                      //0x4
    LONG SessionCount;                                                      //0xc
}NOK_ETW_COUNTERS, * NOK_PETW_COUNTERS;
//0x4 bytes (sizeof)
typedef enum _NOK_ETW_NOTIFICATION_TYPE
{
    NOK_EtwNotificationTypeNoReply = 1,
    NOK_EtwNotificationTypeLegacyEnable = 2,
    NOK_EtwNotificationTypeEnable = 3,
    NOK_EtwNotificationTypePrivateLogger = 4,
    NOK_EtwNotificationTypePerflib = 5,
    NOK_EtwNotificationTypeAudio = 6,
    NOK_EtwNotificationTypeSession = 7,
    NOK_EtwNotificationTypeReserved = 8,
    NOK_EtwNotificationTypeCredentialUI = 9,
    NOK_EtwNotificationTypeInProcSession = 10,
    NOK_EtwNotificationTypeFilteredPrivateLogger = 11,
    NOK_EtwNotificationTypeMax = 12
}NOK_ETW_NOTIFICATION_TYPE, * NOK_PETW_NOTIFICATION_TYPE;
//0x10 bytes (sizeof)
typedef struct _NOK_RTL_HASH_TABLE
{
    ULONG EntryCount;                                                       //0x0
    ULONG MaskBitCount:5;                                                   //0x4
    ULONG BucketCount:27;                                                   //0x4
    NOK_PSINGLE_LIST_ENTRY Buckets;                                     //0x8
}NOK_RTL_HASH_TABLE, * NOK_PRTL_HASH_TABLE;
//0x68 bytes (sizeof)
typedef struct _NOK_ETW_FILTER_HEADER
{
    LONG FilterFlags;                                                       //0x0
    NOK_PETW_FILTER_PID PidFilter;                                      //0x8
    NOK_PETW_FILTER_STRING_TOKEN ExeFilter;                             //0x10
    NOK_PETW_FILTER_STRING_TOKEN PkgIdFilter;                           //0x18
    NOK_PETW_FILTER_STRING_TOKEN PkgAppIdFilter;                        //0x20
    NOK_PETW_FILTER_STRING_TOKEN ContainerFilter;                       //0x28
    NOK_PETW_PERFECT_HASH_FUNCTION StackWalkIdFilter;                   //0x30
    NOK_PETW_FILTER_EVENT_NAME_DATA StackWalkNameFilter;                //0x38
    NOK_PEVENT_FILTER_LEVEL_KW StackWalkLevelKwFilter;                  //0x40
    NOK_PETW_PERFECT_HASH_FUNCTION EventIdFilter;                       //0x48
    NOK_PETW_PAYLOAD_FILTER PayloadFilter;                              //0x50
    NOK_PEVENT_FILTER_HEADER ProviderSideFilter;                        //0x58
    NOK_PETW_FILTER_EVENT_NAME_DATA EventNameFilter;                    //0x60
}NOK_ETW_FILTER_HEADER, * NOK_PETW_FILTER_HEADER;
//0x24 bytes (sizeof)
typedef struct _NOK_ETW_FILTER_PID
{
    ULONG Count;                                                            //0x0
    ULONG Pids[8];                                                          //0x4
}NOK_ETW_FILTER_PID, * NOK_PETW_FILTER_PID;
//0x10 bytes (sizeof)
typedef struct _NOK_ETW_FILTER_STRING_TOKEN_ELEMENT
{
    USHORT Length;                                                          //0x0
    WCHAR* String;                                                          //0x8
}NOK_ETW_FILTER_STRING_TOKEN_ELEMENT, * NOK_PETW_FILTER_STRING_TOKEN_ELEMENT;
//0x18 bytes (sizeof)
typedef struct _NOK_ETW_FILTER_STRING_TOKEN
{
    USHORT Count;                                                           //0x0
    NOK_ETW_FILTER_STRING_TOKEN_ELEMENT Tokens[1];                      //0x8
}NOK_ETW_FILTER_STRING_TOKEN, * NOK_PETW_FILTER_STRING_TOKEN;
//0x18 bytes (sizeof)
typedef struct _NOK_SCATTER_GATHER_ELEMENT
{
    NOK_LARGE_INTEGER Address;                                           //0x0
    ULONG Length;                                                           //0x8
    ULONGLONG Reserved;                                                     //0x10
}NOK_SCATTER_GATHER_ELEMENT, * NOK_PSCATTER_GATHER_ELEMENT;
//0x10 bytes (sizeof)
typedef struct _NOK_RTL_RB_TREE
{
    NOK_PRTL_BALANCED_NODE Root;                                        //0x0
    union
    {
        UCHAR Encoded:1;                                                    //0x8
        NOK_PRTL_BALANCED_NODE Min;                                     //0x8
    };
}NOK_RTL_RB_TREE, * NOK_PRTL_RB_TREE;
//0x18 bytes (sizeof)
typedef struct _NOK_ETW_HW_TRACE_EXT_INTERFACE
{
    LONG (*StartProcessorTraceOnEachCore)(ULONGLONG arg1, VOID** arg2);     //0x0
    LONG (*StopProcessorTraceOnEachCore)(VOID* arg1);                       //0x8
    LONG (*LogProcessorTraceOnCurrentCore)(VOID* arg1, VOID* arg2);         //0x10
}NOK_ETW_HW_TRACE_EXT_INTERFACE, * NOK_PETW_HW_TRACE_EXT_INTERFACE;
//0x28 bytes (sizeof)
typedef struct _NOK_ETW_IPT_SUPPORT
{
    VOID* IptHandle;                                                        //0x0
    ULONGLONG IptOption;                                                    //0x8
    NOK_PETW_HW_TRACE_EXT_INTERFACE EtwHwTraceExtInterface;             //0x10
    volatile ULONG HookIdCount;                                             //0x18
    USHORT HookId[4];                                                       //0x1c
}NOK_ETW_IPT_SUPPORT, * NOK_PETW_IPT_SUPPORT;
//0x14 bytes (sizeof)
typedef struct _NOK_NB10
{
    ULONG Signature;                                                        //0x0
    ULONG Offset;                                                           //0x4
    ULONG TimeStamp;                                                        //0x8
    ULONG Age;                                                              //0xc
    CHAR PdbName[1];                                                        //0x10
}NOK_NB10, * NOK_PNB10;
//0x14 bytes (sizeof)
typedef struct _NOK_ETW_LBR_SUPPORT
{
    ULONG LbrHandle;                                                        //0x0
    ULONG LbrOptions;                                                       //0x4
    volatile ULONG HookIdCount;                                             //0x8
    USHORT HookId[4];                                                       //0xc
}NOK_ETW_LBR_SUPPORT, * NOK_PETW_LBR_SUPPORT;
//0x1 bytes (sizeof)
typedef struct _NOK_ETW_LOGGER_HANDLE
{
    UCHAR DereferenceAndLeave;                                              //0x0
}NOK_ETW_LOGGER_HANDLE, * NOK_PETW_LOGGER_HANDLE;
//0x8 bytes (sizeof)
typedef struct _NOK_ETW_PARTITION_CONTEXT
{
    NOK_PEPARTITION Partition;                                          //0x0
}NOK_ETW_PARTITION_CONTEXT, * NOK_PETW_PARTITION_CONTEXT;
//0x50 bytes (sizeof)
typedef struct _NOK_AGGREGATED_PAYLOAD_FILTER
{
    USHORT MagicValue:12;                                                   //0x0
    USHORT DescriptorVersion:4;                                             //0x0
    USHORT Size;                                                            //0x2
    USHORT PredicateCount;                                                  //0x4
    USHORT Reserved;                                                        //0x6
    ULONGLONG HashedEventIdBitmap;                                          //0x8
    NOK_GUID ProviderGuid;                                              //0x10
    USHORT EachEventTableOffset;                                            //0x20
    USHORT EachEventTableLength;                                            //0x22
    USHORT PayloadDecoderTableOffset;                                       //0x24
    USHORT PayloadDecoderTableLength;                                       //0x26
    USHORT EventFilterTableOffset;                                          //0x28
    USHORT EventFilterTableLength;                                          //0x2a
    USHORT UNICODEStringTableOffset;                                        //0x2c
    USHORT UNICODEStringTableLength;                                        //0x2e
    USHORT ANSIStringTableOffset;                                           //0x30
    USHORT ANSIStringTableLength;                                           //0x32
    NOK_EVENT_PAYLOAD_PREDICATE PredicateTable[1];                      //0x38
}NOK_AGGREGATED_PAYLOAD_FILTER, * NOK_PAGGREGATED_PAYLOAD_FILTER;
//0x18 bytes (sizeof)
typedef struct _NOK_ETW_PERF_COUNTERS
{
    LONG TotalActiveSessions;                                               //0x0
    LONG TotalBufferMemoryNonPagedPool;                                     //0x4
    LONG TotalBufferMemoryPagedPool;                                        //0x8
    LONG TotalGuidsEnabled;                                                 //0xc
    LONG TotalGuidsNotEnabled;                                              //0x10
    LONG TotalGuidsPreEnabled;                                              //0x14
}NOK_ETW_PERF_COUNTERS, * NOK_PETW_PERF_COUNTERS;
//0x20 bytes (sizeof)
typedef struct _NOK_ETW_PMC_SUPPORT
{
    NOK_PKPROFILE_SOURCE Source;                                          //0x0
    volatile ULONG HookIdCount;                                             //0x8
    USHORT HookId[4];                                                       //0xc
    volatile ULONG CountersCount;                                           //0x14
    NOK_PHAL_PMC_COUNTERS ProcessorCtrs[1];                             //0x18
}NOK_ETW_PMC_SUPPORT, * NOK_PETW_PMC_SUPPORT;
//0x30 bytes (sizeof)
typedef struct _NOK_ETW_DECODE_CONTROL_ENTRY
{
    NOK_PETW_DECODE_CONTROL_ENTRY Next;                                 //0x0
    NOK_GUID Decode;                                                    //0x8
    NOK_GUID Control;                                                   //0x18
    UCHAR ConsumersNotified;                                                //0x28
}NOK_ETW_DECODE_CONTROL_ENTRY, * NOK_PETW_DECODE_CONTROL_ENTRY;
//0x4 bytes (sizeof)
typedef enum _NOK_FUNCTION_TABLE_TYPE
{
    NOK_RF_SORTED = 0,
    NOK_RF_UNSORTED = 1,
    NOK_RF_CALLBACK = 2,
    NOK_RF_KERNEL_DYNAMIC = 3
}NOK_FUNCTION_TABLE_TYPE, * NOK_PFUNCTION_TABLE_TYPE;
//0x38 bytes (sizeof)
typedef struct _NOK_ETW_HASH_BUCKET
{
    NOK_LIST_ENTRY ListHead[3];                                         //0x0
    NOK_EX_PUSH_LOCK BucketLock;                                        //0x30
}NOK_ETW_HASH_BUCKET, * NOK_PETW_HASH_BUCKET;
//0x38 bytes (sizeof)
typedef struct _NOK_ETW_QUEUE_ENTRY
{
    NOK_LIST_ENTRY ListEntry;                                           //0x0
    NOK_PETWP_NOTIFICATION_HEADER DataBlock;                            //0x10
    NOK_PETW_REG_ENTRY RegEntry;                                        //0x18
    NOK_PETW_REG_ENTRY ReplyObject;                                     //0x20
    VOID* WakeReference;                                                    //0x28
    USHORT RegIndex;                                                        //0x30
    USHORT ReplyIndex;                                                      //0x32
    ULONG Flags;                                                            //0x34
}NOK_ETW_QUEUE_ENTRY, * NOK_PETW_QUEUE_ENTRY;
//0x4 bytes (sizeof)
typedef enum _NOK_DOMAIN_CONFIGURATION_ARCH
{
    NOK_DomainConfigurationArm64 = 0,
    NOK_DomainConfigurationInvalid = 1
}NOK_DOMAIN_CONFIGURATION_ARCH, * NOK_PDOMAIN_CONFIGURATION_ARCH;
//0x18 bytes (sizeof)
typedef struct _NOK_FREE_DISPLAY
{
    ULONG RealVectorSize;                                                   //0x0
    ULONG Hint;                                                             //0x4
    NOK_RTL_BITMAP Display;                                             //0x8
}NOK_FREE_DISPLAY, * NOK_PFREE_DISPLAY;
//0x70 bytes (sizeof)
typedef struct _NOK_ETW_REG_ENTRY
{
    NOK_LIST_ENTRY RegList;                                             //0x0
    NOK_LIST_ENTRY GroupRegList;                                        //0x10
    NOK_PETW_GUID_ENTRY GuidEntry;                                      //0x20
    NOK_PETW_GUID_ENTRY GroupEntry;                                     //0x28
    union
    {
        NOK_PETW_REPLY_QUEUE ReplyQueue;                                //0x30
        NOK_PETW_QUEUE_ENTRY ReplySlot[4];                              //0x30
        struct
        {
            VOID* Caller;                                                   //0x30
            ULONG SessionId;                                                //0x38
        };
    };
    union
    {
        NOK_PEPROCESS Process;                                          //0x50
        VOID* CallbackContext;                                              //0x50
    };
    VOID* Callback;                                                         //0x58
    USHORT Index;                                                           //0x60
    union
    {
        USHORT Flags;                                                       //0x62
        struct
        {
            USHORT DbgKernelRegistration:1;                                 //0x62
            USHORT DbgUserRegistration:1;                                   //0x62
            USHORT DbgReplyRegistration:1;                                  //0x62
            USHORT DbgClassicRegistration:1;                                //0x62
            USHORT DbgSessionSpaceRegistration:1;                           //0x62
            USHORT DbgModernRegistration:1;                                 //0x62
            USHORT DbgClosed:1;                                             //0x62
            USHORT DbgInserted:1;                                           //0x62
            USHORT DbgWow64:1;                                              //0x62
            USHORT DbgUseDescriptorType:1;                                  //0x62
            USHORT DbgDropProviderTraits:1;                                 //0x62
        };
    };
    UCHAR EnableMask;                                                       //0x64
    UCHAR GroupEnableMask;                                                  //0x65
    UCHAR HostEnableMask;                                                   //0x66
    UCHAR HostGroupEnableMask;                                              //0x67
    NOK_PETW_PROVIDER_TRAITS Traits;                                    //0x68
}NOK_ETW_REG_ENTRY, * NOK_PETW_REG_ENTRY;
//0x18 bytes (sizeof)
typedef struct _NOK_ETW_SESSION_PERF_COUNTERS
{
    LONG BufferMemoryPagedPool;                                             //0x0
    LONG BufferMemoryNonPagedPool;                                          //0x4
    ULONGLONG EventsLoggedCount;                                            //0x8
    LONG EventsLost;                                                        //0x10
    LONG NumConsumers;                                                      //0x14
}NOK_ETW_SESSION_PERF_COUNTERS, * NOK_PETW_SESSION_PERF_COUNTERS;
//0x2 bytes (sizeof)
typedef struct _NOK_ETW_SYSTEM_LOGGER
{
    UCHAR LoggerId;                                                         //0x0
    UCHAR ClockType;                                                        //0x1
}NOK_ETW_SYSTEM_LOGGER, * NOK_PETW_SYSTEM_LOGGER;
//0x40 bytes (sizeof)
typedef struct _NOK_ETW_SILO_TRACING_BLOCK
{
    NOK_PEX_FAST_REF ProcessorBuffers;                                  //0x0
    ULONGLONG* EventsLoggedCount;                                           //0x8
    LONGLONG* QpcDelta;                                                     //0x10
}NOK_ETW_SILO_TRACING_BLOCK, * NOK_PETW_SILO_TRACING_BLOCK;
//0x10 bytes (sizeof)
typedef struct _NOK_ETW_BUFFER_QUEUE
{
    NOK_PSINGLE_LIST_ENTRY QueueTail;                                   //0x0
    NOK_SINGLE_LIST_ENTRY QueueEntry;                                   //0x8
}NOK_ETW_BUFFER_QUEUE, * NOK_PETW_BUFFER_QUEUE;
//0x10 bytes (sizeof)
typedef struct _NOK_ETW_SYSTEMTIME
{
    USHORT Year;                                                            //0x0
    USHORT Month;                                                           //0x2
    USHORT DayOfWeek;                                                       //0x4
    USHORT Day;                                                             //0x6
    USHORT Hour;                                                            //0x8
    USHORT Minute;                                                          //0xa
    USHORT Second;                                                          //0xc
    USHORT Milliseconds;                                                    //0xe
}NOK_ETW_SYSTEMTIME, * NOK_PETW_SYSTEMTIME;
//0x20 bytes (sizeof)
typedef struct _NOK_PERFINFO_GROUPMASK
{
    ULONG Masks[8];                                                         //0x0
}NOK_PERFINFO_GROUPMASK, * NOK_PPERFINFO_GROUPMASK;
//0x10 bytes (sizeof)
typedef struct _NOK_KLOCK_ENTRY_LOCK_STATE
{
    union
    {
        struct
        {
            ULONGLONG CrossThreadReleasable:1;                              //0x0
            ULONGLONG Busy:1;                                               //0x0
            ULONGLONG Reserved:61;                                          //0x0
            ULONGLONG InTree:1;                                             //0x0
        };
        VOID* LockState;                                                    //0x0
    };
    union
    {
        VOID* SessionState;                                                 //0x8
        struct
        {
            ULONG SessionId;                                                //0x8
            ULONG SessionPad;                                               //0xc
        };
    };
}NOK_KLOCK_ENTRY_LOCK_STATE, * NOK_PKLOCK_ENTRY_LOCK_STATE;
//0x4 bytes (sizeof)
typedef union _NOK_KLOCK_ENTRY_BOOST_BITMAP
{
    ULONG AllFields;                                                        //0x0
    ULONG AllBoosts:17;                                                     //0x0
    ULONG Reserved:15;                                                      //0x0
    USHORT CpuBoostsBitmap:15;                                              //0x0
    struct
    {
        USHORT IoBoost:1;                                                   //0x0
        USHORT IoQoSBoost:1;                                                    //0x2
        USHORT IoNormalPriorityWaiterCount:8;                                   //0x2
    };
    USHORT IoQoSWaiterCount:7;                                              //0x2
}NOK_KLOCK_ENTRY_BOOST_BITMAP, * NOK_PKLOCK_ENTRY_BOOST_BITMAP;
//0x60 bytes (sizeof)
typedef struct _NOK_KLOCK_ENTRY
{
    union
    {
        NOK_RTL_BALANCED_NODE TreeNode;                                 //0x0
        NOK_SINGLE_LIST_ENTRY FreeListEntry;                            //0x0
    };
    union
    {
        ULONG EntryFlags;                                                   //0x18
        struct
        {
            UCHAR EntryOffset;                                              //0x18
            union
            {
                UCHAR ThreadLocalFlags;                                     //0x19
                struct
                {
                    UCHAR WaitingBit:1;                                     //0x19
                    UCHAR Spare0:7;                                         //0x19
                };
            };
            union
            {
                UCHAR AcquiredByte;                                         //0x1a
                UCHAR AcquiredBit:1;                                        //0x1a
            };
            union
            {
                UCHAR CrossThreadFlags;                                     //0x1b
                struct
                {
                    UCHAR HeadNodeBit:1;                                    //0x1b
                    UCHAR IoPriorityBit:1;                                  //0x1b
                    UCHAR IoQoSWaiter:1;                                    //0x1b
                    UCHAR Spare1:5;                                         //0x1b
                };
            };
        };
        struct
        {
            ULONG StaticState:8;                                            //0x18
            ULONG AllFlags:24;                                              //0x18
        };
    };
    ULONG SpareFlags;                                                       //0x1c
    union
    {
        NOK_KLOCK_ENTRY_LOCK_STATE LockState;                           //0x20
        VOID* volatile LockUnsafe;                                          //0x20
        struct
        {
            volatile UCHAR CrossThreadReleasableAndBusyByte;                //0x20
            UCHAR Reserved[6];                                              //0x21
            volatile UCHAR InTreeByte;                                      //0x27
            union
            {
                VOID* SessionState;                                         //0x28
                struct
                {
                    ULONG SessionId;                                        //0x28
                    ULONG SessionPad;                                       //0x2c
                };
            };
        };
    };
    union
    {
        struct
        {
            NOK_RTL_RB_TREE OwnerTree;                                  //0x30
            NOK_RTL_RB_TREE WaiterTree;                                 //0x40
        };
        CHAR CpuPriorityKey;                                                //0x30
    };
    ULONGLONG EntryLock;                                                    //0x50
    NOK_KLOCK_ENTRY_BOOST_BITMAP BoostBitmap;                            //0x58
    ULONG SparePad;                                                         //0x5c
}NOK_KLOCK_ENTRY, * NOK_PKLOCK_ENTRY;
//0x40 bytes (sizeof)
typedef struct _NOK_KQUEUE
{
    NOK_DISPATCHER_HEADER Header;                                       //0x0
    NOK_LIST_ENTRY EntryListHead;                                       //0x18
    volatile ULONG CurrentCount;                                            //0x28
    ULONG MaximumCount;                                                     //0x2c
    NOK_LIST_ENTRY ThreadListHead;                                      //0x30
}NOK_KQUEUE, * NOK_PKQUEUE;
//0x10 bytes (sizeof)
typedef struct _NOK_EVENT_DATA_DESCRIPTOR
{
    ULONGLONG Ptr;                                                          //0x0
    ULONG Size;                                                             //0x8
    union
    {
        ULONG Reserved;                                                     //0xc
        struct
        {
            UCHAR Type;                                                     //0xc
            UCHAR Reserved1;                                                //0xd
            USHORT Reserved2;                                               //0xe
        };
    };
}NOK_EVENT_DATA_DESCRIPTOR, * NOK_PEVENT_DATA_DESCRIPTOR;
//0x10 bytes (sizeof)
typedef struct _NOK_EVENT_DESCRIPTOR
{
    USHORT Id;                                                              //0x0
    UCHAR Version;                                                          //0x2
    UCHAR Channel;                                                          //0x3
    UCHAR Level;                                                            //0x4
    UCHAR Opcode;                                                           //0x5
    USHORT Task;                                                            //0x6
    ULONGLONG Keyword;                                                      //0x8
}NOK_EVENT_DESCRIPTOR, * NOK_PEVENT_DESCRIPTOR;
//0x10 bytes (sizeof)
typedef struct _NOK_EVENT_FILTER_DESCRIPTOR
{
    ULONGLONG Ptr;                                                          //0x0
    ULONG Size;                                                             //0x8
    ULONG Type;                                                             //0xc
}NOK_EVENT_FILTER_DESCRIPTOR, * NOK_PEVENT_FILTER_DESCRIPTOR;
//0x18 bytes (sizeof)
typedef struct _NOK_EVENT_FILTER_HEADER
{
    USHORT Id;                                                              //0x0
    UCHAR Version;                                                          //0x2
    UCHAR Reserved[5];                                                      //0x3
    ULONGLONG InstanceId;                                                   //0x8
    ULONG Size;                                                             //0x10
    ULONG NextOffset;                                                       //0x14
}NOK_EVENT_FILTER_HEADER, * NOK_PEVENT_FILTER_HEADER;
//0x18 bytes (sizeof)
typedef struct _NOK_EVENT_FILTER_LEVEL_KW
{
    ULONGLONG MatchAnyKeyword;                                              //0x0
    ULONGLONG MatchAllKeyword;                                              //0x8
    UCHAR Level;                                                            //0x10
    UCHAR FilterIn;                                                         //0x11
}NOK_EVENT_FILTER_LEVEL_KW, * NOK_PEVENT_FILTER_LEVEL_KW;
//0xf0 bytes (sizeof)
typedef struct _NOK_ETW_WMITRACE_WORK
{
    ULONG LoggerId;                                                         //0x0
    ULONG SiloSessionId;                                                    //0x4
    union
    {
        struct
        {
            CHAR LoggerName[65];                                            //0x8
            CHAR FileName[129];                                             //0x49
            ULONG MaximumFileSize;                                          //0xcc
            ULONG MinBuffers;                                               //0xd0
            ULONG MaxBuffers;                                               //0xd4
            ULONG BufferSize;                                               //0xd8
            ULONG Mode;                                                     //0xdc
            ULONG FlushTimer;                                               //0xe0
        };
        struct
        {
            ULONGLONG MatchAny;                                             //0x8
            ULONGLONG MatchAll;                                             //0x10
            ULONG EnableProperty;                                           //0x18
            NOK_GUID Guid;                                              //0x1c
            UCHAR Level;                                                    //0x2c
        };
    };
    LONG Status;                                                            //0xe8
}NOK_ETW_WMITRACE_WORK, * NOK_PETW_WMITRACE_WORK;
//0x50 bytes (sizeof)
typedef struct _NOK_EVENT_HEADER
{
    USHORT Size;                                                            //0x0
    USHORT HeaderType;                                                      //0x2
    USHORT Flags;                                                           //0x4
    USHORT EventProperty;                                                   //0x6
    ULONG ThreadId;                                                         //0x8
    ULONG ProcessId;                                                        //0xc
    NOK_LARGE_INTEGER TimeStamp;                                         //0x10
    NOK_GUID ProviderId;                                                //0x18
    NOK_EVENT_DESCRIPTOR EventDescriptor;                               //0x28
    union
    {
        struct
        {
            ULONG KernelTime;                                               //0x38
            ULONG UserTime;                                                 //0x3c
        };
        ULONGLONG ProcessorTime;                                            //0x38
    };
    NOK_GUID ActivityId;                                                //0x40
}NOK_EVENT_HEADER, * NOK_PEVENT_HEADER;
//0x10 bytes (sizeof)
typedef struct _NOK_ETW_LAST_ENABLE_INFO
{
    NOK_LARGE_INTEGER EnableFlags;                                       //0x0
    USHORT LoggerId;                                                        //0x8
    UCHAR Level;                                                            //0xa
    UCHAR Enabled:1;                                                        //0xb
    UCHAR InternalFlag:7;                                                   //0xb
}NOK_ETW_LAST_ENABLE_INFO, * NOK_PETW_LAST_ENABLE_INFO;
//0x10 bytes (sizeof)
typedef struct _NOK_EVENT_HEADER_EXTENDED_DATA_ITEM
{
    USHORT Reserved1;                                                       //0x0
    USHORT ExtType;                                                         //0x2
    USHORT Linkage:1;                                                       //0x4
    USHORT Reserved2:15;                                                    //0x4
    USHORT DataSize;                                                        //0x6
    ULONGLONG DataPtr;                                                      //0x8
}NOK_EVENT_HEADER_EXTENDED_DATA_ITEM, * NOK_PEVENT_HEADER_EXTENDED_DATA_ITEM;
//0x4 bytes (sizeof)
typedef enum _NOK_SYSTEM_DLL_TYPE
{
    NOK_PsNativeSystemDll = 0,
    NOK_PsWowX86SystemDll = 1,
    NOK_PsWowArm32SystemDll = 2,
    NOK_PsWowAmd64SystemDll = 3,
    NOK_PsWowChpeX86SystemDll = 4,
    NOK_PsVsmEnclaveRuntimeDll = 5,
    NOK_PsSystemDllTotalTypes = 6
}NOK_SYSTEM_DLL_TYPE, * NOK_PSYSTEM_DLL_TYPE;
//0x10 bytes (sizeof)
typedef struct _NOK_EXCEPTION_POINTERS
{
    NOK_PEXCEPTION_RECORD ExceptionRecord;                              //0x0
    NOK_PCONTEXT ContextRecord;                                         //0x8
}NOK_EXCEPTION_POINTERS, * NOK_PEXCEPTION_POINTERS;
//0x98 bytes (sizeof)
typedef struct _NOK_EXCEPTION_RECORD64
{
    LONG ExceptionCode;                                                     //0x0
    ULONG ExceptionFlags;                                                   //0x4
    ULONGLONG ExceptionRecord;                                              //0x8
    ULONGLONG ExceptionAddress;                                             //0x10
    ULONG NumberParameters;                                                 //0x18
    ULONG __unusedAlignment;                                                //0x1c
    ULONGLONG ExceptionInformation[15];                                     //0x20
}NOK_EXCEPTION_RECORD64, * NOK_PEXCEPTION_RECORD64;
//0x54 bytes (sizeof)
typedef struct _NOK_DBGKM_EXCEPTION32
{
    NOK_EXCEPTION_RECORD32 ExceptionRecord;                             //0x0
    ULONG FirstChance;                                                      //0x50
}NOK_DBGKM_EXCEPTION32, * NOK_PDBGKM_EXCEPTION32;
//0xa0 bytes (sizeof)
typedef struct _NOK_DBGKM_EXCEPTION64
{
    NOK_EXCEPTION_RECORD64 ExceptionRecord;                             //0x0
    ULONG FirstChance;                                                      //0x98
}NOK_DBGKM_EXCEPTION64, * NOK_PDBGKM_EXCEPTION64;
//0x4 bytes (sizeof)
typedef enum _NOK_EXCEPTION_DISPOSITION
{
    NOK_ExceptionContinueExecution = 0,
    NOK_ExceptionContinueSearch = 1,
    NOK_ExceptionNestedException = 2,
    NOK_ExceptionCollidedUnwind = 3
}NOK_EXCEPTION_DISPOSITION, * NOK_PEXCEPTION_DISPOSITION;
//0x8 bytes (sizeof)
typedef struct _NOK_EXHANDLE
{
    union
    {
        struct
        {
            ULONG TagBits:2;                                                //0x0
            ULONG Index:30;                                                 //0x0
        };
        VOID* GenericHandleOverlay;                                         //0x0
        ULONGLONG Value;                                                    //0x0
    };
}NOK_EXHANDLE, * NOK_PEXHANDLE;
//0x18 bytes (sizeof)
typedef struct _NOK_EXT_DELETE_PARAMETERS
{
    ULONG Version;                                                          //0x0
    ULONG Reserved;                                                         //0x4
    VOID (*DeleteCallback)(VOID* arg1);                                     //0x8
    VOID* DeleteContext;                                                    //0x10
}NOK_EXT_DELETE_PARAMETERS, * NOK_PEXT_DELETE_PARAMETERS;
//0x4 bytes (sizeof)
typedef enum _NOK_EXT_IOMMU_DEVICE_TYPE
{
    NOK_EXT_IOMMU_DEVICE_TYPE_INVALID = 0,
    NOK_EXT_IOMMU_DEVICE_TYPE_PCI = 1,
    NOK_EXT_IOMMU_DEVICE_TYPE_ACPI = 2,
    NOK_EXT_IOMMU_DEVICE_TYPE_IOAPIC = 3,
    NOK_EXT_IOMMU_DEVICE_TYPE_LOGICAL = 4,
    NOK_EXT_IOMMU_DEVICE_TYPE_GIC = 5,
    NOK_EXT_IOMMU_DEVICE_TYPE_TEST = 6,
    NOK_EXT_IOMMU_DEVICE_TYPE_MAX = 7
}NOK_EXT_IOMMU_DEVICE_TYPE, * NOK_PEXT_IOMMU_DEVICE_TYPE;
//0x8 bytes (sizeof)
typedef struct _NOK_EXT_IOMMU_DEVICE_ID_ACPI
{
    CHAR* ObjectName;                                                       //0x0
}NOK_EXT_IOMMU_DEVICE_ID_ACPI, * NOK_PEXT_IOMMU_DEVICE_ID_ACPI;
//0x4 bytes (sizeof)
typedef struct _NOK_EXT_IOMMU_DEVICE_ID_GIC
{
    ULONG LineNumber;                                                       //0x0
}NOK_EXT_IOMMU_DEVICE_ID_GIC, * NOK_PEXT_IOMMU_DEVICE_ID_GIC;
//0x10 bytes (sizeof)
typedef struct _NOK_EXT_IOMMU_DEVICE_ID_PCI
{
    union
    {
        ULONGLONG AsUINT64;                                                 //0x0
        struct
        {
            USHORT PciSegmentNumber;                                        //0x0
            USHORT PhantomFunctionBits:2;                                   //0x2
            USHORT BusRange:1;                                              //0x2
            USHORT Reserved:5;                                              //0x2
            USHORT StartBusNumber:8;                                        //0x2
            union
            {
                USHORT Bdf;                                                 //0x4
                struct
                {
                    UCHAR SubordinateBus;                                   //0x4
                    UCHAR SecondaryBus;                                     //0x5
                };
            };
            USHORT DevicePathLength;                                        //0x6
        };
    };
    WCHAR* DevicePath;                                                      //0x8
}NOK_EXT_IOMMU_DEVICE_ID_PCI, * NOK_PEXT_IOMMU_DEVICE_ID_PCI;
//0x8 bytes (sizeof)
typedef struct _NOK_EXT_IOMMU_DEVICE_ID_TEST
{
    ULONGLONG UniqueId;                                                     //0x0
}NOK_EXT_IOMMU_DEVICE_ID_TEST, * NOK_PEXT_IOMMU_DEVICE_ID_TEST;
//0x18 bytes (sizeof)
typedef struct _NOK_EXT_IOMMU_DEVICE_ID
{
    NOK_EXT_IOMMU_DEVICE_TYPE DeviceType;                                 //0x0
    union
    {
        NOK_EXT_IOMMU_DEVICE_ID_PCI Pci;                                //0x8
        NOK_EXT_IOMMU_DEVICE_ID_ACPI Acpi;                              //0x8
        UCHAR IoApicId;                                                     //0x8
        ULONGLONG LogicalId;                                                //0x8
        NOK_EXT_IOMMU_DEVICE_ID_TEST Test;                              //0x8
        NOK_EXT_IOMMU_DEVICE_ID_GIC Gic;                                //0x8
    };
}NOK_EXT_IOMMU_DEVICE_ID, * NOK_PEXT_IOMMU_DEVICE_ID;
//0x10 bytes (sizeof)
typedef struct _NOK_EXT_SET_PARAMETERS_V0
{
    ULONG Version;                                                          //0x0
    ULONG Reserved;                                                         //0x4
    LONGLONG NoWakeTolerance;                                               //0x8
}NOK_EXT_SET_PARAMETERS_V0, * NOK_PEXT_SET_PARAMETERS_V0;
//0x38 bytes (sizeof)
typedef struct _NOK_HVP_VIEW_MAP
{
    VOID* SectionReference;                                                 //0x0
    LONGLONG StorageEndFileOffset;                                          //0x8
    LONGLONG SectionEndFileOffset;                                          //0x10
    NOK_PCMSI_PROCESS_TUPLE ProcessTuple;                               //0x18
    ULONG Flags;                                                            //0x20
    NOK_RTL_RB_TREE ViewTree;                                           //0x28
}NOK_HVP_VIEW_MAP, * NOK_PHVP_VIEW_MAP;
//0x20 bytes (sizeof)
typedef struct _NOK_CACHED_KSTACK_LIST
{
    NOK_SLIST_HEADER SListHead;                                          //0x0
    LONG MinimumFree;                                                       //0x10
    ULONG Misses;                                                           //0x14
    ULONG MissesLast;                                                       //0x18
    ULONG AllStacksInUse;                                                   //0x1c
}NOK_CACHED_KSTACK_LIST, * NOK_PCACHED_KSTACK_LIST;
//0x4 bytes (sizeof)
typedef struct _NOK_SEGMENT_FLAGS
{
    union
    {
        struct
        {
            USHORT TotalNumberOfPtes4132:10;                                //0x0
            USHORT Spare0:1;                                                //0x0
            USHORT SessionDriverProtos:1;                                   //0x0
            USHORT LargePages:1;                                            //0x0
            USHORT DebugSymbolsLoaded:1;                                    //0x0
            USHORT WriteCombined:1;                                         //0x0
            USHORT NoCache:1;                                               //0x0
        };
        USHORT Short0;                                                      //0x0
    };
    union
    {
        struct
        {
            UCHAR Spare:1;                                                  //0x2
            UCHAR DefaultProtectionMask:5;                                  //0x2
            UCHAR Binary32:1;                                               //0x2
            UCHAR ContainsDebug:1;                                          //0x2
        };
        UCHAR UChar1;                                                       //0x2
    };
    union
    {
        struct
        {
            UCHAR ForceCollision:1;                                         //0x3
            UCHAR ImageSigningType:3;                                       //0x3
            UCHAR ImageSigningLevel:4;                                      //0x3
        };
        UCHAR UChar2;                                                       //0x3
    };
}NOK_SEGMENT_FLAGS, * NOK_PSEGMENT_FLAGS;
//0x48 bytes (sizeof)
typedef struct _NOK_SEGMENT
{
    NOK_PCONTROL_AREA ControlArea;                                      //0x0
    ULONG TotalNumberOfPtes;                                                //0x8
    NOK_SEGMENT_FLAGS SegmentFlags;                                     //0xc
    ULONGLONG NumberOfCommittedPages;                                       //0x10
    ULONGLONG SizeOfSegment;                                                //0x18
    union
    {
        NOK_PMMEXTEND_INFO ExtendInfo;                                  //0x20
        VOID* BasedAddress;                                                 //0x20
    };
    NOK_EX_PUSH_LOCK SegmentLock;                                       //0x28
    union
    {
        ULONGLONG ImageCommitment;                                          //0x30
        ULONG CreatingProcessId;                                            //0x30
    } u1;                                                                   //0x30
    union
    {
        NOK_PMI_SECTION_IMAGE_INFORMATION ImageInformation;             //0x38
        VOID* FirstMappedVa;                                                //0x38
    } u2;                                                                   //0x38
    NOK_PMMPTE PrototypePte;                                            //0x40
}NOK_SEGMENT, * NOK_PSEGMENT;
//0x20 bytes (sizeof)
typedef struct _NOK_TRACE_ENABLE_INFO
{
    ULONG IsEnabled;                                                        //0x0
    UCHAR Level;                                                            //0x4
    UCHAR Reserved1;                                                        //0x5
    USHORT LoggerId;                                                        //0x6
    ULONG EnableProperty;                                                   //0x8
    ULONG Reserved2;                                                        //0xc
    ULONGLONG MatchAnyKeyword;                                              //0x10
    ULONGLONG MatchAllKeyword;                                              //0x18
}NOK_TRACE_ENABLE_INFO, * NOK_PTRACE_ENABLE_INFO;
//0x8 bytes (sizeof)
typedef union _NOK_RTL_RUN_ONCE
{
    VOID* Ptr;                                                              //0x0
    ULONGLONG Value;                                                        //0x0
    ULONGLONG State:2;                                                      //0x0
}NOK_RTL_RUN_ONCE, * NOK_PRTL_RUN_ONCE;
//0x18 bytes (sizeof)
typedef struct _NOK_EX_RUNDOWN_REF_CACHE_AWARE
{
    NOK_PEX_RUNDOWN_REF RunRefs;                                        //0x0
    VOID* PoolToFree;                                                       //0x8
    ULONG RunRefSize;                                                       //0x10
    ULONG Number;                                                           //0x14
}NOK_EX_RUNDOWN_REF_CACHE_AWARE, * NOK_PEX_RUNDOWN_REF_CACHE_AWARE;
//0x4 bytes (sizeof)
typedef struct _NOK_EX_PUSH_LOCK_AUTO_EXPAND_STATE
{
    union
    {
        struct
        {
            ULONG Expanded:1;                                               //0x0
            ULONG Transitioning:1;                                          //0x0
            ULONG Pageable:1;                                               //0x0
        };
        ULONG Value;                                                        //0x0
    };
}NOK_EX_PUSH_LOCK_AUTO_EXPAND_STATE, * NOK_PEX_PUSH_LOCK_AUTO_EXPAND_STATE;
//0x10 bytes (sizeof)
typedef struct _NOK_EX_PUSH_LOCK_AUTO_EXPAND
{
    NOK_EX_PUSH_LOCK LocalLock;                                         //0x0
    NOK_EX_PUSH_LOCK_AUTO_EXPAND_STATE State;                           //0x8
    ULONG Stats;                                                            //0xc
}NOK_EX_PUSH_LOCK_AUTO_EXPAND, * NOK_PEX_PUSH_LOCK_AUTO_EXPAND;
//0x2b0 bytes (sizeof)
typedef struct _NOK_KPRIQUEUE
{
    NOK_DISPATCHER_HEADER Header;                                       //0x0
    NOK_LIST_ENTRY EntryListHead[32];                                   //0x18
    volatile LONG CurrentCount[32];                                         //0x218
    ULONG MaximumCount;                                                     //0x298
    NOK_LIST_ENTRY ThreadListHead;                                      //0x2a0
}NOK_KPRIQUEUE, * NOK_PKPRIQUEUE;
//0x58 bytes (sizeof)
typedef struct _NOK_ETW_PAYLOAD_FILTER
{
    LONG RefCount;                                                          //0x0
    NOK_AGGREGATED_PAYLOAD_FILTER PayloadFilter;                        //0x8
}NOK_ETW_PAYLOAD_FILTER, * NOK_PETW_PAYLOAD_FILTER;
//0x10 bytes (sizeof)
typedef struct _NOK_TIME_FIELDS
{
    SHORT Year;                                                             //0x0
    SHORT Month;                                                            //0x2
    SHORT Day;                                                              //0x4
    SHORT Hour;                                                             //0x6
    SHORT Minute;                                                           //0x8
    SHORT Second;                                                           //0xa
    SHORT Milliseconds;                                                     //0xc
    SHORT Weekday;                                                          //0xe
}NOK_TIME_FIELDS, * NOK_PTIME_FIELDS;
//0x48 bytes (sizeof)
typedef struct _NOK_WAIT_CONTEXT_BLOCK
{
    union
    {
        NOK_KDEVICE_QUEUE_ENTRY WaitQueueEntry;                         //0x0
        struct
        {
            NOK_LIST_ENTRY DmaWaitEntry;                                //0x0
            ULONG NumberOfChannels;                                         //0x10
            ULONG SyncCallback:1;                                           //0x14
            ULONG DmaContext:1;                                             //0x14
            ULONG ZeroMapRegisters:1;                                       //0x14
            ULONG Reserved:9;                                               //0x14
            ULONG NumberOfRemapPages:20;                                    //0x14
        };
    };
    NOK_IO_ALLOCATION_ACTION (*DeviceRoutine)(NOK_PDEVICE_OBJECT arg1, NOK_PIRP arg2, VOID* arg3, VOID* arg4); //0x18
    VOID* DeviceContext;                                                    //0x20
    ULONG NumberOfMapRegisters;                                             //0x28
    VOID* DeviceObject;                                                     //0x30
    VOID* CurrentIrp;                                                       //0x38
    NOK_PKDPC BufferChainingDpc;                                        //0x40
}NOK_WAIT_CONTEXT_BLOCK, * NOK_PWAIT_CONTEXT_BLOCK;
//0x4 bytes (sizeof)
typedef enum _NOK_EXQUEUEINDEX
{
    NOK_ExPoolUntrusted = 0,
    NOK_IoPoolUntrusted = 1,
    NOK_ExPoolMax = 8
}NOK_EXQUEUEINDEX, * NOK_PEXQUEUEINDEX;
//0x10 bytes (sizeof)
typedef struct _NOK_ETW_REF_CLOCK
{
    NOK_LARGE_INTEGER StartTime;                                         //0x0
    NOK_LARGE_INTEGER StartPerfClock;                                    //0x8
}NOK_ETW_REF_CLOCK, * NOK_PETW_REF_CLOCK;
//0x70 bytes (sizeof)
typedef struct _NOK_EVENT_RECORD
{
    NOK_EVENT_HEADER EventHeader;                                       //0x0
    NOK_ETW_BUFFER_CONTEXT BufferContext;                               //0x50
    USHORT ExtendedDataCount;                                               //0x54
    USHORT UserDataLength;                                                  //0x56
    NOK_EVENT_HEADER_EXTENDED_DATA_ITEM* ExtendedData;                  //0x58
    VOID* UserData;                                                         //0x60
    VOID* UserContext;                                                      //0x68
}NOK_EVENT_RECORD, * NOK_PEVENT_RECORD;
//0x10 bytes (sizeof)
typedef struct _NOK_FAKE_HEAP_ENTRY
{
    ULONGLONG Size;                                                         //0x0
    ULONGLONG PreviousSize;                                                 //0x8
}NOK_FAKE_HEAP_ENTRY, * NOK_PFAKE_HEAP_ENTRY;
//0x68 bytes (sizeof)
typedef struct _NOK_FAST_ERESOURCE
{
    VOID* Reserved1[3];                                                     //0x0
    ULONG Reserved2;                                                        //0x18
    VOID* Reserved3[4];                                                     //0x20
    ULONG Reserved4[4];                                                     //0x40
    VOID* Reserved5;                                                        //0x50
    VOID* Reserved6[2];                                                     //0x58
}NOK_FAST_ERESOURCE, * NOK_PFAST_ERESOURCE;
//0x8 bytes (sizeof)
typedef struct _NOK_KWAIT_CHAIN
{
    VOID* Head;                                                             //0x0
}NOK_KWAIT_CHAIN, * NOK_PKWAIT_CHAIN;
//0xe0 bytes (sizeof)
typedef struct _NOK_FAST_IO_DISPATCH
{
    ULONG SizeOfFastIoDispatch;                                             //0x0
    UCHAR (*FastIoCheckIfPossible)(NOK_PFILE_OBJECT arg1, NOK_PLARGE_INTEGER arg2, ULONG arg3, UCHAR arg4, ULONG arg5, UCHAR arg6, NOK_PIO_STATUS_BLOCK arg7, NOK_PDEVICE_OBJECT arg8); //0x8
    UCHAR (*FastIoRead)(NOK_PFILE_OBJECT arg1, NOK_PLARGE_INTEGER arg2, ULONG arg3, UCHAR arg4, ULONG arg5, VOID* arg6, NOK_PIO_STATUS_BLOCK arg7, NOK_PDEVICE_OBJECT arg8); //0x10
    UCHAR (*FastIoWrite)(NOK_PFILE_OBJECT arg1, NOK_PLARGE_INTEGER arg2, ULONG arg3, UCHAR arg4, ULONG arg5, VOID* arg6, NOK_PIO_STATUS_BLOCK arg7, NOK_PDEVICE_OBJECT arg8); //0x18
    UCHAR (*FastIoQueryBasicInfo)(NOK_PFILE_OBJECT arg1, UCHAR arg2, NOK_PFILE_BASIC_INFORMATION arg3, NOK_PIO_STATUS_BLOCK arg4, NOK_PDEVICE_OBJECT arg5); //0x20
    UCHAR (*FastIoQueryStandardInfo)(NOK_PFILE_OBJECT arg1, UCHAR arg2, NOK_PFILE_STANDARD_INFORMATION arg3, NOK_PIO_STATUS_BLOCK arg4, NOK_PDEVICE_OBJECT arg5); //0x28
    UCHAR (*FastIoLock)(NOK_PFILE_OBJECT arg1, NOK_PLARGE_INTEGER arg2, NOK_PLARGE_INTEGER arg3, NOK_PKPROCESS arg4, ULONG arg5, UCHAR arg6, UCHAR arg7, NOK_PIO_STATUS_BLOCK arg8, NOK_PDEVICE_OBJECT arg9); //0x30
    UCHAR (*FastIoUnlockSingle)(NOK_PFILE_OBJECT arg1, NOK_PLARGE_INTEGER arg2, NOK_PLARGE_INTEGER arg3, NOK_PKPROCESS arg4, ULONG arg5, NOK_PIO_STATUS_BLOCK arg6, NOK_PDEVICE_OBJECT arg7); //0x38
    UCHAR (*FastIoUnlockAll)(NOK_PFILE_OBJECT arg1, NOK_PKPROCESS arg2, NOK_PIO_STATUS_BLOCK arg3, NOK_PDEVICE_OBJECT arg4); //0x40
    UCHAR (*FastIoUnlockAllByKey)(NOK_PFILE_OBJECT arg1, VOID* arg2, ULONG arg3, NOK_PIO_STATUS_BLOCK arg4, NOK_PDEVICE_OBJECT arg5); //0x48
    UCHAR (*FastIoDeviceControl)(NOK_PFILE_OBJECT arg1, UCHAR arg2, VOID* arg3, ULONG arg4, VOID* arg5, ULONG arg6, ULONG arg7, NOK_PIO_STATUS_BLOCK arg8, NOK_PDEVICE_OBJECT arg9); //0x50
    VOID (*AcquireFileForNtCreateSection)(NOK_PFILE_OBJECT arg1);       //0x58
    VOID (*ReleaseFileForNtCreateSection)(NOK_PFILE_OBJECT arg1);       //0x60
    VOID (*FastIoDetachDevice)(NOK_PDEVICE_OBJECT arg1, NOK_PDEVICE_OBJECT arg2); //0x68
    UCHAR (*FastIoQueryNetworkOpenInfo)(NOK_PFILE_OBJECT arg1, UCHAR arg2, NOK_PFILE_NETWORK_OPEN_INFORMATION arg3, NOK_PIO_STATUS_BLOCK arg4, NOK_PDEVICE_OBJECT arg5); //0x70
    LONG (*AcquireForModWrite)(NOK_PFILE_OBJECT arg1, NOK_PLARGE_INTEGER arg2, NOK_PERESOURCE* arg3, NOK_PDEVICE_OBJECT arg4); //0x78
    UCHAR (*MdlRead)(NOK_PFILE_OBJECT arg1, NOK_PLARGE_INTEGER arg2, ULONG arg3, ULONG arg4, NOK_PMDL* arg5, NOK_PIO_STATUS_BLOCK arg6, NOK_PDEVICE_OBJECT arg7); //0x80
    UCHAR (*MdlReadComplete)(NOK_PFILE_OBJECT arg1, NOK_PMDL arg2, NOK_PDEVICE_OBJECT arg3); //0x88
    UCHAR (*PrepareMdlWrite)(NOK_PFILE_OBJECT arg1, NOK_PLARGE_INTEGER arg2, ULONG arg3, ULONG arg4, NOK_PMDL* arg5, NOK_PIO_STATUS_BLOCK arg6, NOK_PDEVICE_OBJECT arg7); //0x90
    UCHAR (*MdlWriteComplete)(NOK_PFILE_OBJECT arg1, NOK_PLARGE_INTEGER arg2, NOK_PMDL arg3, NOK_PDEVICE_OBJECT arg4); //0x98
    UCHAR (*FastIoReadCompressed)(NOK_PFILE_OBJECT arg1, NOK_PLARGE_INTEGER arg2, ULONG arg3, ULONG arg4, VOID* arg5, NOK_PMDL* arg6, NOK_PIO_STATUS_BLOCK arg7, NOK_PCOMPRESSED_DATA_INFO arg8, ULONG arg9, NOK_PDEVICE_OBJECT arg10); //0xa0
    UCHAR (*FastIoWriteCompressed)(NOK_PFILE_OBJECT arg1, NOK_PLARGE_INTEGER arg2, ULONG arg3, ULONG arg4, VOID* arg5, NOK_PMDL* arg6, NOK_PIO_STATUS_BLOCK arg7, NOK_PCOMPRESSED_DATA_INFO arg8, ULONG arg9, NOK_PDEVICE_OBJECT arg10); //0xa8
    UCHAR (*MdlReadCompleteCompressed)(NOK_PFILE_OBJECT arg1, NOK_PMDL arg2, NOK_PDEVICE_OBJECT arg3); //0xb0
    UCHAR (*MdlWriteCompleteCompressed)(NOK_PFILE_OBJECT arg1, NOK_PLARGE_INTEGER arg2, NOK_PMDL arg3, NOK_PDEVICE_OBJECT arg4); //0xb8
    UCHAR (*FastIoQueryOpen)(NOK_PIRP arg1, NOK_PFILE_NETWORK_OPEN_INFORMATION arg2, NOK_PDEVICE_OBJECT arg3); //0xc0
    LONG (*ReleaseForModWrite)(NOK_PFILE_OBJECT arg1, NOK_PERESOURCE arg2, NOK_PDEVICE_OBJECT arg3); //0xc8
    LONG (*AcquireForCcFlush)(NOK_PFILE_OBJECT arg1, NOK_PDEVICE_OBJECT arg2); //0xd0
    LONG (*ReleaseForCcFlush)(NOK_PFILE_OBJECT arg1, NOK_PDEVICE_OBJECT arg2); //0xd8
}NOK_FAST_IO_DISPATCH, * NOK_PFAST_IO_DISPATCH;
//0x8 bytes (sizeof)
typedef union _NOK_ULARGE_INTEGER
{
    struct
    {
        ULONG LowPart;                                                      //0x0
        ULONG HighPart;                                                     //0x4
    };
    struct
    {
        ULONG LowPart;                                                      //0x0
        ULONG HighPart;                                                     //0x4
    } u;                                                                    //0x0
    ULONGLONG QuadPart;                                                     //0x0
}NOK_ULARGE_INTEGER, * NOK_PULARGE_INTEGER;
//0x48 bytes (sizeof)
typedef struct _NOK_FAST_OWNER_ENTRY
{
    VOID* Reserved[9];                                                      //0x0
}NOK_FAST_OWNER_ENTRY, * NOK_PFAST_OWNER_ENTRY;
//0x40 bytes (sizeof)
typedef struct _NOK_KTIMER
{
    NOK_DISPATCHER_HEADER Header;                                       //0x0
    NOK_ULARGE_INTEGER DueTime;                                          //0x18
    NOK_LIST_ENTRY TimerListEntry;                                      //0x20
    NOK_PKDPC Dpc;                                                      //0x30
    USHORT Processor;                                                       //0x38
    USHORT TimerType;                                                       //0x3a
    ULONG Period;                                                           //0x3c
}NOK_KTIMER, * NOK_PKTIMER;
//0x4 bytes (sizeof)
typedef enum _NOK_FAULT_INFORMATION_ARCH
{
    NOK_FaultInformationInvalid = 0,
    NOK_FaultInformationArm64 = 1,
    NOK_FaultInformationX64 = 2
}NOK_FAULT_INFORMATION_ARCH, * NOK_PFAULT_INFORMATION_ARCH;
//0x4 bytes (sizeof)
typedef struct _NOK_FAULT_INFORMATION_ARM64_FLAGS
{
    ULONG WriteNotRead:1;                                                   //0x0
    ULONG InstructionNotData:1;                                             //0x0
    ULONG Privileged:1;                                                     //0x0
    ULONG FaultAddressValid:1;                                              //0x0
    ULONG Reserved:28;                                                      //0x0
}NOK_FAULT_INFORMATION_ARM64_FLAGS, * NOK_PFAULT_INFORMATION_ARM64_FLAGS;
//0x30 bytes (sizeof)
typedef struct _NOK_FAULT_INFORMATION_ARM64
{
    VOID* DomainHandle;                                                     //0x0
    VOID* FaultAddress;                                                     //0x8
    NOK_PDEVICE_OBJECT PhysicalDeviceObject;                            //0x10
    ULONG InputMappingId;                                                   //0x18
    NOK_FAULT_INFORMATION_ARM64_FLAGS Flags;                            //0x1c
    NOK_FAULT_INFORMATION_ARM64_TYPE Type;                                //0x20
    ULONGLONG IommuBaseAddress;                                             //0x28
}NOK_FAULT_INFORMATION_ARM64, * NOK_PFAULT_INFORMATION_ARM64;
//0x4 bytes (sizeof)
typedef struct _NOK_FAULT_INFORMATION_X64_FLAGS
{
    ULONG FaultAddressValid:1;                                              //0x0
    ULONG Reserved:31;                                                      //0x0
}NOK_FAULT_INFORMATION_X64_FLAGS, * NOK_PFAULT_INFORMATION_X64_FLAGS;
//0x28 bytes (sizeof)
typedef struct _NOK_FAULT_INFORMATION_X64
{
    VOID* DomainHandle;                                                     //0x0
    VOID* FaultAddress;                                                     //0x8
    NOK_FAULT_INFORMATION_X64_FLAGS Flags;                              //0x10
    NOK_FAULT_INFORMATION_ARM64_TYPE Type;                                //0x14
    ULONGLONG IommuBaseAddress;                                             //0x18
    ULONG PciSegment;                                                       //0x20
}NOK_FAULT_INFORMATION_X64, * NOK_PFAULT_INFORMATION_X64;
//0x38 bytes (sizeof)
typedef struct _NOK_FAULT_INFORMATION
{
    NOK_FAULT_INFORMATION_ARCH Type;                                      //0x0
    UCHAR IsStage1;                                                         //0x4
    union
    {
        NOK_FAULT_INFORMATION_ARM64 Arm64;                              //0x8
        NOK_FAULT_INFORMATION_X64 X64;                                  //0x8
    };
}NOK_FAULT_INFORMATION, * NOK_PFAULT_INFORMATION;
//0x10 bytes (sizeof)
typedef struct _NOK_FILESYSTEM_DISK_COUNTERS
{
    ULONGLONG FsBytesRead;                                                  //0x0
    ULONGLONG FsBytesWritten;                                               //0x8
}NOK_FILESYSTEM_DISK_COUNTERS, * NOK_PFILESYSTEM_DISK_COUNTERS;
//0x40 bytes (sizeof)
typedef struct _NOK_FACS
{
    ULONG Signature;                                                        //0x0
    ULONG Length;                                                           //0x4
    ULONG HardwareSignature;                                                //0x8
    ULONG pFirmwareWakingVector;                                            //0xc
    ULONG GlobalLock;                                                       //0x10
    ULONG Flags;                                                            //0x14
    NOK_LARGE_INTEGER x_FirmwareWakingVector;                            //0x18
    UCHAR version;                                                          //0x20
    UCHAR Reserved[31];                                                     //0x21
}NOK_FACS, * NOK_PFACS;
//0xc bytes (sizeof)
typedef struct _NOK_GEN_ADDR
{
    UCHAR AddressSpaceID;                                                   //0x0
    UCHAR BitWidth;                                                         //0x1
    UCHAR BitOffset;                                                        //0x2
    UCHAR AccessSize;                                                       //0x3
    NOK_LARGE_INTEGER Address;                                           //0x4
}NOK_GEN_ADDR, * NOK_PGEN_ADDR;
//0x38 bytes (sizeof)
typedef struct _NOK_FAST_MUTEX
{
    LONG Count;                                                             //0x0
    VOID* Owner;                                                            //0x8
    ULONG Contention;                                                       //0x10
    NOK_KEVENT Event;                                                   //0x18
    ULONG OldIrql;                                                          //0x30
}NOK_FAST_MUTEX, * NOK_PFAST_MUTEX;
//0x28 bytes (sizeof)
typedef struct _NOK_FILE_BASIC_INFORMATION
{
    NOK_LARGE_INTEGER CreationTime;                                      //0x0
    NOK_LARGE_INTEGER LastAccessTime;                                    //0x8
    NOK_LARGE_INTEGER LastWriteTime;                                     //0x10
    NOK_LARGE_INTEGER ChangeTime;                                        //0x18
    ULONG FileAttributes;                                                   //0x20
}NOK_FILE_BASIC_INFORMATION, * NOK_PFILE_BASIC_INFORMATION;
//0x4 bytes (sizeof)
typedef struct _NOK_PCAT_FIRMWARE_INFORMATION
{
    ULONG PlaceHolder;                                                      //0x0
}NOK_PCAT_FIRMWARE_INFORMATION, * NOK_PPCAT_FIRMWARE_INFORMATION;
//0x48 bytes (sizeof)
typedef struct _NOK_FAST_OWNER_ENTRY_INTERNAL
{
    NOK_LIST_ENTRY ListEntry;                                           //0x0
    UCHAR AbLockHandle;                                                     //0x10
    UCHAR Disowned:1;                                                       //0x11
    UCHAR DynamicallyAllocated:1;                                           //0x11
    UCHAR CallerExclusive:1;                                                //0x11
    UCHAR IsSublistHead;                                                    //0x12
    UCHAR IsWaiting;                                                        //0x13
    VOID* LockAddress;                                                      //0x18
    VOID* ThreadAddress;                                                    //0x20
    NOK_LIST_ENTRY SublistHead;                                         //0x28
    NOK_LIST_ENTRY LockListEntry;                                       //0x38
}NOK_FAST_OWNER_ENTRY_INTERNAL, * NOK_PFAST_OWNER_ENTRY_INTERNAL;
//0x278 bytes (sizeof)
typedef struct _NOK_DUAL
{
    ULONG Length;                                                           //0x0
    NOK_PHMAP_DIRECTORY Map;                                            //0x8
    NOK_PHMAP_TABLE SmallDir;                                           //0x10
    ULONG Guard;                                                            //0x18
    NOK_FREE_DISPLAY FreeDisplay[24];                                   //0x20
    NOK_LIST_ENTRY FreeBins;                                            //0x260
    ULONG FreeSummary;                                                      //0x270
}NOK_DUAL, * NOK_PDUAL;
//0x78 bytes (sizeof)
typedef struct _NOK_FS_FILTER_CALLBACKS
{
    ULONG SizeOfFsFilterCallbacks;                                          //0x0
    ULONG Reserved;                                                         //0x4
    LONG (*PreAcquireForSectionSynchronization)(NOK_PFS_FILTER_CALLBACK_DATA arg1, VOID** arg2); //0x8
    VOID (*PostAcquireForSectionSynchronization)(NOK_PFS_FILTER_CALLBACK_DATA arg1, LONG arg2, VOID* arg3); //0x10
    LONG (*PreReleaseForSectionSynchronization)(NOK_PFS_FILTER_CALLBACK_DATA arg1, VOID** arg2); //0x18
    VOID (*PostReleaseForSectionSynchronization)(NOK_PFS_FILTER_CALLBACK_DATA arg1, LONG arg2, VOID* arg3); //0x20
    LONG (*PreAcquireForCcFlush)(NOK_PFS_FILTER_CALLBACK_DATA arg1, VOID** arg2); //0x28
    VOID (*PostAcquireForCcFlush)(NOK_PFS_FILTER_CALLBACK_DATA arg1, LONG arg2, VOID* arg3); //0x30
    LONG (*PreReleaseForCcFlush)(NOK_PFS_FILTER_CALLBACK_DATA arg1, VOID** arg2); //0x38
    VOID (*PostReleaseForCcFlush)(NOK_PFS_FILTER_CALLBACK_DATA arg1, LONG arg2, VOID* arg3); //0x40
    LONG (*PreAcquireForModifiedPageWriter)(NOK_PFS_FILTER_CALLBACK_DATA arg1, VOID** arg2); //0x48
    VOID (*PostAcquireForModifiedPageWriter)(NOK_PFS_FILTER_CALLBACK_DATA arg1, LONG arg2, VOID* arg3); //0x50
    LONG (*PreReleaseForModifiedPageWriter)(NOK_PFS_FILTER_CALLBACK_DATA arg1, VOID** arg2); //0x58
    VOID (*PostReleaseForModifiedPageWriter)(NOK_PFS_FILTER_CALLBACK_DATA arg1, LONG arg2, VOID* arg3); //0x60
    LONG (*PreQueryOpen)(NOK_PFS_FILTER_CALLBACK_DATA arg1, VOID** arg2); //0x68
    VOID (*PostQueryOpen)(NOK_PFS_FILTER_CALLBACK_DATA arg1, LONG arg2, VOID* arg3); //0x70
}NOK_FS_FILTER_CALLBACKS, * NOK_PFS_FILTER_CALLBACKS;
//0x4 bytes (sizeof)
typedef enum _NOK_FILE_INFORMATION_CLASS
{
    NOK_FileDirectoryInformation = 1,
    NOK_FileFullDirectoryInformation = 2,
    NOK_FileBothDirectoryInformation = 3,
    NOK_FileBasicInformation = 4,
    NOK_FileStandardInformation = 5,
    NOK_FileInternalInformation = 6,
    NOK_FileEaInformation = 7,
    NOK_FileAccessInformation = 8,
    NOK_FileNameInformation = 9,
    NOK_FileRenameInformation = 10,
    NOK_FileLinkInformation = 11,
    NOK_FileNamesInformation = 12,
    NOK_FileDispositionInformation = 13,
    NOK_FilePositionInformation = 14,
    NOK_FileFullEaInformation = 15,
    NOK_FileModeInformation = 16,
    NOK_FileAlignmentInformation = 17,
    NOK_FileAllInformation = 18,
    NOK_FileAllocationInformation = 19,
    NOK_FileEndOfFileInformation = 20,
    NOK_FileAlternateNameInformation = 21,
    NOK_FileStreamInformation = 22,
    NOK_FilePipeInformation = 23,
    NOK_FilePipeLocalInformation = 24,
    NOK_FilePipeRemoteInformation = 25,
    NOK_FileMailslotQueryInformation = 26,
    NOK_FileMailslotSetInformation = 27,
    NOK_FileCompressionInformation = 28,
    NOK_FileObjectIdInformation = 29,
    NOK_FileCompletionInformation = 30,
    NOK_FileMoveClusterInformation = 31,
    NOK_FileQuotaInformation = 32,
    NOK_FileReparsePointInformation = 33,
    NOK_FileNetworkOpenInformation = 34,
    NOK_FileAttributeTagInformation = 35,
    NOK_FileTrackingInformation = 36,
    NOK_FileIdBothDirectoryInformation = 37,
    NOK_FileIdFullDirectoryInformation = 38,
    NOK_FileValidDataLengthInformation = 39,
    NOK_FileShortNameInformation = 40,
    NOK_FileIoCompletionNotificationInformation = 41,
    NOK_FileIoStatusBlockRangeInformation = 42,
    NOK_FileIoPriorityHintInformation = 43,
    NOK_FileSfioReserveInformation = 44,
    NOK_FileSfioVolumeInformation = 45,
    NOK_FileHardLinkInformation = 46,
    NOK_FileProcessIdsUsingFileInformation = 47,
    NOK_FileNormalizedNameInformation = 48,
    NOK_FileNetworkPhysicalNameInformation = 49,
    NOK_FileIdGlobalTxDirectoryInformation = 50,
    NOK_FileIsRemoteDeviceInformation = 51,
    NOK_FileUnusedInformation = 52,
    NOK_FileNumaNodeInformation = 53,
    NOK_FileStandardLinkInformation = 54,
    NOK_FileRemoteProtocolInformation = 55,
    NOK_FileRenameInformationBypassAccessCheck = 56,
    NOK_FileLinkInformationBypassAccessCheck = 57,
    NOK_FileVolumeNameInformation = 58,
    NOK_FileIdInformation = 59,
    NOK_FileIdExtdDirectoryInformation = 60,
    NOK_FileReplaceCompletionInformation = 61,
    NOK_FileHardLinkFullIdInformation = 62,
    NOK_FileIdExtdBothDirectoryInformation = 63,
    NOK_FileDispositionInformationEx = 64,
    NOK_FileRenameInformationEx = 65,
    NOK_FileRenameInformationExBypassAccessCheck = 66,
    NOK_FileDesiredStorageClassInformation = 67,
    NOK_FileStatInformation = 68,
    NOK_FileMemoryPartitionInformation = 69,
    NOK_FileStatLxInformation = 70,
    NOK_FileCaseSensitiveInformation = 71,
    NOK_FileLinkInformationEx = 72,
    NOK_FileLinkInformationExBypassAccessCheck = 73,
    NOK_FileStorageReserveIdInformation = 74,
    NOK_FileCaseSensitiveInformationForceAccessCheck = 75,
    NOK_FileMaximumInformation = 76
}NOK_FILE_INFORMATION_CLASS, * NOK_PFILE_INFORMATION_CLASS;
//0x10 bytes (sizeof)
typedef struct _NOK_FS_FILTER_SECTION_SYNC_OUTPUT
{
    ULONG StructureSize;                                                    //0x0
    ULONG SizeReturned;                                                     //0x4
    ULONG Flags;                                                            //0x8
    ULONG DesiredReadAlignment;                                             //0xc
}NOK_FS_FILTER_SECTION_SYNC_OUTPUT, * NOK_PFS_FILTER_SECTION_SYNC_OUTPUT;
//0x4e8 bytes (sizeof)
typedef struct _NOK_GDI_TEB_BATCH
{
    ULONG Offset:31;                                                        //0x0
    ULONG HasRenderingCommand:1;                                            //0x0
    ULONGLONG HDC;                                                          //0x8
    ULONG Buffer[310];                                                      //0x10
}NOK_GDI_TEB_BATCH, * NOK_PGDI_TEB_BATCH;
//0x4e0 bytes (sizeof)
typedef struct _NOK_GDI_TEB_BATCH32
{
    ULONG Offset:31;                                                        //0x0
    ULONG HasRenderingCommand:1;                                            //0x0
    ULONG HDC;                                                              //0x4
    ULONG Buffer[310];                                                      //0x8
}NOK_GDI_TEB_BATCH32, * NOK_PGDI_TEB_BATCH32;
//0x4e8 bytes (sizeof)
typedef struct _NOK_GDI_TEB_BATCH64
{
    ULONG Offset:31;                                                        //0x0
    ULONG HasRenderingCommand:1;                                            //0x0
    ULONGLONG HDC;                                                          //0x8
    ULONG Buffer[310];                                                      //0x10
}NOK_GDI_TEB_BATCH64, * NOK_PGDI_TEB_BATCH64;
//0x38 bytes (sizeof)
typedef struct _NOK_FILE_NETWORK_OPEN_INFORMATION
{
    NOK_LARGE_INTEGER CreationTime;                                      //0x0
    NOK_LARGE_INTEGER LastAccessTime;                                    //0x8
    NOK_LARGE_INTEGER LastWriteTime;                                     //0x10
    NOK_LARGE_INTEGER ChangeTime;                                        //0x18
    NOK_LARGE_INTEGER AllocationSize;                                    //0x20
    NOK_LARGE_INTEGER EndOfFile;                                         //0x28
    ULONG FileAttributes;                                                   //0x30
}NOK_FILE_NETWORK_OPEN_INFORMATION, * NOK_PFILE_NETWORK_OPEN_INFORMATION;
//0x4 bytes (sizeof)
typedef union _NOK_KSTACK_COUNT
{
    LONG Value;                                                             //0x0
    ULONG State:3;                                                          //0x0
    ULONG StackCount:29;                                                    //0x0
}NOK_KSTACK_COUNT, * NOK_PKSTACK_COUNT;
//0x438 bytes (sizeof)
typedef struct _NOK_KPROCESS
{
    NOK_DISPATCHER_HEADER Header;                                       //0x0
    NOK_LIST_ENTRY ProfileListHead;                                     //0x18
    ULONGLONG DirectoryTableBase;                                           //0x28
    NOK_LIST_ENTRY ThreadListHead;                                      //0x30
    ULONG ProcessLock;                                                      //0x40
    ULONG ProcessTimerDelay;                                                //0x44
    ULONGLONG DeepFreezeStartTime;                                          //0x48
    NOK_KAFFINITY_EX Affinity;                                          //0x50
    ULONGLONG AffinityPadding[12];                                          //0xf8
    NOK_LIST_ENTRY ReadyListHead;                                       //0x158
    NOK_SINGLE_LIST_ENTRY SwapListEntry;                                //0x168
    volatile NOK_KAFFINITY_EX ActiveProcessors;                         //0x170
    ULONGLONG ActiveProcessorsPadding[12];                                  //0x218
    union
    {
        struct
        {
            ULONG AutoAlignment:1;                                          //0x278
            ULONG DisableBoost:1;                                           //0x278
            ULONG DisableQuantum:1;                                         //0x278
            ULONG DeepFreeze:1;                                             //0x278
            ULONG TimerVirtualization:1;                                    //0x278
            ULONG CheckStackExtents:1;                                      //0x278
            ULONG CacheIsolationEnabled:1;                                  //0x278
            ULONG PpmPolicy:3;                                              //0x278
            ULONG VaSpaceDeleted:1;                                         //0x278
            ULONG ReservedFlags:21;                                         //0x278
        };
        volatile LONG ProcessFlags;                                         //0x278
    };
    ULONG ActiveGroupsMask;                                                 //0x27c
    CHAR BasePriority;                                                      //0x280
    CHAR QuantumReset;                                                      //0x281
    CHAR Visited;                                                           //0x282
    NOK_KEXECUTE_OPTIONS Flags;                                          //0x283
    USHORT ThreadSeed[20];                                                  //0x284
    USHORT ThreadSeedPadding[12];                                           //0x2ac
    USHORT IdealProcessor[20];                                              //0x2c4
    USHORT IdealProcessorPadding[12];                                       //0x2ec
    USHORT IdealNode[20];                                                   //0x304
    USHORT IdealNodePadding[12];                                            //0x32c
    USHORT IdealGlobalNode;                                                 //0x344
    USHORT Spare1;                                                          //0x346
    volatile NOK_KSTACK_COUNT StackCount;                                 //0x348
    NOK_LIST_ENTRY ProcessListEntry;                                    //0x350
    ULONGLONG CycleTime;                                                    //0x360
    ULONGLONG ContextSwitches;                                              //0x368
    NOK_PKSCHEDULING_GROUP SchedulingGroup;                             //0x370
    ULONG FreezeCount;                                                      //0x378
    ULONG KernelTime;                                                       //0x37c
    ULONG UserTime;                                                         //0x380
    ULONG ReadyTime;                                                        //0x384
    ULONGLONG UserDirectoryTableBase;                                       //0x388
    UCHAR AddressPolicy;                                                    //0x390
    UCHAR Spare2[71];                                                       //0x391
    VOID* InstrumentationCallback;                                          //0x3d8
    union
    {
        ULONGLONG SecureHandle;                                             //0x3e0
        struct
        {
            ULONGLONG SecureProcess:1;                                      //0x3e0
            ULONGLONG Unused:1;                                             //0x3e0
        } Flags;                                                            //0x3e0
    } SecureState;                                                          //0x3e0
    ULONGLONG KernelWaitTime;                                               //0x3e8
    ULONGLONG UserWaitTime;                                                 //0x3f0
    ULONGLONG EndPadding[8];                                                //0x3f8
}NOK_KPROCESS, * NOK_PKPROCESS;
//0x4 bytes (sizeof)
typedef enum _NOK_POOL_TYPE
{
    NOK_NonPagedPool = 0,
    NOK_NonPagedPoolExecute = 0,
    NOK_PagedPool = 1,
    NOK_NonPagedPoolMustSucceed = 2,
    NOK_DontUseThisType = 3,
    NOK_NonPagedPoolCacheAligned = 4,
    NOK_PagedPoolCacheAligned = 5,
    NOK_NonPagedPoolCacheAlignedMustS = 6,
    NOK_MaxPoolType = 7,
    NOK_NonPagedPoolBase = 0,
    NOK_NonPagedPoolBaseMustSucceed = 2,
    NOK_NonPagedPoolBaseCacheAligned = 4,
    NOK_NonPagedPoolBaseCacheAlignedMustS = 6,
    NOK_NonPagedPoolSession = 32,
    NOK_PagedPoolSession = 33,
    NOK_NonPagedPoolMustSucceedSession = 34,
    NOK_DontUseThisTypeSession = 35,
    NOK_NonPagedPoolCacheAlignedSession = 36,
    NOK_PagedPoolCacheAlignedSession = 37,
    NOK_NonPagedPoolCacheAlignedMustSSession = 38,
    NOK_NonPagedPoolNx = 512,
    NOK_NonPagedPoolNxCacheAligned = 516,
    NOK_NonPagedPoolSessionNx = 544
}NOK_POOL_TYPE, * NOK_PPOOL_TYPE;
//0x18 bytes (sizeof)
typedef struct _NOK_FILE_STANDARD_INFORMATION
{
    NOK_LARGE_INTEGER AllocationSize;                                    //0x0
    NOK_LARGE_INTEGER EndOfFile;                                         //0x8
    ULONG NumberOfLinks;                                                    //0x10
    UCHAR DeletePending;                                                    //0x14
    UCHAR Directory;                                                        //0x15
}NOK_FILE_STANDARD_INFORMATION, * NOK_PFILE_STANDARD_INFORMATION;
//0x10 bytes (sizeof)
typedef struct _NOK_GROUP_AFFINITY
{
    ULONGLONG Mask;                                                         //0x0
    USHORT Group;                                                           //0x8
    USHORT Reserved[3];                                                     //0xa
}NOK_GROUP_AFFINITY, * NOK_PGROUP_AFFINITY;
//0xe0 bytes (sizeof)
typedef struct _NOK_AUX_ACCESS_DATA
{
    NOK_PPRIVILEGE_SET PrivilegesUsed;                                  //0x0
    NOK_GENERIC_MAPPING GenericMapping;                                 //0x8
    ULONG AccessesToAudit;                                                  //0x18
    ULONG MaximumAuditMask;                                                 //0x1c
    NOK_GUID TransactionId;                                             //0x20
    VOID* NewSecurityDescriptor;                                            //0x30
    VOID* ExistingSecurityDescriptor;                                       //0x38
    VOID* ParentSecurityDescriptor;                                         //0x40
    VOID (*DeRefSecurityDescriptor)(VOID* arg1, VOID* arg2);                //0x48
    VOID* SDLock;                                                           //0x50
    NOK_ACCESS_REASONS AccessReasons;                                   //0x58
    UCHAR GenerateStagingEvents;                                            //0xd8
}NOK_AUX_ACCESS_DATA, * NOK_PAUX_ACCESS_DATA;
//0x38 bytes (sizeof)
typedef struct _NOK_KMUTANT
{
    NOK_DISPATCHER_HEADER Header;                                       //0x0
    NOK_LIST_ENTRY MutantListEntry;                                     //0x18
    NOK_PKTHREAD OwnerThread;                                           //0x28
    union
    {
        UCHAR MutantFlags;                                                  //0x30
        struct
        {
            UCHAR Abandoned:1;                                              //0x30
            UCHAR Spare1:7;                                                 //0x30
            UCHAR Abandoned2:1;                                             //0x30
            UCHAR AbEnabled:1;                                              //0x30
            UCHAR Spare2:6;                                                 //0x30
        };
    };
    UCHAR ApcDisable;                                                       //0x31
}NOK_KMUTANT, * NOK_PKMUTANT;
//0x18 bytes (sizeof)
typedef struct _NOK_HALP_ALLOC_CONTEXT
{
    NOK_LIST_ENTRY BufferList;                                          //0x0
    ULONGLONG Lock;                                                         //0x10
}NOK_HALP_ALLOC_CONTEXT, * NOK_PHALP_ALLOC_CONTEXT;
//0x68 bytes (sizeof)
typedef struct _NOK_FSRTL_ADVANCED_FCB_HEADER
{
    SHORT NodeTypeCode;                                                     //0x0
    SHORT NodeByteSize;                                                     //0x2
    UCHAR Flags;                                                            //0x4
    UCHAR IsFastIoPossible;                                                 //0x5
    UCHAR Flags2;                                                           //0x6
    UCHAR Reserved:4;                                                       //0x7
    UCHAR Version:4;                                                        //0x7
    NOK_PERESOURCE Resource;                                            //0x8
    NOK_PERESOURCE PagingIoResource;                                    //0x10
    NOK_LARGE_INTEGER AllocationSize;                                    //0x18
    NOK_LARGE_INTEGER FileSize;                                          //0x20
    NOK_LARGE_INTEGER ValidDataLength;                                   //0x28
    NOK_PFAST_MUTEX FastMutex;                                          //0x30
    NOK_LIST_ENTRY FilterContexts;                                      //0x38
    NOK_EX_PUSH_LOCK PushLock;                                          //0x48
    VOID** FileContextSupportPointer;                                       //0x50
    union
    {
        VOID* Oplock;                                                       //0x58
        VOID* ReservedForRemote;                                            //0x58
    };
    VOID* ReservedContext;                                                  //0x60
}NOK_FSRTL_ADVANCED_FCB_HEADER, * NOK_PFSRTL_ADVANCED_FCB_HEADER;
//0x4 bytes (sizeof)
typedef enum _NOK_WHEA_ERROR_SEVERITY
{
    NOK_WheaErrSevRecoverable = 0,
    NOK_WheaErrSevFatal = 1,
    NOK_WheaErrSevCorrected = 2,
    NOK_WheaErrSevInformational = 3
}NOK_WHEA_ERROR_SEVERITY, * NOK_PWHEA_ERROR_SEVERITY;
//0x4 bytes (sizeof)
typedef enum _NOK_HALP_EMERGENCY_LA_QUEUE_TYPE
{
    NOK_HalpDmaLegacyLaQueueEntry = 0,
    NOK_HalpDmaThinLaQueueEntry = 1,
    NOK_HalpDmaLaQueueEntryMax = 2
}NOK_HALP_EMERGENCY_LA_QUEUE_TYPE, * NOK_PHALP_EMERGENCY_LA_QUEUE_TYPE;
//0x20 bytes (sizeof)
typedef struct _NOK_ETW_PRIV_HANDLE_DEMUX_TABLE
{
    NOK_RTL_RB_TREE Tree;                                               //0x0
    NOK_EX_PUSH_LOCK Lock;                                              //0x10
    USHORT SequenceNumber;                                                  //0x18
}NOK_ETW_PRIV_HANDLE_DEMUX_TABLE, * NOK_PETW_PRIV_HANDLE_DEMUX_TABLE;
//0x10 bytes (sizeof)
typedef struct _NOK_HALP_DMA_TRANSLATION_BUFFER_POSITION
{
    NOK_PHALP_DMA_TRANSLATION_BUFFER Buffer;                            //0x0
    ULONG Offset;                                                           //0x8
}NOK_HALP_DMA_TRANSLATION_BUFFER_POSITION, * NOK_PHALP_DMA_TRANSLATION_BUFFER_POSITION;
//0x10c bytes (sizeof)
typedef struct _NOK_FADT
{
    NOK_DESCRIPTION_HEADER Header;                                      //0x0
    ULONG facs;                                                             //0x24
    ULONG dsdt;                                                             //0x28
    UCHAR int_model;                                                        //0x2c
    UCHAR pm_profile;                                                       //0x2d
    USHORT sci_int_vector;                                                  //0x2e
    ULONG smi_cmd_io_port;                                                  //0x30
    UCHAR acpi_on_value;                                                    //0x34
    UCHAR acpi_off_value;                                                   //0x35
    UCHAR s4bios_req;                                                       //0x36
    UCHAR pstate_control;                                                   //0x37
    ULONG pm1a_evt_blk_io_port;                                             //0x38
    ULONG pm1b_evt_blk_io_port;                                             //0x3c
    ULONG pm1a_ctrl_blk_io_port;                                            //0x40
    ULONG pm1b_ctrl_blk_io_port;                                            //0x44
    ULONG pm2_ctrl_blk_io_port;                                             //0x48
    ULONG pm_tmr_blk_io_port;                                               //0x4c
    ULONG gp0_blk_io_port;                                                  //0x50
    ULONG gp1_blk_io_port;                                                  //0x54
    UCHAR pm1_evt_len;                                                      //0x58
    UCHAR pm1_ctrl_len;                                                     //0x59
    UCHAR pm2_ctrl_len;                                                     //0x5a
    UCHAR pm_tmr_len;                                                       //0x5b
    UCHAR gp0_blk_len;                                                      //0x5c
    UCHAR gp1_blk_len;                                                      //0x5d
    UCHAR gp1_base;                                                         //0x5e
    UCHAR cstate_control;                                                   //0x5f
    USHORT lvl2_latency;                                                    //0x60
    USHORT lvl3_latency;                                                    //0x62
    USHORT flush_size;                                                      //0x64
    USHORT flush_stride;                                                    //0x66
    UCHAR duty_offset;                                                      //0x68
    UCHAR duty_width;                                                       //0x69
    UCHAR day_alarm_index;                                                  //0x6a
    UCHAR month_alarm_index;                                                //0x6b
    UCHAR century_alarm_index;                                              //0x6c
    USHORT boot_arch;                                                       //0x6d
    UCHAR reserved3[1];                                                     //0x6f
    ULONG flags;                                                            //0x70
    NOK_GEN_ADDR reset_reg;                                             //0x74
    UCHAR reset_val;                                                        //0x80
    USHORT arm_boot_arch;                                                   //0x81
    UCHAR minor_version_number;                                             //0x83
    NOK_LARGE_INTEGER x_firmware_ctrl;                                   //0x84
    NOK_LARGE_INTEGER x_dsdt;                                            //0x8c
    NOK_GEN_ADDR x_pm1a_evt_blk;                                        //0x94
    NOK_GEN_ADDR x_pm1b_evt_blk;                                        //0xa0
    NOK_GEN_ADDR x_pm1a_ctrl_blk;                                       //0xac
    NOK_GEN_ADDR x_pm1b_ctrl_blk;                                       //0xb8
    NOK_GEN_ADDR x_pm2_ctrl_blk;                                        //0xc4
    NOK_GEN_ADDR x_pm_tmr_blk;                                          //0xd0
    NOK_GEN_ADDR x_gp0_blk;                                             //0xdc
    NOK_GEN_ADDR x_gp1_blk;                                             //0xe8
    NOK_GEN_ADDR sleep_control_reg;                                     //0xf4
    NOK_GEN_ADDR sleep_status_reg;                                      //0x100
}NOK_FADT, * NOK_PFADT;
//0x48 bytes (sizeof)
typedef struct _NOK_HALP_DMA_TRANSLATION_ENTRY
{
    ULONGLONG PhysicalAddress;                                              //0x0
    NOK_PHALP_DMA_TRANSLATION_ENTRY Next;                               //0x8
    ULONG MappedLength;                                                     //0x10
    ULONGLONG LogicalAddress;                                               //0x18
    ULONGLONG LogicalMappedLength;                                          //0x20
    ULONGLONG NextLogicalAddress;                                           //0x28
    union
    {
        VOID* VirtualAddress;                                               //0x30
        struct
        {
            ULONGLONG BoundToMaster:1;                                      //0x30
            ULONGLONG BoundToScatterPool:1;                                 //0x30
            ULONGLONG OwnedByMaster:1;                                      //0x30
            ULONGLONG OwnedByScatterPool:1;                                 //0x30
            ULONGLONG TemporaryMapping:1;                                   //0x30
            ULONGLONG ZeroBuffer:1;                                         //0x30
            ULONGLONG Address:58;                                           //0x30
        } Flags;                                                            //0x30
    } u;                                                                    //0x30
    NOK_PHALP_DMA_TRANSLATION_ENTRY NextMapping;                        //0x38
    UCHAR LogicalBounceBufferPremapped;                                     //0x40
}NOK_HALP_DMA_TRANSLATION_ENTRY, * NOK_PHALP_DMA_TRANSLATION_ENTRY;
//0x40 bytes (sizeof)
typedef struct _NOK_RTL_LOOKASIDE
{
    NOK_SLIST_HEADER ListHead;                                           //0x0
    USHORT Depth;                                                           //0x10
    USHORT MaximumDepth;                                                    //0x12
    ULONG TotalAllocates;                                                   //0x14
    ULONG AllocateMisses;                                                   //0x18
    ULONG TotalFrees;                                                       //0x1c
    ULONG FreeMisses;                                                       //0x20
    ULONG LastTotalAllocates;                                               //0x24
    ULONG LastAllocateMisses;                                               //0x28
    ULONG LastTotalFrees;                                                   //0x2c
}NOK_RTL_LOOKASIDE, * NOK_PRTL_LOOKASIDE;
//0x10 bytes (sizeof)
typedef struct _NOK_HAL_CHANNEL_MEMORY_RANGES
{
    ULONGLONG PageFrameIndex;                                               //0x0
    USHORT MpnId;                                                           //0x8
    USHORT Node;                                                            //0xa
    USHORT Channel;                                                         //0xc
    UCHAR IsPowerManageable;                                                //0xe
    UCHAR DeepPowerState;                                                   //0xf
}NOK_HAL_CHANNEL_MEMORY_RANGES, * NOK_PHAL_CHANNEL_MEMORY_RANGES;
//0x20 bytes (sizeof)
typedef struct _NOK_HAL_CLOCK_TIMER_CONFIGURATION
{
    union
    {
        UCHAR Flags;                                                        //0x0
        struct
        {
            UCHAR AlwaysOnTimer:1;                                          //0x0
            UCHAR HighLatency:1;                                            //0x0
            UCHAR PerCpuTimer:1;                                            //0x0
            UCHAR DynamicTickSupported:1;                                   //0x0
        };
    };
    ULONG KnownType;                                                        //0x4
    ULONG Capabilities;                                                     //0x8
    ULONGLONG MaxIncrement;                                                 //0x10
    ULONG MinIncrement;                                                     //0x18
}NOK_HAL_CLOCK_TIMER_CONFIGURATION, * NOK_PHAL_CLOCK_TIMER_CONFIGURATION;
//0x18 bytes (sizeof)
typedef struct _NOK_HAL_DP_REPLACE_PARAMETERS
{
    ULONG Flags;                                                            //0x0
    NOK_PPNP_REPLACE_PROCESSOR_LIST TargetProcessors;                   //0x8
    NOK_PPNP_REPLACE_PROCESSOR_LIST SpareProcessors;                    //0x10
}NOK_HAL_DP_REPLACE_PARAMETERS, * NOK_PHAL_DP_REPLACE_PARAMETERS;
//0x8 bytes (sizeof)
typedef struct _NOK_HAL_HV_DMA_DOMAIN_INFO
{
    ULONG DomainId;                                                         //0x0
    UCHAR IsStage1;                                                         //0x4
}NOK_HAL_HV_DMA_DOMAIN_INFO, * NOK_PHAL_HV_DMA_DOMAIN_INFO;
//0xc bytes (sizeof)
typedef struct _NOK_HAL_HV_SVM_DEVICE_CAPABILITIES
{
    ULONG SvmSupported:1;                                                   //0x0
    ULONG PciExecute:1;                                                     //0x0
    ULONG NoExecute:1;                                                      //0x0
    ULONG Reserved:28;                                                      //0x0
    ULONG OverflowPossible:1;                                               //0x0
    ULONG PasidCount;                                                       //0x4
    ULONG IommuIndex;                                                       //0x8
}NOK_HAL_HV_SVM_DEVICE_CAPABILITIES, * NOK_PHAL_HV_SVM_DEVICE_CAPABILITIES;
//0x18 bytes (sizeof)
typedef struct _NOK_HAL_HV_SVM_SYSTEM_CAPABILITIES
{
    ULONG SvmSupported:1;                                                   //0x0
    ULONG GpaAlwaysValid:1;                                                 //0x0
    ULONG MaxPasidSpaceCount;                                               //0x4
    ULONG MaxPasidSpacePasidCount;                                          //0x8
    ULONG MaxPrqSize;                                                       //0xc
    ULONG IommuCount;                                                       //0x10
    ULONG MinIommuPasidCount;                                               //0x14
}NOK_HAL_HV_SVM_SYSTEM_CAPABILITIES, * NOK_PHAL_HV_SVM_SYSTEM_CAPABILITIES;
//0x98 bytes (sizeof)
typedef struct _NOK_HALP_DMA_ADAPTER_OBJECT
{
    NOK_DMA_ADAPTER DmaHeader;                                          //0x0
    NOK_PRTL_BITMAP ContiguousMapRegisters;                             //0x10
    NOK_PHALP_DMA_TRANSLATION_ENTRY ScatterBufferListHead;              //0x18
    ULONG NumberOfFreeScatterBuffers;                                       //0x20
    NOK_PHALP_DMA_TRANSLATION_BUFFER ContiguousTranslations;            //0x28
    NOK_PHALP_DMA_TRANSLATION_BUFFER ScatterTranslations;               //0x30
    NOK_HALP_DMA_TRANSLATION_BUFFER_POSITION ContiguousTranslationEnd;  //0x38
    NOK_HALP_DMA_TRANSLATION_BUFFER_POSITION ScatterTranslationEnd;     //0x48
    struct
    {
        NOK_HALP_DMA_TRANSLATION_BUFFER_POSITION ContiguousHint;        //0x58
        NOK_HALP_DMA_TRANSLATION_BUFFER_POSITION ScatterHint;           //0x68
    } CrashDump;                                                            //0x58
    ULONGLONG SpinLock;                                                     //0x78
    ULONGLONG GrowLock;                                                     //0x80
    NOK_LARGE_INTEGER MaximumPhysicalAddress;                            //0x88
    UCHAR IsMasterAdapter;                                                  //0x90
    UCHAR DmaCanCross64K;                                                   //0x91
    ULONG LibraryVersion;                                                   //0x94
}NOK_HALP_DMA_ADAPTER_OBJECT, * NOK_PHALP_DMA_ADAPTER_OBJECT;
//0x98 bytes (sizeof)
typedef struct _NOK_HAL_IOMMU_DISPATCH
{
    UCHAR (*HalIommuSupportEnabled)();                                      //0x0
    LONG (*HalIommuGetConfiguration)(ULONG arg1, ULONG* arg2, ULONG* arg3, VOID** arg4); //0x8
    LONG (*HalIommuGetLibraryContext)(ULONG arg1, ULONG arg2, VOID** arg3); //0x10
    LONG (*HalIommuMapDevice)(VOID* arg1, NOK_PEXT_IOMMU_DEVICE_ID arg2, NOK_PIOMMU_SVM_CAPABILITIES arg3, VOID** arg4); //0x18
    LONG (*HalIommuEnableDevicePasid)(VOID* arg1, VOID* arg2);              //0x20
    LONG (*HalIommuSetAddressSpace)(VOID* arg1, ULONGLONG arg2);            //0x28
    LONG (*HalIommuDisableDevicePasid)(VOID* arg1, VOID* arg2);             //0x30
    LONG (*HalIommuUnmapDevice)(VOID* arg1, VOID* arg2);                    //0x38
    LONG (*HalIommuFreeLibraryContext)(VOID* arg1);                         //0x40
    VOID (*HalIommuFlushTb)(VOID* arg1, ULONG arg2, NOK_PKTB_FLUSH_VA arg3); //0x48
    VOID (*HalIommuFlushAllPasid)(VOID* arg1, ULONG arg2, NOK_PKTB_FLUSH_VA arg3); //0x50
    UCHAR (*HalIommuProcessPageRequestQueue)(ULONG arg1);                   //0x58
    VOID (*HalIommuFaultRoutine)(ULONG arg1);                               //0x60
    VOID* (*HalIommuReferenceAsid)(ULONG arg1);                             //0x68
    VOID (*HalIommuDereferenceAsid)(ULONG arg1);                            //0x70
    LONG (*HalIommuServicePageFault)(ULONGLONG arg1, VOID* arg2, ULONG arg3); //0x78
    LONG (*HalIommuDevicePowerChange)(VOID* arg1, VOID* arg2, UCHAR arg3);  //0x80
    LONG (*HalIommuBeginDeviceReset)(VOID* arg1, ULONG* arg2);              //0x88
    LONG (*HalIommuFinalizeDeviceReset)(VOID* arg1);                        //0x90
}NOK_HAL_IOMMU_DISPATCH, * NOK_PHAL_IOMMU_DISPATCH;
//0x18 bytes (sizeof)
typedef struct _NOK_HAL_LBR_ENTRY
{
    VOID* FromAddress;                                                      //0x0
    VOID* ToAddress;                                                        //0x8
    VOID* Reserved;                                                         //0x10
}NOK_HAL_LBR_ENTRY, * NOK_PHAL_LBR_ENTRY;
//0x10 bytes (sizeof)
typedef struct _NOK_HAL_LOG_REGISTER_CONTEXT
{
    VOID (*LogRoutine)(ULONG arg1, VOID* arg2, ULONG arg3);                 //0x0
    ULONG Flag;                                                             //0x8
}NOK_HAL_LOG_REGISTER_CONTEXT, * NOK_PHAL_LOG_REGISTER_CONTEXT;
//0x10 bytes (sizeof)
typedef struct _NOK_HAL_NODE_RANGE
{
    ULONGLONG PageFrameIndex;                                               //0x0
    ULONG Node;                                                             //0x8
}NOK_HAL_NODE_RANGE, * NOK_PHAL_NODE_RANGE;
//0x150 bytes (sizeof)
typedef struct _NOK_DRIVER_OBJECT
{
    SHORT Type;                                                             //0x0
    SHORT Size;                                                             //0x2
    NOK_PDEVICE_OBJECT DeviceObject;                                    //0x8
    ULONG Flags;                                                            //0x10
    VOID* DriverStart;                                                      //0x18
    ULONG DriverSize;                                                       //0x20
    VOID* DriverSection;                                                    //0x28
    NOK_PDRIVER_EXTENSION DriverExtension;                              //0x30
    NOK_UNICODE_STRING DriverName;                                      //0x38
    NOK_PUNICODE_STRING HardwareDatabase;                               //0x48
    NOK_PFAST_IO_DISPATCH FastIoDispatch;                               //0x50
    LONG (*DriverInit)(NOK_PDRIVER_OBJECT arg1, NOK_PUNICODE_STRING arg2); //0x58
    VOID (*DriverStartIo)(NOK_PDEVICE_OBJECT arg1, NOK_PIRP arg2);  //0x60
    VOID (*DriverUnload)(NOK_PDRIVER_OBJECT arg1);                      //0x68
    LONG (*MajorFunction[28])(NOK_PDEVICE_OBJECT arg1, NOK_PIRP arg2); //0x70
}NOK_DRIVER_OBJECT, * NOK_PDRIVER_OBJECT;
//0x58 bytes (sizeof)
typedef struct _NOK_DMA_TRANSFER_CONTEXT_V1
{
    LONG DmaState;                                                          //0x0
    ULONG TransferState;                                                    //0x4
    NOK_WAIT_CONTEXT_BLOCK Wcb;                                         //0x8
    VOID* HalWcb;                                                           //0x50
}NOK_DMA_TRANSFER_CONTEXT_V1, * NOK_PDMA_TRANSFER_CONTEXT_V1;
//0x40 bytes (sizeof)
typedef struct _NOK_HANDLE_TABLE_FREE_LIST
{
    NOK_EX_PUSH_LOCK FreeListLock;                                      //0x0
    NOK_PHANDLE_TABLE_ENTRY FirstFreeHandleEntry;                        //0x8
    NOK_PHANDLE_TABLE_ENTRY LastFreeHandleEntry;                         //0x10
    LONG HandleCount;                                                       //0x18
    ULONG HighWaterMark;                                                    //0x1c
}NOK_HANDLE_TABLE_FREE_LIST, * NOK_PHANDLE_TABLE_FREE_LIST;
//0x80 bytes (sizeof)
typedef struct _NOK_HANDLE_TABLE
{
    ULONG NextHandleNeedingPool;                                            //0x0
    LONG ExtraInfoPages;                                                    //0x4
    volatile ULONGLONG TableCode;                                           //0x8
    NOK_PEPROCESS QuotaProcess;                                         //0x10
    NOK_LIST_ENTRY HandleTableList;                                     //0x18
    ULONG UniqueProcessId;                                                  //0x28
    union
    {
        ULONG Flags;                                                        //0x2c
        struct
        {
            UCHAR StrictFIFO:1;                                             //0x2c
            UCHAR EnableHandleExceptions:1;                                 //0x2c
            UCHAR Rundown:1;                                                //0x2c
            UCHAR Duplicated:1;                                             //0x2c
            UCHAR RaiseUMExceptionOnInvalidHandleClose:1;                   //0x2c
        };
    };
    NOK_EX_PUSH_LOCK HandleContentionEvent;                             //0x30
    NOK_EX_PUSH_LOCK HandleTableLock;                                   //0x38
    union
    {
        NOK_HANDLE_TABLE_FREE_LIST FreeLists[1];                        //0x40
        struct
        {
            UCHAR ActualEntry[32];                                          //0x40
            NOK_PHANDLE_TRACE_DEBUG_INFO DebugInfo;                     //0x60
        };
    };
}NOK_HANDLE_TABLE, * NOK_PHANDLE_TABLE;
//0x20 bytes (sizeof)
typedef struct _NOK_HANDLE_REVOCATION_INFO
{
    NOK_LIST_ENTRY ListEntry;                                           //0x0
    NOK_POB_HANDLE_REVOCATION_BLOCK RevocationBlock;                    //0x10
    UCHAR AllowHandleRevocation;                                            //0x18
    UCHAR Padding1[3];                                                      //0x19
    UCHAR Padding2[4];                                                      //0x1c
}NOK_HANDLE_REVOCATION_INFO, * NOK_PHANDLE_REVOCATION_INFO;
//0xa0 bytes (sizeof)
typedef struct _NOK_HANDLE_TRACE_DB_ENTRY
{
    NOK_CLIENT_ID ClientId;                                             //0x0
    VOID* Handle;                                                           //0x10
    ULONG Type;                                                             //0x18
    VOID* StackTrace[16];                                                   //0x20
}NOK_HANDLE_TRACE_DB_ENTRY, * NOK_PHANDLE_TRACE_DB_ENTRY;
//0xf0 bytes (sizeof)
typedef struct _NOK_HANDLE_TRACE_DEBUG_INFO
{
    LONG RefCount;                                                          //0x0
    ULONG TableSize;                                                        //0x4
    ULONG BitMaskFlags;                                                     //0x8
    NOK_FAST_MUTEX CloseCompactionLock;                                 //0x10
    ULONG CurrentStackIndex;                                                //0x48
    NOK_HANDLE_TRACE_DB_ENTRY TraceDb[1];                               //0x50
}NOK_HANDLE_TRACE_DEBUG_INFO, * NOK_PHANDLE_TRACE_DEBUG_INFO;
//0x8 bytes (sizeof)
typedef struct _NOK_HARDWARE_PTE
{
    ULONGLONG Valid:1;                                                      //0x0
    ULONGLONG Write:1;                                                      //0x0
    ULONGLONG Owner:1;                                                      //0x0
    ULONGLONG WriteThrough:1;                                               //0x0
    ULONGLONG CacheDisable:1;                                               //0x0
    ULONGLONG Accessed:1;                                                   //0x0
    ULONGLONG Dirty:1;                                                      //0x0
    ULONGLONG LargePage:1;                                                  //0x0
    ULONGLONG Global:1;                                                     //0x0
    ULONGLONG CopyOnWrite:1;                                                //0x0
    ULONGLONG Prototype:1;                                                  //0x0
    ULONGLONG reserved0:1;                                                  //0x0
    ULONGLONG PageFrameNumber:36;                                           //0x0
    ULONGLONG reserved1:4;                                                  //0x0
    ULONGLONG SoftwareWsIndex:11;                                           //0x0
    ULONGLONG NoExecute:1;                                                  //0x0
}NOK_HARDWARE_PTE, * NOK_PHARDWARE_PTE;
//0xd8 bytes (sizeof)
typedef struct _NOK_HALP_DMA_MASTER_ADAPTER_OBJECT
{
    NOK_HALP_DMA_ADAPTER_OBJECT AdapterObject;                          //0x0
    NOK_LIST_ENTRY ContiguousAdapterQueue;                              //0x98
    NOK_LIST_ENTRY ScatterAdapterQueue;                                 //0xa8
    ULONG MapBufferSize;                                                    //0xb8
    NOK_LARGE_INTEGER MapBufferPhysicalAddress;                          //0xc0
    ULONG ContiguousPageCount;                                              //0xc8
    ULONG ContiguousPageLimit;                                              //0xcc
    ULONG ScatterPageCount;                                                 //0xd0
    ULONG ScatterPageLimit;                                                 //0xd4
}NOK_HALP_DMA_MASTER_ADAPTER_OBJECT, * NOK_PHALP_DMA_MASTER_ADAPTER_OBJECT;
//0x1f0 bytes (sizeof)
typedef struct _NOK_HAL_INTEL_ENLIGHTENMENT_INFORMATION
{
    ULONG Enlightenments;                                                   //0x0
    ULONG HypervisorConnected;                                              //0x4
    VOID (*EndOfInterrupt)();                                               //0x8
    VOID (*ApicWriteIcr)(ULONG arg1, ULONG arg2);                           //0x10
    ULONG Reserved0;                                                        //0x18
    ULONG SpinCountMask;                                                    //0x1c
    VOID (*LongSpinWait)(ULONG arg1);                                       //0x20
    ULONGLONG (*GetReferenceTime)();                                        //0x28
    LONG (*SetSystemSleepProperty)(ULONG arg1, UCHAR arg2, UCHAR arg3);     //0x30
    LONG (*EnterSleepState)(ULONG arg1);                                    //0x38
    LONG (*NotifyDebugDeviceAvailable)();                                   //0x40
    LONG (*MapDeviceInterrupt)(ULONGLONG arg1, VOID* arg2, NOK_PGROUP_AFFINITY arg3, VOID* arg4); //0x48
    LONG (*UnmapDeviceInterrupt)(ULONGLONG arg1, VOID* arg2);               //0x50
    LONG (*RetargetDeviceInterrupt)(ULONGLONG arg1, VOID* arg2, VOID* arg3, NOK_PGROUP_AFFINITY arg4, VOID* arg5); //0x58
    LONG (*SetHpetConfig)(NOK_LARGE_INTEGER arg1, ULONG arg2, ULONGLONG arg3, UCHAR arg4, VOID* arg5); //0x60
    LONG (*NotifyHpetEnabled)();                                            //0x68
    LONG (*QueryAssociatedProcessors)(ULONG arg1, ULONG* arg2, ULONG* arg3); //0x70
    LONG (*ReadMultipleMsr)(ULONG arg1, ULONG arg2, ULONG* arg3, ULONGLONG* arg4); //0x78
    LONG (*WriteMultipleMsr)(ULONG arg1, ULONG arg2, ULONG* arg3, ULONGLONG* arg4); //0x80
    LONG (*ReadCpuid)(ULONG arg1, ULONG arg2, ULONG* arg3, ULONG* arg4, ULONG* arg5, ULONG* arg6); //0x88
    LONG (*LpWritebackInvalidate)(ULONG arg1);                              //0x90
    LONG (*GetMachineCheckContext)(ULONG arg1, ULONG* arg2, ULONGLONG* arg3, ULONG* arg4); //0x98
    LONG (*SuspendPartition)(ULONGLONG arg1);                               //0xa0
    LONG (*ResumePartition)(ULONGLONG arg1);                                //0xa8
    LONG (*SetSystemMachineCheckProperty)(VOID* arg1);                      //0xb0
    LONG (*WheaErrorNotification)(NOK_PWHEA_RECOVERY_CONTEXT arg1, UCHAR arg2, UCHAR arg3); //0xb8
    ULONG (*GetProcessorIndexFromVpIndex)(ULONG arg1);                      //0xc0
    LONG (*SyntheticClusterIpi)(NOK_PKAFFINITY_EX arg1, ULONG arg2);    //0xc8
    UCHAR (*VpStartEnabled)();                                              //0xd0
    LONG (*StartVirtualProcessor)(ULONG arg1, VOID* arg2);                  //0xd8
    LONG (*GetVpIndexFromApicId)(ULONG arg1, ULONG* arg2);                  //0xe0
    LONG (*IumAccessPciDevice)(UCHAR arg1, ULONG arg2, ULONG arg3, ULONG arg4, ULONG arg5, ULONG arg6, ULONG arg7, VOID* arg8); //0xe8
    ULONGLONG (*IumEfiRuntimeService)(ULONG arg1, VOID* arg2, ULONGLONG arg3, ULONGLONG* arg4); //0xf0
    VOID (*SvmGetSystemCapabilities)(NOK_PHAL_HV_SVM_SYSTEM_CAPABILITIES arg1); //0xf8
    LONG (*SvmGetDeviceCapabilities)(ULONG arg1, NOK_PHAL_HV_SVM_DEVICE_CAPABILITIES arg2); //0x100
    LONG (*SvmCreatePasidSpace)(ULONG arg1, ULONG arg2);                    //0x108
    LONG (*SvmSetPasidAddressSpace)(ULONG arg1, ULONG arg2, ULONGLONG arg3); //0x110
    VOID (*SvmFlushPasid)(ULONG arg1, ULONG arg2, ULONG arg3, NOK_PKTB_FLUSH_VA arg4); //0x118
    LONG (*SvmAttachPasidSpace)(ULONG arg1, ULONG arg2, ULONG arg3, ULONG arg4); //0x120
    LONG (*SvmDetachPasidSpace)(ULONG arg1);                                //0x128
    LONG (*SvmEnablePasid)(ULONG arg1, ULONG arg2);                         //0x130
    LONG (*SvmDisablePasid)(ULONG arg1, ULONG arg2);                        //0x138
    LONG (*SvmAcknowledgePageRequest)(ULONG arg1, VOID* arg2, ULONG* arg3); //0x140
    LONG (*SvmCreatePrQueue)(ULONG arg1, ULONG arg2, NOK_LARGE_INTEGER arg3, ULONG arg4, ULONG arg5); //0x148
    LONG (*SvmDeletePrQueue)(ULONG arg1);                                   //0x150
    LONG (*SvmClearPrqStalled)(ULONG arg1);                                 //0x158
    LONG (*SvmSetDeviceEnabled)(ULONG arg1, UCHAR arg2);                    //0x160
    LONG (*HvDebuggerPowerHandler)(UCHAR arg1);                             //0x168
    LONG (*SetQpcBias)(ULONGLONG arg1);                                     //0x170
    ULONGLONG (*GetQpcBias)();                                              //0x178
    LONG (*RegisterDeviceId)(NOK_PEXT_IOMMU_DEVICE_ID arg1, ULONGLONG arg2); //0x180
    LONG (*UnregisterDeviceId)(ULONGLONG arg1);                             //0x188
    LONG (*AllocateDeviceDomain)(NOK_PHAL_HV_DMA_DOMAIN_INFO arg1);     //0x190
    LONG (*AttachDeviceDomain)(NOK_PEXT_IOMMU_DEVICE_ID arg1, NOK_PHAL_HV_DMA_DOMAIN_INFO arg2); //0x198
    LONG (*DetachDeviceDomain)(ULONGLONG arg1);                             //0x1a0
    LONG (*DeleteDeviceDomain)(NOK_PHAL_HV_DMA_DOMAIN_INFO arg1);       //0x1a8
    LONG (*MapDeviceLogicalRange)(NOK_PHAL_HV_DMA_DOMAIN_INFO arg1, ULONG arg2, ULONGLONG arg3, ULONGLONG* arg4, ULONGLONG* arg5, UCHAR arg6); //0x1b0
    LONG (*UnmapDeviceLogicalRange)(NOK_PHAL_HV_DMA_DOMAIN_INFO arg1, ULONGLONG arg2, ULONGLONG* arg3); //0x1b8
    LONG (*MapDeviceSparsePages)(NOK_PHAL_HV_DMA_DOMAIN_INFO arg1, ULONG arg2, ULONGLONG* arg3, ULONGLONG* arg4); //0x1c0
    LONG (*UnmapDeviceSparsePages)(NOK_PHAL_HV_DMA_DOMAIN_INFO arg1, ULONGLONG* arg2, ULONGLONG* arg3); //0x1c8
    LONG (*GetDmaGuardEnabled)(UCHAR* arg1);                                //0x1d0
    LONG (*UpdateMicrocode)(VOID* arg1, ULONG arg2);                        //0x1d8
    LONG (*GetSintMessage)(UCHAR arg1, VOID** arg2);                        //0x1e0
    LONG (*SetRootFaultReportingReady)();                                   //0x1e8
}NOK_HAL_INTEL_ENLIGHTENMENT_INFORMATION, * NOK_PHAL_INTEL_ENLIGHTENMENT_INFORMATION;
//0x8 bytes (sizeof)
typedef struct _NOK_HCELL
{
    LONG Size;                                                              //0x0
    union
    {
        struct
        {
            union
            {
                ULONG UserData;                                             //0x4
                ULONG Next;                                                 //0x4
            } u;                                                            //0x4
        } NewCell;                                                          //0x4
    } u;                                                                    //0x4
}NOK_HCELL, * NOK_PHCELL;
//0x40 bytes (sizeof)
typedef struct _NOK_HEADLESS_LOADER_BLOCK
{
    UCHAR UsedBiosSettings;                                                 //0x0
    UCHAR DataBits;                                                         //0x1
    UCHAR StopBits;                                                         //0x2
    UCHAR Parity;                                                           //0x3
    ULONG BaudRate;                                                         //0x4
    ULONG PortNumber;                                                       //0x8
    UCHAR* PortAddress;                                                     //0x10
    USHORT PciDeviceId;                                                     //0x18
    USHORT PciVendorId;                                                     //0x1a
    UCHAR PciBusNumber;                                                     //0x1c
    USHORT PciBusSegment;                                                   //0x1e
    UCHAR PciSlotNumber;                                                    //0x20
    UCHAR PciFunctionNumber;                                                //0x21
    ULONG PciFlags;                                                         //0x24
    NOK_GUID SystemGUID;                                                //0x28
    UCHAR IsMMIODevice;                                                     //0x38
    UCHAR TerminalType;                                                     //0x39
    UCHAR InterfaceType;                                                    //0x3a
    UCHAR RegisterBitWidth;                                                 //0x3b
    UCHAR RegisterAccessSize;                                               //0x3c
}NOK_HEADLESS_LOADER_BLOCK, * NOK_PHEADLESS_LOADER_BLOCK;
//0x20 bytes (sizeof)
typedef struct _NOK_RTL_HEAP_MEMORY_LIMIT_DATA
{
    ULONGLONG CommitLimitBytes;                                             //0x0
    ULONGLONG CommitLimitFailureCode;                                       //0x8
    ULONGLONG MaxAllocationSizeBytes;                                       //0x10
    ULONGLONG AllocationLimitFailureCode;                                   //0x18
}NOK_RTL_HEAP_MEMORY_LIMIT_DATA, * NOK_PRTL_HEAP_MEMORY_LIMIT_DATA;
//0x10 bytes (sizeof)
typedef struct _NOK_HEAP_UNPACKED_ENTRY
{
    VOID* PreviousBlockPrivateData;                                         //0x0
    union
    {
        struct
        {
            USHORT Size;                                                    //0x8
            UCHAR Flags;                                                    //0xa
            UCHAR SmallTagIndex;                                            //0xb
        };
        struct
        {
            ULONG SubSegmentCode;                                           //0x8
            USHORT PreviousSize;                                            //0xc
            union
            {
                UCHAR SegmentOffset;                                        //0xe
                UCHAR LFHFlags;                                             //0xe
            };
            UCHAR UnusedBytes;                                              //0xf
        };
        ULONGLONG CompactHeader;                                            //0x8
    };
}NOK_HEAP_UNPACKED_ENTRY, * NOK_PHEAP_UNPACKED_ENTRY;
//0x10 bytes (sizeof)
typedef struct _NOK_HEAP_EXTENDED_ENTRY
{
    VOID* Reserved;                                                         //0x0
    union
    {
        struct
        {
            USHORT FunctionIndex;                                           //0x8
            USHORT ContextValue;                                            //0xa
        };
        ULONG InterceptorValue;                                             //0x8
    };
    USHORT UnusedBytesLength;                                               //0xc
    UCHAR EntryOffset;                                                      //0xe
    UCHAR ExtendedBlockSignature;                                           //0xf
}NOK_HEAP_EXTENDED_ENTRY, * NOK_PHEAP_EXTENDED_ENTRY;
//0x10 bytes (sizeof)
typedef struct _NOK_HEAP_ENTRY
{
    union
    {
        NOK_HEAP_UNPACKED_ENTRY UnpackedEntry;                          //0x0
        struct
        {
            VOID* PreviousBlockPrivateData;                                 //0x0
            union
            {
                struct
                {
                    USHORT Size;                                            //0x8
                    UCHAR Flags;                                            //0xa
                    UCHAR SmallTagIndex;                                    //0xb
                };
                struct
                {
                    ULONG SubSegmentCode;                                   //0x8
                    USHORT PreviousSize;                                    //0xc
                    union
                    {
                        UCHAR SegmentOffset;                                //0xe
                        UCHAR LFHFlags;                                     //0xe
                    };
                    UCHAR UnusedBytes;                                      //0xf
                };
                ULONGLONG CompactHeader;                                    //0x8
            };
        };
        NOK_HEAP_EXTENDED_ENTRY ExtendedEntry;                          //0x0
        struct
        {
            VOID* Reserved;                                                 //0x0
            union
            {
                struct
                {
                    USHORT FunctionIndex;                                   //0x8
                    USHORT ContextValue;                                    //0xa
                };
                ULONG InterceptorValue;                                     //0x8
            };
            USHORT UnusedBytesLength;                                       //0xc
            UCHAR EntryOffset;                                              //0xe
            UCHAR ExtendedBlockSignature;                                   //0xf
        };
        struct
        {
            VOID* ReservedForAlignment;                                     //0x0
            union
            {
                struct
                {
                    ULONG Code1;                                            //0x8
                    union
                    {
                        struct
                        {
                            USHORT Code2;                                   //0xc
                            UCHAR Code3;                                    //0xe
                            UCHAR Code4;                                    //0xf
                        };
                        ULONG Code234;                                      //0xc
                    };
                };
                ULONGLONG AgregateCode;                                     //0x8
            };
        };
    };
}NOK_HEAP_ENTRY, * NOK_PHEAP_ENTRY;
//0x70 bytes (sizeof)
typedef struct _NOK_HEAP_SEGMENT
{
    NOK_HEAP_ENTRY Entry;                                               //0x0
    ULONG SegmentSignature;                                                 //0x10
    ULONG SegmentFlags;                                                     //0x14
    NOK_LIST_ENTRY SegmentListEntry;                                    //0x18
    NOK_PHEAP Heap;                                                     //0x28
    VOID* BaseAddress;                                                      //0x30
    ULONG NumberOfPages;                                                    //0x38
    NOK_HEAP_ENTRY* FirstEntry;                                         //0x40
    NOK_HEAP_ENTRY* LastValidEntry;                                     //0x48
    ULONG NumberOfUnCommittedPages;                                         //0x50
    ULONG NumberOfUnCommittedRanges;                                        //0x54
    USHORT SegmentAllocatorBackTraceIndex;                                  //0x58
    USHORT Reserved;                                                        //0x5a
    NOK_LIST_ENTRY UCRSegmentList;                                      //0x60
}NOK_HEAP_SEGMENT, * NOK_PHEAP_SEGMENT;
//0x78 bytes (sizeof)
typedef struct _NOK_HEAP_COUNTERS
{
    ULONGLONG TotalMemoryReserved;                                          //0x0
    ULONGLONG TotalMemoryCommitted;                                         //0x8
    ULONGLONG TotalMemoryLargeUCR;                                          //0x10
    ULONGLONG TotalSizeInVirtualBlocks;                                     //0x18
    ULONG TotalSegments;                                                    //0x20
    ULONG TotalUCRs;                                                        //0x24
    ULONG CommittOps;                                                       //0x28
    ULONG DeCommitOps;                                                      //0x2c
    ULONG LockAcquires;                                                     //0x30
    ULONG LockCollisions;                                                   //0x34
    ULONG CommitRate;                                                       //0x38
    ULONG DecommittRate;                                                    //0x3c
    ULONG CommitFailures;                                                   //0x40
    ULONG InBlockCommitFailures;                                            //0x44
    ULONG PollIntervalCounter;                                              //0x48
    ULONG DecommitsSinceLastCheck;                                          //0x4c
    ULONG HeapPollInterval;                                                 //0x50
    ULONG AllocAndFreeOps;                                                  //0x54
    ULONG AllocationIndicesActive;                                          //0x58
    ULONG InBlockDeccommits;                                                //0x5c
    ULONGLONG InBlockDeccomitSize;                                          //0x60
    ULONGLONG HighWatermarkSize;                                            //0x68
    ULONGLONG LastPolledSize;                                               //0x70
}NOK_HEAP_COUNTERS, * NOK_PHEAP_COUNTERS;
//0x10 bytes (sizeof)
typedef struct _NOK_HEAP_TUNING_PARAMETERS
{
    ULONG CommittThresholdShift;                                            //0x0
    ULONGLONG MaxPreCommittThreshold;                                       //0x8
}NOK_HEAP_TUNING_PARAMETERS, * NOK_PHEAP_TUNING_PARAMETERS;
//0x2c0 bytes (sizeof)
typedef struct _NOK_HEAP
{
    union
    {
        NOK_HEAP_SEGMENT Segment;                                       //0x0
        struct
        {
            NOK_HEAP_ENTRY Entry;                                       //0x0
            ULONG SegmentSignature;                                         //0x10
            ULONG SegmentFlags;                                             //0x14
            NOK_LIST_ENTRY SegmentListEntry;                            //0x18
            NOK_PHEAP Heap;                                             //0x28
            VOID* BaseAddress;                                              //0x30
            ULONG NumberOfPages;                                            //0x38
            NOK_HEAP_ENTRY* FirstEntry;                                 //0x40
            NOK_HEAP_ENTRY* LastValidEntry;                             //0x48
            ULONG NumberOfUnCommittedPages;                                 //0x50
            ULONG NumberOfUnCommittedRanges;                                //0x54
            USHORT SegmentAllocatorBackTraceIndex;                          //0x58
            USHORT Reserved;                                                //0x5a
            NOK_LIST_ENTRY UCRSegmentList;                              //0x60
        };
    };
    ULONG Flags;                                                            //0x70
    ULONG ForceFlags;                                                       //0x74
    ULONG CompatibilityFlags;                                               //0x78
    ULONG EncodeFlagMask;                                                   //0x7c
    NOK_HEAP_ENTRY Encoding;                                            //0x80
    ULONG Interceptor;                                                      //0x90
    ULONG VirtualMemoryThreshold;                                           //0x94
    ULONG Signature;                                                        //0x98
    ULONGLONG SegmentReserve;                                               //0xa0
    ULONGLONG SegmentCommit;                                                //0xa8
    ULONGLONG DeCommitFreeBlockThreshold;                                   //0xb0
    ULONGLONG DeCommitTotalFreeThreshold;                                   //0xb8
    ULONGLONG TotalFreeSize;                                                //0xc0
    ULONGLONG MaximumAllocationSize;                                        //0xc8
    USHORT ProcessHeapsListIndex;                                           //0xd0
    USHORT HeaderValidateLength;                                            //0xd2
    VOID* HeaderValidateCopy;                                               //0xd8
    USHORT NextAvailableTagIndex;                                           //0xe0
    USHORT MaximumTagIndex;                                                 //0xe2
    NOK_HEAP_TAG_ENTRY* TagEntries;                                     //0xe8
    NOK_LIST_ENTRY UCRList;                                             //0xf0
    ULONGLONG AlignRound;                                                   //0x100
    ULONGLONG AlignMask;                                                    //0x108
    NOK_LIST_ENTRY VirtualAllocdBlocks;                                 //0x110
    NOK_LIST_ENTRY SegmentList;                                         //0x120
    USHORT AllocatorBackTraceIndex;                                         //0x130
    ULONG NonDedicatedListLength;                                           //0x134
    VOID* BlocksIndex;                                                      //0x138
    VOID* UCRIndex;                                                         //0x140
    NOK_HEAP_PSEUDO_TAG_ENTRY* PseudoTagEntries;                        //0x148
    NOK_LIST_ENTRY FreeLists;                                           //0x150
    NOK_HEAP_LOCK* LockVariable;                                        //0x160
    LONG (*CommitRoutine)(VOID* arg1, VOID** arg2, ULONGLONG* arg3);        //0x168
    NOK_RTL_RUN_ONCE StackTraceInitVar;                                  //0x170
    NOK_RTL_HEAP_MEMORY_LIMIT_DATA CommitLimitData;                     //0x178
    VOID* FrontEndHeap;                                                     //0x198
    USHORT FrontHeapLockCount;                                              //0x1a0
    UCHAR FrontEndHeapType;                                                 //0x1a2
    UCHAR RequestedFrontEndHeapType;                                        //0x1a3
    WCHAR* FrontEndHeapUsageData;                                           //0x1a8
    USHORT FrontEndHeapMaximumIndex;                                        //0x1b0
    volatile UCHAR FrontEndHeapStatusBitmap[129];                           //0x1b2
    NOK_HEAP_COUNTERS Counters;                                         //0x238
    NOK_HEAP_TUNING_PARAMETERS TuningParameters;                        //0x2b0
}NOK_HEAP, * NOK_PHEAP;
//0x28 bytes (sizeof)
typedef struct _NOK_RTL_CRITICAL_SECTION
{
    NOK_RTL_CRITICAL_SECTION_DEBUG* DebugInfo;                          //0x0
    LONG LockCount;                                                         //0x8
    LONG RecursionCount;                                                    //0xc
    VOID* OwningThread;                                                     //0x10
    VOID* LockSemaphore;                                                    //0x18
    ULONGLONG SpinCount;                                                    //0x20
}NOK_RTL_CRITICAL_SECTION, * NOK_PRTL_CRITICAL_SECTION;
//0x10 bytes (sizeof)
typedef struct _NOK_HEAP_PSEUDO_TAG_ENTRY
{
    ULONG Allocs;                                                           //0x0
    ULONG Frees;                                                            //0x4
    ULONGLONG Size;                                                         //0x8
}NOK_HEAP_PSEUDO_TAG_ENTRY, * NOK_PHEAP_PSEUDO_TAG_ENTRY;
//0x48 bytes (sizeof)
typedef struct _NOK_HEAP_TAG_ENTRY
{
    ULONG Allocs;                                                           //0x0
    ULONG Frees;                                                            //0x4
    ULONGLONG Size;                                                         //0x8
    USHORT TagIndex;                                                        //0x10
    USHORT CreatorBackTraceIndex;                                           //0x12
    WCHAR TagName[24];                                                      //0x14
}NOK_HEAP_TAG_ENTRY, * NOK_PHEAP_TAG_ENTRY;
//0x20 bytes (sizeof)
typedef struct _NOK_ETW_PROVIDER_TRAITS
{
    NOK_RTL_BALANCED_NODE Node;                                         //0x0
    ULONG ReferenceCount;                                                   //0x18
    UCHAR Traits[1];                                                        //0x1c
}NOK_ETW_PROVIDER_TRAITS, * NOK_PETW_PROVIDER_TRAITS;
//0x68 bytes (sizeof)
typedef struct _NOK_ERESOURCE
{
    NOK_LIST_ENTRY SystemResourcesList;                                 //0x0
    NOK_POWNER_ENTRY OwnerTable;                                        //0x10
    SHORT ActiveCount;                                                      //0x18
    union
    {
        USHORT Flag;                                                        //0x1a
        struct
        {
            UCHAR ReservedLowFlags;                                         //0x1a
            UCHAR WaiterPriority;                                           //0x1b
        };
    };
    VOID* SharedWaiters;                                                    //0x20
    VOID* ExclusiveWaiters;                                                 //0x28
    NOK_OWNER_ENTRY OwnerEntry;                                         //0x30
    ULONG ActiveEntries;                                                    //0x40
    ULONG ContentionCount;                                                  //0x44
    ULONG NumberOfSharedWaiters;                                            //0x48
    ULONG NumberOfExclusiveWaiters;                                         //0x4c
    VOID* Reserved2;                                                        //0x50
    union
    {
        VOID* Address;                                                      //0x58
        ULONGLONG CreatorBackTraceIndex;                                    //0x58
    };
    ULONGLONG SpinLock;                                                     //0x60
}NOK_ERESOURCE, * NOK_PERESOURCE;
//0x30 bytes (sizeof)
typedef struct _NOK_RTL_CRITICAL_SECTION_DEBUG
{
    USHORT Type;                                                            //0x0
    USHORT CreatorBackTraceIndex;                                           //0x2
    NOK_PRTL_CRITICAL_SECTION CriticalSection;                          //0x8
    NOK_LIST_ENTRY ProcessLocksList;                                    //0x10
    ULONG EntryCount;                                                       //0x20
    ULONG ContentionCount;                                                  //0x24
    ULONG Flags;                                                            //0x28
    USHORT CreatorBackTraceIndexHigh;                                       //0x2c
    USHORT SpareUSHORT;                                                     //0x2e
}NOK_RTL_CRITICAL_SECTION_DEBUG, * NOK_PRTL_CRITICAL_SECTION_DEBUG;
//0x8 bytes (sizeof)
typedef struct _NOK_HANDLE_TABLE_ENTRY_INFO
{
    ULONG AuditMask;                                                        //0x0
    ULONG MaxRelativeAccessMask;                                            //0x4
}NOK_HANDLE_TABLE_ENTRY_INFO, * NOK_PHANDLE_TABLE_ENTRY_INFO;
//0x68 bytes (sizeof)
typedef struct _NOK_HEAP_LOCK
{
    union
    {
        NOK_RTL_CRITICAL_SECTION CriticalSection;                       //0x0
        NOK_ERESOURCE Resource;                                         //0x0
    } Lock;                                                                 //0x0
}NOK_HEAP_LOCK, * NOK_PHEAP_LOCK;
//0x4 bytes (sizeof)
typedef struct _NOK_HEAP_DESCRIPTOR_KEY
{
    union
    {
        ULONG Key;                                                          //0x0
        struct
        {
            ULONG EncodedCommittedPageCount:16;                             //0x0
            ULONG LargePageCost:8;                                          //0x0
            ULONG UnitCount:8;                                              //0x0
        };
    };
}NOK_HEAP_DESCRIPTOR_KEY, * NOK_PHEAP_DESCRIPTOR_KEY;
//0x4 bytes (sizeof)
typedef enum _NOK_HEAP_FAILURE_TYPE
{
    NOK_heap_failure_internal = 0,
    NOK_heap_failure_unknown = 1,
    NOK_heap_failure_generic = 2,
    NOK_heap_failure_entry_corruption = 3,
    NOK_heap_failure_multiple_entries_corruption = 4,
    NOK_heap_failure_virtual_block_corruption = 5,
    NOK_heap_failure_buffer_overrun = 6,
    NOK_heap_failure_buffer_underrun = 7,
    NOK_heap_failure_block_not_busy = 8,
    NOK_heap_failure_invalid_argument = 9,
    NOK_heap_failure_invalid_allocation_type = 10,
    NOK_heap_failure_usage_after_free = 11,
    NOK_heap_failure_cross_heap_operation = 12,
    NOK_heap_failure_freelists_corruption = 13,
    NOK_heap_failure_listentry_corruption = 14,
    NOK_heap_failure_lfh_bitmap_mismatch = 15,
    NOK_heap_failure_segment_lfh_bitmap_corruption = 16,
    NOK_heap_failure_segment_lfh_double_free = 17,
    NOK_heap_failure_vs_subsegment_corruption = 18,
    NOK_heap_failure_null_heap = 19,
    NOK_heap_failure_allocation_limit = 20,
    NOK_heap_failure_commit_limit = 21,
    NOK_heap_failure_invalid_va_mgr_query = 22
}NOK_HEAP_FAILURE_TYPE, * NOK_PHEAP_FAILURE_TYPE;
//0x10 bytes (sizeof)
typedef struct _NOK_HEAP_ENTRY_EXTRA
{
    union
    {
        struct
        {
            USHORT AllocatorBackTraceIndex;                                 //0x0
            USHORT TagIndex;                                                //0x2
            ULONGLONG Settable;                                             //0x8
        };
        struct
        {
            ULONGLONG ZeroInit;                                             //0x0
            ULONGLONG ZeroInit1;                                            //0x8
        };
    };
}NOK_HEAP_ENTRY_EXTRA, * NOK_PHEAP_ENTRY_EXTRA;
//0x20 bytes (sizeof)
typedef struct _NOK_HEAP_FREE_ENTRY
{
    union
    {
        NOK_HEAP_ENTRY HeapEntry;                                       //0x0
        NOK_HEAP_UNPACKED_ENTRY UnpackedEntry;                          //0x0
        struct
        {
            VOID* PreviousBlockPrivateData;                                 //0x0
            union
            {
                struct
                {
                    USHORT Size;                                            //0x8
                    UCHAR Flags;                                            //0xa
                    UCHAR SmallTagIndex;                                    //0xb
                };
                struct
                {
                    ULONG SubSegmentCode;                                   //0x8
                    USHORT PreviousSize;                                    //0xc
                    union
                    {
                        UCHAR SegmentOffset;                                //0xe
                        UCHAR LFHFlags;                                     //0xe
                    };
                    UCHAR UnusedBytes;                                      //0xf
                };
                ULONGLONG CompactHeader;                                    //0x8
            };
        };
        NOK_HEAP_EXTENDED_ENTRY ExtendedEntry;                          //0x0
        struct
        {
            VOID* Reserved;                                                 //0x0
            union
            {
                struct
                {
                    USHORT FunctionIndex;                                   //0x8
                    USHORT ContextValue;                                    //0xa
                };
                ULONG InterceptorValue;                                     //0x8
            };
            USHORT UnusedBytesLength;                                       //0xc
            UCHAR EntryOffset;                                              //0xe
            UCHAR ExtendedBlockSignature;                                   //0xf
        };
        struct
        {
            VOID* ReservedForAlignment;                                     //0x0
            union
            {
                struct
                {
                    ULONG Code1;                                            //0x8
                    union
                    {
                        struct
                        {
                            USHORT Code2;                                   //0xc
                            UCHAR Code3;                                    //0xe
                            UCHAR Code4;                                    //0xf
                        };
                        ULONG Code234;                                      //0xc
                    };
                };
                ULONGLONG AgregateCode;                                     //0x8
            };
        };
    };
    NOK_LIST_ENTRY FreeList;                                            //0x10
}NOK_HEAP_FREE_ENTRY, * NOK_PHEAP_FREE_ENTRY;
//0x4 bytes (sizeof)
typedef struct _NOK_HEAP_GLOBAL_APPCOMPAT_FLAGS
{
    ULONG SafeInputValidation:1;                                            //0x0
    ULONG Padding:1;                                                        //0x0
    ULONG CommitLFHSubsegments:1;                                           //0x0
    ULONG AllocateHeapFromEnv:1;                                            //0x0
}NOK_HEAP_GLOBAL_APPCOMPAT_FLAGS, * NOK_PHEAP_GLOBAL_APPCOMPAT_FLAGS;
//0x8 bytes (sizeof)
typedef struct _NOK_HEAP_LFH_FAST_REF
{
    union
    {
        VOID* Target;                                                       //0x0
        ULONGLONG Value;                                                    //0x0
        ULONGLONG RefCount:12;                                              //0x0
    };
}NOK_HEAP_LFH_FAST_REF, * NOK_PHEAP_LFH_FAST_REF;
//0x8 bytes (sizeof)
typedef union _NOK_HEAP_LFH_SUBSEGMENT_DELAY_FREE
{
    ULONGLONG DelayFree:1;                                                  //0x0
    ULONGLONG Count:63;                                                     //0x0
    VOID* AllBits;                                                          //0x0
}NOK_HEAP_LFH_SUBSEGMENT_DELAY_FREE, * NOK_PHEAP_LFH_SUBSEGMENT_DELAY_FREE;
//0x4 bytes (sizeof)
typedef struct _NOK_HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS
{
    union
    {
        struct
        {
            USHORT BlockSize;                                               //0x0
            USHORT FirstBlockOffset;                                        //0x2
        };
        ULONG EncodedData;                                                  //0x0
    };
}NOK_HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS, * NOK_PHEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS;
//0x38 bytes (sizeof)
typedef struct _NOK_HEAP_LFH_SUBSEGMENT
{
    NOK_LIST_ENTRY ListEntry;                                           //0x0
    union
    {
        NOK_HEAP_LFH_SUBSEGMENT_OWNER* Owner;                           //0x10
        NOK_HEAP_LFH_SUBSEGMENT_DELAY_FREE DelayFree;                    //0x10
    };
    ULONGLONG CommitLock;                                                   //0x18
    union
    {
        struct
        {
            USHORT FreeCount;                                               //0x20
            USHORT BlockCount;                                              //0x22
        };
        volatile SHORT InterlockedShort;                                    //0x20
        volatile LONG InterlockedLong;                                      //0x20
    };
    USHORT FreeHint;                                                        //0x24
    UCHAR Location;                                                         //0x26
    UCHAR WitheldBlockCount;                                                //0x27
    NOK_HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS BlockOffsets;               //0x28
    UCHAR CommitUnitShift;                                                  //0x2c
    UCHAR CommitUnitCount;                                                  //0x2d
    USHORT CommitStateOffset;                                               //0x2e
    ULONGLONG BlockBitmap[1];                                               //0x30
}NOK_HEAP_LFH_SUBSEGMENT, * NOK_PHEAP_LFH_SUBSEGMENT;
//0x38 bytes (sizeof)
typedef struct _NOK_HEAP_LFH_SUBSEGMENT_OWNER
{
    UCHAR IsBucket:1;                                                       //0x0
    UCHAR Spare0:7;                                                         //0x0
    UCHAR BucketIndex;                                                      //0x1
    union
    {
        UCHAR SlotCount;                                                    //0x2
        UCHAR SlotIndex;                                                    //0x2
    };
    UCHAR Spare1;                                                           //0x3
    ULONGLONG AvailableSubsegmentCount;                                     //0x8
    ULONGLONG Lock;                                                         //0x10
    NOK_LIST_ENTRY AvailableSubsegmentList;                             //0x18
    NOK_LIST_ENTRY FullSubsegmentList;                                  //0x28
}NOK_HEAP_LFH_SUBSEGMENT_OWNER, * NOK_PHEAP_LFH_SUBSEGMENT_OWNER;
//0x18 bytes (sizeof)
typedef struct _NOK_RTL_HP_SEG_ALLOC_POLICY
{
    ULONGLONG MinLargePages;                                                //0x0
    ULONGLONG MaxLargePages;                                                //0x8
    UCHAR MinUtilization;                                                   //0x10
}NOK_RTL_HP_SEG_ALLOC_POLICY, * NOK_PRTL_HP_SEG_ALLOC_POLICY;
//0x2 bytes (sizeof)
typedef struct _NOK_HEAP_LFH_SUBSEGMENT_STAT
{
    UCHAR Index;                                                            //0x0
    UCHAR Count;                                                            //0x1
}NOK_HEAP_LFH_SUBSEGMENT_STAT, * NOK_PHEAP_LFH_SUBSEGMENT_STAT;
//0x28 bytes (sizeof)
typedef struct _NOK_HEAP_SUBALLOCATOR_CALLBACKS
{
    ULONGLONG Allocate;                                                     //0x0
    ULONGLONG Free;                                                         //0x8
    ULONGLONG Commit;                                                       //0x10
    ULONGLONG Decommit;                                                     //0x18
    ULONGLONG ExtendContext;                                                //0x20
}NOK_HEAP_SUBALLOCATOR_CALLBACKS, * NOK_PHEAP_SUBALLOCATOR_CALLBACKS;
//0x2 bytes (sizeof)
typedef struct _NOK_HEAP_LFH_UNUSED_BYTES_INFO
{
    union
    {
        struct
        {
            USHORT UnusedBytes:14;                                          //0x0
            USHORT ExtraPresent:1;                                          //0x0
            USHORT OneByteUnused:1;                                         //0x0
        };
        UCHAR Bytes[2];                                                     //0x0
    };
}NOK_HEAP_LFH_UNUSED_BYTES_INFO, * NOK_PHEAP_LFH_UNUSED_BYTES_INFO;
//0x4 bytes (sizeof)
typedef struct _NOK_RTL_HP_LFH_CONFIG
{
    USHORT MaxBlockSize;                                                    //0x0
    USHORT WitholdPageCrossingBlocks:1;                                     //0x2
    USHORT DisableRandomization:1;                                          //0x2
}NOK_RTL_HP_LFH_CONFIG, * NOK_PRTL_HP_LFH_CONFIG;
//0x38 bytes (sizeof)
typedef struct _NOK_HEAP_LIST_LOOKUP
{
    NOK_HEAP_LIST_LOOKUP* ExtendedLookup;                               //0x0
    ULONG ArraySize;                                                        //0x8
    ULONG ExtraItem;                                                        //0xc
    ULONG ItemCount;                                                        //0x10
    ULONG OutOfRangeItems;                                                  //0x14
    ULONG BaseIndex;                                                        //0x18
    NOK_PLIST_ENTRY ListHead;                                           //0x20
    ULONG* ListsInUseUlong;                                                 //0x28
    NOK_PLIST_ENTRY* ListHints;                                         //0x30
}NOK_HEAP_LIST_LOOKUP, * NOK_PHEAP_LIST_LOOKUP;
//0x4 bytes (sizeof)
typedef enum _NOK_EXT_IOMMU_TRANSLATION_TYPE
{
    NOK_ExtTranslationTypePassThrough = 0,
    NOK_ExtTranslationTypeBlocked = 1,
    NOK_ExtTranslationTypeTranslate = 2,
    NOK_ExtTranslationTypeSafePassThrough = 3,
    NOK_ExtTranslationTypeInvalid = 4
}NOK_EXT_IOMMU_TRANSLATION_TYPE, * NOK_PEXT_IOMMU_TRANSLATION_TYPE;
//0x10 bytes (sizeof)
typedef struct _NOK_HEAP_OPPORTUNISTIC_LARGE_PAGE_STATS
{
    volatile ULONGLONG SmallPagesInUseWithinLarge;                          //0x0
    volatile ULONGLONG OpportunisticLargePageCount;                         //0x8
}NOK_HEAP_OPPORTUNISTIC_LARGE_PAGE_STATS, * NOK_PHEAP_OPPORTUNISTIC_LARGE_PAGE_STATS;
//0x28 bytes (sizeof)
typedef struct _NOK_HEAP_LARGE_ALLOC_DATA
{
    NOK_RTL_BALANCED_NODE TreeNode;                                     //0x0
    union
    {
        ULONGLONG VirtualAddress;                                           //0x18
        ULONGLONG UnusedBytes:16;                                           //0x18
    };
    ULONGLONG ExtraPresent:1;                                               //0x20
    ULONGLONG GuardPageCount:1;                                             //0x20
    ULONGLONG GuardPageAlignment:6;                                         //0x20
    ULONGLONG Spare:4;                                                      //0x20
    ULONGLONG AllocatedPages:52;                                            //0x20
}NOK_HEAP_LARGE_ALLOC_DATA, * NOK_PHEAP_LARGE_ALLOC_DATA;
//0x40 bytes (sizeof)
typedef struct _NOK_RTL_CSPARSE_BITMAP
{
    ULONGLONG* CommitBitmap;                                                //0x0
    ULONGLONG* UserBitmap;                                                  //0x8
    ULONGLONG BitCount;                                                     //0x10
    ULONGLONG BitmapLock;                                                   //0x18
    ULONGLONG DecommitPageIndex;                                            //0x20
    ULONGLONG RtlpCSparseBitmapWakeLock;                                    //0x28
    UCHAR LockType;                                                         //0x30
    UCHAR AddressSpace;                                                     //0x31
    UCHAR MemType;                                                          //0x32
    UCHAR AllocAlignment;                                                   //0x33
    ULONG CommitDirectoryMaxSize;                                           //0x34
    ULONGLONG CommitDirectory[1];                                           //0x38
}NOK_RTL_CSPARSE_BITMAP, * NOK_PRTL_CSPARSE_BITMAP;
//0x80 bytes (sizeof)
typedef struct _NOK_ETW_STACK_TRACE_BLOCK
{
    NOK_LARGE_INTEGER RelatedTimestamp;                                  //0x0
    NOK_PETHREAD Thread;                                                //0x8
    NOK_KDPC StackWalkDpc;                                              //0x10
    NOK_SLIST_HEADER ApcListHead;                                        //0x50
    NOK_PETW_APC_ENTRY ApcEntry;                                        //0x60
    ULONG ApcEntryCount;                                                    //0x68
    LONG Flags;                                                             //0x6c
    LONG ApcCount;                                                          //0x70
    LONG MaxApcCount;                                                       //0x74
}NOK_ETW_STACK_TRACE_BLOCK, * NOK_PETW_STACK_TRACE_BLOCK;
//0x40 bytes (sizeof)
typedef struct _NOK_HEAP_LFH_AFFINITY_SLOT
{
    NOK_HEAP_LFH_SUBSEGMENT_OWNER State;                                //0x0
    NOK_HEAP_LFH_FAST_REF ActiveSubsegment;                             //0x38
}NOK_HEAP_LFH_AFFINITY_SLOT, * NOK_PHEAP_LFH_AFFINITY_SLOT;
//0x4 bytes (sizeof)
typedef struct _NOK_HEAP_STOP_ON_TAG
{
    union
    {
        ULONG HeapAndTagIndex;                                              //0x0
        struct
        {
            USHORT TagIndex;                                                //0x0
            USHORT HeapIndex;                                               //0x2
        };
    };
}NOK_HEAP_STOP_ON_TAG, * NOK_PHEAP_STOP_ON_TAG;
//0x50 bytes (sizeof)
typedef struct _NOK_RTL_SPARSE_ARRAY
{
    ULONGLONG ElementCount;                                                 //0x0
    ULONG ElementSizeShift;                                                 //0x8
    NOK_RTL_CSPARSE_BITMAP Bitmap;                                      //0x10
}NOK_RTL_SPARSE_ARRAY, * NOK_PRTL_SPARSE_ARRAY;
//0x30 bytes (sizeof)
typedef struct _NOK_HEAP_STOP_ON_VALUES
{
    ULONGLONG AllocAddress;                                                 //0x0
    NOK_HEAP_STOP_ON_TAG AllocTag;                                      //0x8
    ULONGLONG ReAllocAddress;                                               //0x10
    NOK_HEAP_STOP_ON_TAG ReAllocTag;                                    //0x18
    ULONGLONG FreeAddress;                                                  //0x20
    NOK_HEAP_STOP_ON_TAG FreeTag;                                       //0x28
}NOK_HEAP_STOP_ON_VALUES, * NOK_PHEAP_STOP_ON_VALUES;
//0x30 bytes (sizeof)
typedef struct _NOK_HEAP_UCR_DESCRIPTOR
{
    NOK_LIST_ENTRY ListEntry;                                           //0x0
    NOK_LIST_ENTRY SegmentEntry;                                        //0x10
    VOID* Address;                                                          //0x20
    ULONGLONG Size;                                                         //0x28
}NOK_HEAP_UCR_DESCRIPTOR, * NOK_PHEAP_UCR_DESCRIPTOR;
//0x80 bytes (sizeof)
typedef struct _NOK_GENERAL_LOOKASIDE
{
    union
    {
        NOK_SLIST_HEADER ListHead;                                       //0x0
        NOK_SINGLE_LIST_ENTRY SingleListHead;                           //0x0
    };
    USHORT Depth;                                                           //0x10
    USHORT MaximumDepth;                                                    //0x12
    ULONG TotalAllocates;                                                   //0x14
    union
    {
        ULONG AllocateMisses;                                               //0x18
        ULONG AllocateHits;                                                 //0x18
    };
    ULONG TotalFrees;                                                       //0x1c
    union
    {
        ULONG FreeMisses;                                                   //0x20
        ULONG FreeHits;                                                     //0x20
    };
    NOK_POOL_TYPE Type;                                                   //0x24
    ULONG Tag;                                                              //0x28
    ULONG Size;                                                             //0x2c
    union
    {
        VOID* (*AllocateEx)(NOK_POOL_TYPE arg1, ULONGLONG arg2, ULONG arg3, NOK_PLOOKASIDE_LIST_EX arg4); //0x30
        VOID* (*Allocate)(NOK_POOL_TYPE arg1, ULONGLONG arg2, ULONG arg3); //0x30
    };
    union
    {
        VOID (*FreeEx)(VOID* arg1, NOK_PLOOKASIDE_LIST_EX arg2);        //0x38
        VOID (*Free)(VOID* arg1);                                           //0x38
    };
    NOK_LIST_ENTRY ListEntry;                                           //0x40
