#include <windef.h>
#ifndef WINDOWS_10_21H2_X64_H
#define WINDOWS_10_21H2_X64_H
//0x8 bytes (sizeof)
struct BATTERY_REPORTING_SCALE
{
    ULONG Granularity;                                                      //0x0
    ULONG Capacity;                                                         //0x4
}; 
//0x18 bytes (sizeof)
struct CMP_OFFSET_ARRAY
{
    ULONG FileOffset;                                                       //0x0
    VOID* DataBuffer;                                                       //0x8
    ULONG DataLength;                                                       //0x10
}; 
//0x18 bytes (sizeof)
struct DEBUG_DEVICE_ADDRESS
{
    UCHAR Type;                                                             //0x0
    UCHAR Valid;                                                            //0x1
    union
    {
        UCHAR Reserved[2];                                                  //0x2
        struct
        {
            UCHAR BitWidth;                                                 //0x2
            UCHAR AccessSize;                                               //0x3
        };
    };
    UCHAR* TranslatedAddress;                                               //0x8
    ULONG Length;                                                           //0x10
}; 
//0x20 bytes (sizeof)
struct DEBUG_MEMORY_REQUIREMENTS
{
    union _LARGE_INTEGER Start;                                             //0x0
    union _LARGE_INTEGER MaxEnd;                                            //0x8
    VOID* VirtualAddress;                                                   //0x10
    ULONG Length;                                                           //0x18
    UCHAR Cached;                                                           //0x1c
    UCHAR Aligned;                                                          //0x1d
}; 
//0x30 bytes (sizeof)
struct DOCK_INTERFACE
{
    USHORT Size;                                                            //0x0
    USHORT Version;                                                         //0x2
    VOID* Context;                                                          //0x8
    VOID (*InterfaceReference)(VOID* arg1);                                 //0x10
    VOID (*InterfaceDereference)(VOID* arg1);                               //0x18
    ULONG (*ProfileDepartureSetMode)(VOID* arg1, enum PROFILE_DEPARTURE_STYLE arg2); //0x20
    ULONG (*ProfileDepartureUpdate)(VOID* arg1);                            //0x28
}; 
//0x68 bytes (sizeof)
struct FEATURE_ERROR
{
    HRESULT hr;                                                             //0x0
    USHORT lineNumber;                                                      //0x4
    CHAR* file;                                                             //0x8
    CHAR* process;                                                          //0x10
    CHAR* modulePath;                                                       //0x18
    ULONG callerReturnAddressOffset;                                        //0x20
    CHAR* callerModule;                                                     //0x28
    CHAR* message;                                                          //0x30
    USHORT originLineNumber;                                                //0x38
    CHAR* originFile;                                                       //0x40
    CHAR* originModule;                                                     //0x48
    ULONG originCallerReturnAddressOffset;                                  //0x50
    CHAR* originCallerModule;                                               //0x58
    CHAR* originName;                                                       //0x60
};
//0x6 bytes (sizeof)
struct FEATURE_LOGGED_TRAITS
{
    USHORT version;                                                         //0x0
    USHORT baseVersion;                                                     //0x2
    UCHAR stage;                                                            //0x4
};
//0x4 bytes (sizeof)
struct FEATURE_STATE_CHANGE_SUBSCRIPTION__
{
    LONG unused;                                                            //0x0
};
//0x4b0 bytes (sizeof)
struct HAL_PRIVATE_DISPATCH
{
    ULONG Version;                                                          //0x0
    struct _BUS_HANDLER* (*HalHandlerForBus)(enum _INTERFACE_TYPE arg1, ULONG arg2); //0x8
    struct _BUS_HANDLER* (*HalHandlerForConfigSpace)(enum _BUS_DATA_TYPE arg1, ULONG arg2); //0x10
    VOID (*HalLocateHiberRanges)(VOID* arg1);                               //0x18
    LONG (*HalRegisterBusHandler)(enum _INTERFACE_TYPE arg1, enum _BUS_DATA_TYPE arg2, ULONG arg3, enum _INTERFACE_TYPE arg4, ULONG arg5, ULONG arg6, LONG (*arg7)(struct _BUS_HANDLER* arg1), struct _BUS_HANDLER** arg8); //0x20
    VOID (*HalSetWakeEnable)(UCHAR arg1);                                   //0x28
    LONG (*HalSetWakeAlarm)(ULONGLONG arg1, ULONGLONG arg2);                //0x30
    UCHAR (*HalPciTranslateBusAddress)(enum _INTERFACE_TYPE arg1, ULONG arg2, union _LARGE_INTEGER arg3, ULONG* arg4, union _LARGE_INTEGER* arg5); //0x38
    LONG (*HalPciAssignSlotResources)(struct _UNICODE_STRING* arg1, struct _UNICODE_STRING* arg2, struct _DRIVER_OBJECT* arg3, struct _DEVICE_OBJECT* arg4, enum _INTERFACE_TYPE arg5, ULONG arg6, ULONG arg7, struct _CM_RESOURCE_LIST** arg8); //0x40
    VOID (*HalHaltSystem)();                                                //0x48
    UCHAR (*HalFindBusAddressTranslation)(union _LARGE_INTEGER arg1, ULONG* arg2, union _LARGE_INTEGER* arg3, ULONGLONG* arg4, UCHAR arg5); //0x50
    UCHAR (*HalResetDisplay)();                                             //0x58
    LONG (*HalAllocateMapRegisters)(struct _ADAPTER_OBJECT* arg1, ULONG arg2, ULONG arg3, struct _MAP_REGISTER_ENTRY* arg4); //0x60
    LONG (*KdSetupPciDeviceForDebugging)(VOID* arg1, struct _DEBUG_DEVICE_DESCRIPTOR* arg2); //0x68
    LONG (*KdReleasePciDeviceForDebugging)(struct _DEBUG_DEVICE_DESCRIPTOR* arg1); //0x70
    VOID* (*KdGetAcpiTablePhase0)(struct _LOADER_PARAMETER_BLOCK* arg1, ULONG arg2); //0x78
    VOID (*KdCheckPowerButton)();                                           //0x80
    UCHAR (*HalVectorToIDTEntry)(ULONG arg1);                               //0x88
    VOID* (*KdMapPhysicalMemory64)(union _LARGE_INTEGER arg1, ULONG arg2, UCHAR arg3); //0x90
    VOID (*KdUnmapVirtualAddress)(VOID* arg1, ULONG arg2, UCHAR arg3);      //0x98
    ULONG (*KdGetPciDataByOffset)(ULONG arg1, ULONG arg2, VOID* arg3, ULONG arg4, ULONG arg5); //0xa0
    ULONG (*KdSetPciDataByOffset)(ULONG arg1, ULONG arg2, VOID* arg3, ULONG arg4, ULONG arg5); //0xa8
    ULONG (*HalGetInterruptVectorOverride)(enum _INTERFACE_TYPE arg1, ULONG arg2, ULONG arg3, ULONG arg4, UCHAR* arg5, ULONGLONG* arg6); //0xb0
    LONG (*HalGetVectorInputOverride)(ULONG arg1, struct _GROUP_AFFINITY* arg2, ULONG* arg3, enum _KINTERRUPT_POLARITY* arg4, struct _INTERRUPT_REMAPPING_INFO* arg5); //0xb8
    LONG (*HalLoadMicrocode)(VOID* arg1);                                   //0xc0
    LONG (*HalUnloadMicrocode)();                                           //0xc8
    LONG (*HalPostMicrocodeUpdate)();                                       //0xd0
    LONG (*HalAllocateMessageTargetOverride)(struct _DEVICE_OBJECT* arg1, struct _GROUP_AFFINITY* arg2, ULONG arg3, enum _KINTERRUPT_MODE arg4, UCHAR arg5, ULONG* arg6, UCHAR* arg7, ULONG* arg8); //0xd8
    VOID (*HalFreeMessageTargetOverride)(struct _DEVICE_OBJECT* arg1, ULONG arg2, struct _GROUP_AFFINITY* arg3); //0xe0
    LONG (*HalDpReplaceBegin)(struct _HAL_DP_REPLACE_PARAMETERS* arg1, VOID** arg2); //0xe8
    VOID (*HalDpReplaceTarget)(VOID* arg1);                                 //0xf0
    LONG (*HalDpReplaceControl)(ULONG arg1, VOID* arg2);                    //0xf8
    VOID (*HalDpReplaceEnd)(VOID* arg1);                                    //0x100
    VOID (*HalPrepareForBugcheck)(ULONG arg1);                              //0x108
    UCHAR (*HalQueryWakeTime)(ULONGLONG* arg1, ULONGLONG* arg2);            //0x110
    VOID (*HalReportIdleStateUsage)(UCHAR arg1, struct _KAFFINITY_EX* arg2); //0x118
    VOID (*HalTscSynchronization)(UCHAR arg1, ULONG* arg2);                 //0x120
    LONG (*HalWheaInitProcessorGenericSection)(struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR* arg1, struct _WHEA_PROCESSOR_GENERIC_ERROR_SECTION* arg2); //0x128
    VOID (*HalStopLegacyUsbInterrupts)(enum _SYSTEM_POWER_STATE arg1);      //0x130
    LONG (*HalReadWheaPhysicalMemory)(union _LARGE_INTEGER arg1, ULONG arg2, VOID* arg3); //0x138
    LONG (*HalWriteWheaPhysicalMemory)(union _LARGE_INTEGER arg1, ULONG arg2, VOID* arg3); //0x140
    LONG (*HalDpMaskLevelTriggeredInterrupts)();                            //0x148
    LONG (*HalDpUnmaskLevelTriggeredInterrupts)();                          //0x150
    LONG (*HalDpGetInterruptReplayState)(VOID* arg1, VOID** arg2);          //0x158
    LONG (*HalDpReplayInterrupts)(VOID* arg1);                              //0x160
    UCHAR (*HalQueryIoPortAccessSupported)();                               //0x168
    LONG (*KdSetupIntegratedDeviceForDebugging)(VOID* arg1, struct _DEBUG_DEVICE_DESCRIPTOR* arg2); //0x170
    LONG (*KdReleaseIntegratedDeviceForDebugging)(struct _DEBUG_DEVICE_DESCRIPTOR* arg1); //0x178
    VOID (*HalGetEnlightenmentInformation)(struct _HAL_INTEL_ENLIGHTENMENT_INFORMATION* arg1); //0x180
    VOID* (*HalAllocateEarlyPages)(struct _LOADER_PARAMETER_BLOCK* arg1, ULONG arg2, ULONGLONG* arg3, ULONG arg4); //0x188
    VOID* (*HalMapEarlyPages)(ULONGLONG arg1, ULONG arg2, ULONG arg3);      //0x190
    VOID* Dummy1;                                                           //0x198
    VOID* Dummy2;                                                           //0x1a0
    VOID (*HalNotifyProcessorFreeze)(UCHAR arg1, UCHAR arg2);               //0x1a8
    LONG (*HalPrepareProcessorForIdle)(ULONG arg1);                         //0x1b0
    VOID (*HalRegisterLogRoutine)(struct _HAL_LOG_REGISTER_CONTEXT* arg1);  //0x1b8
    VOID (*HalResumeProcessorFromIdle)();                                   //0x1c0
    VOID* Dummy;                                                            //0x1c8
    ULONG (*HalVectorToIDTEntryEx)(ULONG arg1);                             //0x1d0
    LONG (*HalSecondaryInterruptQueryPrimaryInformation)(struct _INTERRUPT_VECTOR_DATA* arg1, ULONG* arg2); //0x1d8
    LONG (*HalMaskInterrupt)(ULONG arg1, ULONG arg2);                       //0x1e0
    LONG (*HalUnmaskInterrupt)(ULONG arg1, ULONG arg2);                     //0x1e8
    UCHAR (*HalIsInterruptTypeSecondary)(ULONG arg1, ULONG arg2);           //0x1f0
    LONG (*HalAllocateGsivForSecondaryInterrupt)(CHAR* arg1, USHORT arg2, ULONG* arg3); //0x1f8
    LONG (*HalAddInterruptRemapping)(ULONG arg1, ULONG arg2, struct _PCI_BUSMASTER_DESCRIPTOR* arg3, UCHAR arg4, struct _INTERRUPT_VECTOR_DATA* arg5, ULONG arg6); //0x200
    VOID (*HalRemoveInterruptRemapping)(ULONG arg1, ULONG arg2, struct _PCI_BUSMASTER_DESCRIPTOR* arg3, UCHAR arg4, struct _INTERRUPT_VECTOR_DATA* arg5, ULONG arg6); //0x208
    VOID (*HalSaveAndDisableHvEnlightenment)();                             //0x210
    VOID (*HalRestoreHvEnlightenment)();                                    //0x218
    VOID (*HalFlushIoBuffersExternalCache)(struct _MDL* arg1, UCHAR arg2);  //0x220
    VOID (*HalFlushExternalCache)(UCHAR arg1);                              //0x228
    LONG (*HalPciEarlyRestore)(enum _SYSTEM_POWER_STATE arg1);              //0x230
    LONG (*HalGetProcessorId)(ULONG arg1, ULONG* arg2, ULONG* arg3);        //0x238
    LONG (*HalAllocatePmcCounterSet)(ULONG arg1, enum _KPROFILE_SOURCE* arg2, ULONG arg3, struct _HAL_PMC_COUNTERS** arg4); //0x240
    VOID (*HalCollectPmcCounters)(struct _HAL_PMC_COUNTERS* arg1, ULONGLONG* arg2); //0x248
    VOID (*HalFreePmcCounterSet)(struct _HAL_PMC_COUNTERS* arg1);           //0x250
    LONG (*HalProcessorHalt)(ULONG arg1, VOID* arg2, LONG (*arg3)(VOID* arg1)); //0x258
    ULONGLONG (*HalTimerQueryCycleCounter)(ULONGLONG* arg1);                //0x260
    VOID* Dummy3;                                                           //0x268
    VOID (*HalPciMarkHiberPhase)();                                         //0x270
    LONG (*HalQueryProcessorRestartEntryPoint)(union _LARGE_INTEGER* arg1); //0x278
    LONG (*HalRequestInterrupt)(ULONG arg1);                                //0x280
    LONG (*HalEnumerateUnmaskedInterrupts)(UCHAR (*arg1)(VOID* arg1, struct _HAL_UNMASKED_INTERRUPT_INFORMATION* arg2), VOID* arg2, struct _HAL_UNMASKED_INTERRUPT_INFORMATION* arg3); //0x288
    VOID (*HalFlushAndInvalidatePageExternalCache)(union _LARGE_INTEGER arg1); //0x290
    LONG (*KdEnumerateDebuggingDevices)(VOID* arg1, struct _DEBUG_DEVICE_DESCRIPTOR* arg2, enum KD_CALLBACK_ACTION (*arg3)(struct _DEBUG_DEVICE_DESCRIPTOR* arg1)); //0x298
    VOID (*HalFlushIoRectangleExternalCache)(struct _MDL* arg1, ULONG arg2, ULONG arg3, ULONG arg4, ULONG arg5, UCHAR arg6); //0x2a0
    VOID (*HalPowerEarlyRestore)(ULONG arg1);                               //0x2a8
    LONG (*HalQueryCapsuleCapabilities)(VOID* arg1, ULONG arg2, ULONGLONG* arg3, ULONG* arg4); //0x2b0
    LONG (*HalUpdateCapsule)(VOID* arg1, ULONG arg2, union _LARGE_INTEGER arg3); //0x2b8
    UCHAR (*HalPciMultiStageResumeCapable)();                               //0x2c0
    VOID (*HalDmaFreeCrashDumpRegisters)(ULONG arg1);                       //0x2c8
    UCHAR (*HalAcpiAoacCapable)();                                          //0x2d0
    LONG (*HalInterruptSetDestination)(struct _INTERRUPT_VECTOR_DATA* arg1, struct _GROUP_AFFINITY* arg2, ULONG* arg3); //0x2d8
    VOID (*HalGetClockConfiguration)(struct _HAL_CLOCK_TIMER_CONFIGURATION* arg1); //0x2e0
    VOID (*HalClockTimerActivate)(UCHAR arg1);                              //0x2e8
    VOID (*HalClockTimerInitialize)();                                      //0x2f0
    VOID (*HalClockTimerStop)();                                            //0x2f8
    LONG (*HalClockTimerArm)(enum _HAL_CLOCK_TIMER_MODE arg1, ULONGLONG arg2, ULONGLONG* arg3); //0x300
    UCHAR (*HalTimerOnlyClockInterruptPending)();                           //0x308
    VOID* (*HalAcpiGetMultiNode)();                                         //0x310
    VOID (*)(ULONG arg1, volatile LONG* arg2)(*HalPowerSetRebootHandler)(VOID (*arg1)(ULONG arg1, volatile LONG* arg2)); //0x318
    VOID (*HalIommuRegisterDispatchTable)(struct _HAL_IOMMU_DISPATCH* arg1); //0x320
    VOID (*HalTimerWatchdogStart)();                                        //0x328
    VOID (*HalTimerWatchdogResetCountdown)();                               //0x330
    VOID (*HalTimerWatchdogStop)();                                         //0x338
    UCHAR (*HalTimerWatchdogGeneratedLastReset)();                          //0x340
    LONG (*HalTimerWatchdogTriggerSystemReset)(UCHAR arg1);                 //0x348
    LONG (*HalInterruptVectorDataToGsiv)(struct _INTERRUPT_VECTOR_DATA* arg1, ULONG* arg2); //0x350
    LONG (*HalInterruptGetHighestPriorityInterrupt)(ULONG* arg1, UCHAR* arg2); //0x358
    LONG (*HalProcessorOn)(ULONG arg1);                                     //0x360
    LONG (*HalProcessorOff)();                                              //0x368
    LONG (*HalProcessorFreeze)();                                           //0x370
    LONG (*HalDmaLinkDeviceObjectByToken)(ULONGLONG arg1, struct _DEVICE_OBJECT* arg2); //0x378
    LONG (*HalDmaCheckAdapterToken)(ULONGLONG arg1);                        //0x380
    VOID* Dummy4;                                                           //0x388
    LONG (*HalTimerConvertPerformanceCounterToAuxiliaryCounter)(ULONGLONG arg1, ULONGLONG* arg2, ULONGLONG* arg3); //0x390
    LONG (*HalTimerConvertAuxiliaryCounterToPerformanceCounter)(ULONGLONG arg1, ULONGLONG* arg2, ULONGLONG* arg3); //0x398
    LONG (*HalTimerQueryAuxiliaryCounterFrequency)(ULONGLONG* arg1);        //0x3a0
    LONG (*HalConnectThermalInterrupt)(UCHAR (*arg1)(struct _KINTERRUPT* arg1, VOID* arg2)); //0x3a8
    UCHAR (*HalIsEFIRuntimeActive)();                                       //0x3b0
    UCHAR (*HalTimerQueryAndResetRtcErrors)(UCHAR arg1);                    //0x3b8
    VOID (*HalAcpiLateRestore)();                                           //0x3c0
    LONG (*KdWatchdogDelayExpiration)(ULONGLONG* arg1);                     //0x3c8
    LONG (*HalGetProcessorStats)(enum _HAL_PROCESSOR_STAT_TYPE arg1, ULONG arg2, ULONG arg3, ULONGLONG* arg4); //0x3d0
    ULONGLONG (*HalTimerWatchdogQueryDueTime)(UCHAR arg1);                  //0x3d8
    LONG (*HalConnectSyntheticInterrupt)(UCHAR (*arg1)(struct _KINTERRUPT* arg1, VOID* arg2)); //0x3e0
    VOID (*HalPreprocessNmi)(ULONG arg1);                                   //0x3e8
    LONG (*HalEnumerateEnvironmentVariablesWithFilter)(ULONG arg1, UCHAR (*arg2)(struct _GUID* arg1, WCHAR* arg2), VOID* arg3, ULONG* arg4); //0x3f0
    LONG (*HalCaptureLastBranchRecordStack)(ULONG arg1, struct _HAL_LBR_ENTRY* arg2, ULONG* arg3); //0x3f8
    UCHAR (*HalClearLastBranchRecordStack)();                               //0x400
    LONG (*HalConfigureLastBranchRecord)(ULONG arg1, ULONG arg2);           //0x408
    UCHAR (*HalGetLastBranchInformation)(ULONG* arg1, ULONG* arg2);         //0x410
    VOID (*HalResumeLastBranchRecord)(UCHAR arg1);                          //0x418
    LONG (*HalStartLastBranchRecord)(ULONG arg1, ULONG* arg2);              //0x420
    LONG (*HalStopLastBranchRecord)(ULONG arg1);                            //0x428
    LONG (*HalIommuBlockDevice)(VOID* arg1);                                //0x430
    LONG (*HalIommuUnblockDevice)(struct _EXT_IOMMU_DEVICE_ID* arg1, VOID** arg2); //0x438
    LONG (*HalGetIommuInterface)(ULONG arg1, struct _DMA_IOMMU_INTERFACE* arg2); //0x440
    LONG (*HalRequestGenericErrorRecovery)(VOID* arg1, ULONG* arg2);        //0x448
    LONG (*HalTimerQueryHostPerformanceCounter)(ULONGLONG* arg1);           //0x450
    LONG (*HalTopologyQueryProcessorRelationships)(ULONG arg1, ULONG arg2, UCHAR* arg3, UCHAR* arg4, UCHAR* arg5, ULONG* arg6, ULONG* arg7); //0x458
    VOID (*HalInitPlatformDebugTriggers)();                                 //0x460
    VOID (*HalRunPlatformDebugTriggers)(UCHAR arg1);                        //0x468
    VOID* (*HalTimerGetReferencePage)();                                    //0x470
    LONG (*HalGetHiddenProcessorPowerInterface)(struct _HIDDEN_PROCESSOR_POWER_INTERFACE* arg1); //0x478
    ULONG (*HalGetHiddenProcessorPackageId)(ULONG arg1);                    //0x480
    ULONG (*HalGetHiddenPackageProcessorCount)(ULONG arg1);                 //0x488
    LONG (*HalGetHiddenProcessorApicIdByIndex)(ULONG arg1, ULONG* arg2);    //0x490
    LONG (*HalRegisterHiddenProcessorIdleState)(ULONG arg1, ULONGLONG arg2); //0x498
    VOID (*HalIommuReportIommuFault)(ULONGLONG arg1, struct _FAULT_INFORMATION* arg2); //0x4a0
    UCHAR (*HalIommuDmaRemappingCapable)(struct _EXT_IOMMU_DEVICE_ID* arg1, ULONG* arg2); //0x4a8
};
//0x8 bytes (sizeof)
struct LIST_ENTRY32
{
    ULONG Flink;                                                            //0x0
    ULONG Blink;                                                            //0x4
}; 
//0x10 bytes (sizeof)
struct LIST_ENTRY64
{
    ULONGLONG Flink;                                                        //0x0
    ULONGLONG Blink;                                                        //0x8
}; 
//0x4 bytes (sizeof)
struct PEPHANDLE__
{
    LONG unused;                                                            //0x0
}; 
//0x4 bytes (sizeof)
struct POHANDLE__
{
    LONG unused;                                                            //0x0
}; 
//0xc bytes (sizeof)
struct POWER_ACTION_POLICY
{
    enum POWER_ACTION Action;                                               //0x0
    ULONG Flags;                                                            //0x4
    ULONG EventCode;                                                        //0x8
}; 
//0x3e0 bytes (sizeof)
struct PO_MEMORY_IMAGE
{
    ULONG Signature;                                                        //0x0
    ULONG ImageType;                                                        //0x4
    ULONG CheckSum;                                                         //0x8
    ULONG LengthSelf;                                                       //0xc
    ULONGLONG PageSelf;                                                     //0x10
    ULONG PageSize;                                                         //0x18
    union _LARGE_INTEGER SystemTime;                                        //0x20
    ULONGLONG InterruptTime;                                                //0x28
    ULONGLONG FeatureFlags;                                                 //0x30
    UCHAR HiberFlags;                                                       //0x38
    UCHAR HiberSimulateFlags;                                               //0x39
    UCHAR spare[2];                                                         //0x3a
    ULONG NoHiberPtes;                                                      //0x3c
    ULONGLONG HiberVa;                                                      //0x40
    ULONG NoFreePages;                                                      //0x48
    ULONG FreeMapCheck;                                                     //0x4c
    ULONG WakeCheck;                                                        //0x50
    ULONGLONG NumPagesForLoader;                                            //0x58
    ULONGLONG FirstSecureRestorePage;                                       //0x60
    ULONGLONG FirstBootRestorePage;                                         //0x68
    ULONGLONG FirstKernelRestorePage;                                       //0x70
    ULONGLONG FirstChecksumRestorePage;                                     //0x78
    ULONGLONG NoChecksumEntries;                                            //0x80
    struct _PO_HIBER_PERF PerfInfo;                                         //0x88
    ULONG FirmwareRuntimeInformationPages;                                  //0x280
    ULONGLONG FirmwareRuntimeInformation[1];                                //0x288
    ULONG SpareUlong;                                                       //0x290
    ULONG NoBootLoaderLogPages;                                             //0x294
    ULONGLONG BootLoaderLogPages[24];                                       //0x298
    ULONG NotUsed;                                                          //0x358
    ULONG ResumeContextCheck;                                               //0x35c
    ULONG ResumeContextPages;                                               //0x360
    UCHAR Hiberboot;                                                        //0x364
    UCHAR SecureLaunched;                                                   //0x365
    UCHAR SecureBoot;                                                       //0x366
    ULONGLONG HvPageTableRoot;                                              //0x368
    ULONGLONG HvEntryPoint;                                                 //0x370
    ULONGLONG HvReservedTransitionAddress;                                  //0x378
    ULONGLONG HvReservedTransitionAddressSize;                              //0x380
    ULONGLONG BootFlags;                                                    //0x388
    ULONGLONG RestoreProcessorStateRoutine;                                 //0x390
    ULONGLONG HighestPhysicalPage;                                          //0x398
    ULONGLONG BitlockerKeyPfns[4];                                          //0x3a0
    ULONG HardwareSignature;                                                //0x3c0
    union _LARGE_INTEGER SMBiosTablePhysicalAddress;                        //0x3c8
    ULONG SMBiosTableLength;                                                //0x3d0
    UCHAR SMBiosMajorVersion;                                               //0x3d4
    UCHAR SMBiosMinorVersion;                                               //0x3d5
    UCHAR HiberResumeXhciHandoffSkip;                                       //0x3d6
    UCHAR InitializeUSBCore;                                                //0x3d7
    UCHAR ValidUSBCoreId;                                                   //0x3d8
    UCHAR USBCoreId;                                                        //0x3d9
    UCHAR SkipMemoryMapValidation;                                          //0x3da
}; 
//0x8 bytes (sizeof)
struct PROCESSOR_IDLESTATE_INFO
{
    ULONG TimeCheck;                                                        //0x0
    UCHAR DemotePercent;                                                    //0x4
    UCHAR PromotePercent;                                                   //0x5
    UCHAR Spare[2];                                                         //0x6
}; 
//0x20 bytes (sizeof)
struct PROCESSOR_IDLESTATE_POLICY
{
    USHORT Revision;                                                        //0x0
    union
    {
        USHORT AsUSHORT;                                                    //0x2
        USHORT AllowScaling:1;                                              //0x2
        USHORT Disabled:1;                                                  //0x2
        USHORT Reserved:14;                                                 //0x2
    } Flags;                                                                //0x2
    ULONG PolicyCount;                                                      //0x4
    struct PROCESSOR_IDLESTATE_INFO Policy[3];                              //0x8
};
//0x1c bytes (sizeof)
struct PROCESSOR_PERFSTATE_POLICY
{
    ULONG Revision;                                                         //0x0
    UCHAR MaxThrottle;                                                      //0x4
    UCHAR MinThrottle;                                                      //0x5
    UCHAR BusyAdjThreshold;                                                 //0x6
    union
    {
        UCHAR Spare;                                                        //0x7
        union
        {
            UCHAR AsUCHAR;                                                  //0x7
            UCHAR NoDomainAccounting:1;                                     //0x7
            UCHAR IncreasePolicy:2;                                         //0x7
            UCHAR DecreasePolicy:2;                                         //0x7
            UCHAR Reserved:3;                                               //0x7
        } Flags;                                                            //0x7
    };
    ULONG TimeCheck;                                                        //0x8
    ULONG IncreaseTime;                                                     //0xc
    ULONG DecreaseTime;                                                     //0x10
    ULONG IncreasePercent;                                                  //0x14
    ULONG DecreasePercent;                                                  //0x18
};
//0x10 bytes (sizeof)
struct RTL_HP_ENV_HANDLE
{
    VOID* h[2];                                                             //0x0
}; 
//0x4c bytes (sizeof)
struct SYSTEM_POWER_CAPABILITIES
{
    UCHAR PowerButtonPresent;                                               //0x0
    UCHAR SleepButtonPresent;                                               //0x1
    UCHAR LidPresent;                                                       //0x2
    UCHAR SystemS1;                                                         //0x3
    UCHAR SystemS2;                                                         //0x4
    UCHAR SystemS3;                                                         //0x5
    UCHAR SystemS4;                                                         //0x6
    UCHAR SystemS5;                                                         //0x7
    UCHAR HiberFilePresent;                                                 //0x8
    UCHAR FullWake;                                                         //0x9
    UCHAR VideoDimPresent;                                                  //0xa
    UCHAR ApmPresent;                                                       //0xb
    UCHAR UpsPresent;                                                       //0xc
    UCHAR ThermalControl;                                                   //0xd
    UCHAR ProcessorThrottle;                                                //0xe
    UCHAR ProcessorMinThrottle;                                             //0xf
    UCHAR ProcessorMaxThrottle;                                             //0x10
    UCHAR FastSystemS4;                                                     //0x11
    UCHAR Hiberboot;                                                        //0x12
    UCHAR WakeAlarmPresent;                                                 //0x13
    UCHAR AoAc;                                                             //0x14
    UCHAR DiskSpinDown;                                                     //0x15
    UCHAR HiberFileType;                                                    //0x16
    UCHAR AoAcConnectivitySupported;                                        //0x17
    UCHAR spare3[6];                                                        //0x18
    UCHAR SystemBatteriesPresent;                                           //0x1e
    UCHAR BatteriesAreShortTerm;                                            //0x1f
    struct BATTERY_REPORTING_SCALE BatteryScale[3];                         //0x20
    enum _SYSTEM_POWER_STATE AcOnLineWake;                                  //0x38
    enum _SYSTEM_POWER_STATE SoftLidWake;                                   //0x3c
    enum _SYSTEM_POWER_STATE RtcWake;                                       //0x40
    enum _SYSTEM_POWER_STATE MinDeviceWakeState;                            //0x44
    enum _SYSTEM_POWER_STATE DefaultLowLatencyWake;                         //0x48
}; 
//0x18 bytes (sizeof)
struct SYSTEM_POWER_LEVEL
{
    UCHAR Enable;                                                           //0x0
    UCHAR Spare[3];                                                         //0x1
    ULONG BatteryLevel;                                                     //0x4
    struct POWER_ACTION_POLICY PowerPolicy;                                 //0x8
    enum _SYSTEM_POWER_STATE MinSystemState;                                //0x14
}; 
//0x20 bytes (sizeof)
struct VACB_LEVEL_ALLOCATION_LIST
{
    struct _LIST_ENTRY VacbLevelList;                                       //0x0
    VOID* VacbLevelWithBcbListHeads;                                        //0x10
    ULONG VacbLevelsAllocated;                                              //0x18
};
//0x80 bytes (sizeof)
struct _ACCESS_REASONS
{
    ULONG Data[32];                                                         //0x0
}; 
//0xa0 bytes (sizeof)
struct _ACCESS_STATE
{
    struct _LUID OperationID;                                               //0x0
    UCHAR SecurityEvaluated;                                                //0x8
    UCHAR GenerateAudit;                                                    //0x9
    UCHAR GenerateOnClose;                                                  //0xa
    UCHAR PrivilegesAllocated;                                              //0xb
    ULONG Flags;                                                            //0xc
    ULONG RemainingDesiredAccess;                                           //0x10
    ULONG PreviouslyGrantedAccess;                                          //0x14
    ULONG OriginalDesiredAccess;                                            //0x18
    struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext;                //0x20
    VOID* SecurityDescriptor;                                               //0x40
    VOID* AuxData;                                                          //0x48
    union
    {
        struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;                  //0x50
        struct _PRIVILEGE_SET PrivilegeSet;                                 //0x50
    } Privileges;                                                           //0x50
    UCHAR AuditPrivileges;                                                  //0x7c
    struct _UNICODE_STRING ObjectName;                                      //0x80
    struct _UNICODE_STRING ObjectTypeName;                                  //0x90
}; 
//0x8 bytes (sizeof)
struct _ACL
{
    UCHAR AclRevision;                                                      //0x0
    UCHAR Sbz1;                                                             //0x1
    USHORT AclSize;                                                         //0x2
    USHORT AceCount;                                                        //0x4
    USHORT Sbz2;                                                            //0x6
}; 
//0x40 bytes (sizeof)
struct _ACPI_CACHED_TABLE
{
    struct _LIST_ENTRY Links;                                               //0x0
    union _LARGE_INTEGER PhysicalAddress;                                   //0x10
    struct _DESCRIPTION_HEADER Header;                                      //0x18
};
//0x8 bytes (sizeof)
struct _ACPI_METHOD_ARGUMENT_V1
{
    USHORT Type;                                                            //0x0
    USHORT DataLength;                                                      //0x2
    union
    {
        ULONG Argument;                                                     //0x4
        UCHAR Data[1];                                                      //0x4
    };
}; 
//0x8 bytes (sizeof)
struct _ACPI_METHOD_ARGUMENT_V1
{
    USHORT Type;                                                            //0x0
    USHORT DataLength;                                                      //0x2
    union
    {
        ULONG Argument;                                                     //0x4
        UCHAR Data[1];                                                      //0x4
    };
}; 
//0x0 bytes (sizeof)
struct _ACTIVATION_CONTEXT; 
//0x0 bytes (sizeof)
struct _ACTIVATION_CONTEXT_DATA; 
//0x28 bytes (sizeof)
struct _ACTIVATION_CONTEXT_STACK
{
    struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* ActiveFrame;                //0x0
    struct _LIST_ENTRY FrameListCache;                                      //0x8
    ULONG Flags;                                                            //0x18
    ULONG NextCookieSequenceNumber;                                         //0x1c
    ULONG StackId;                                                          //0x20
}; 
//0x18 bytes (sizeof)
struct _ACTIVATION_CONTEXT_STACK32
{
    ULONG ActiveFrame;                                                      //0x0
    struct LIST_ENTRY32 FrameListCache;                                     //0x4
    ULONG Flags;                                                            //0xc
    ULONG NextCookieSequenceNumber;                                         //0x10
    ULONG StackId;                                                          //0x14
}; 
//0x28 bytes (sizeof)
struct _ACTIVATION_CONTEXT_STACK64
{
    ULONGLONG ActiveFrame;                                                  //0x0
    struct LIST_ENTRY64 FrameListCache;                                     //0x8
    ULONG Flags;                                                            //0x18
    ULONG NextCookieSequenceNumber;                                         //0x1c
    ULONG StackId;                                                          //0x20
}; 
//0x280 bytes (sizeof)
struct _ADAPTER_OBJECT
{
    struct _HALP_DMA_ADAPTER_OBJECT AdapterObject;                          //0x0
    struct _HALP_DMA_MASTER_ADAPTER_OBJECT* MasterAdapter;                  //0x98
    struct _LIST_ENTRY WaitQueueEntry;                                      //0xa0
    union
    {
        struct _KDEVICE_QUEUE ChannelWaitQueue;                             //0xb0
        struct
        {
            ULONGLONG ResourceWaitLock;                                     //0xb0
            struct _LIST_ENTRY ResourceWaitQueue;                           //0xb8
            struct _LIST_ENTRY ChannelResourceWaitQueue;                    //0xc8
        };
    };
    UCHAR ResourceQueueBusy;                                                //0xd8
    ULONG MapRegistersPerChannel;                                           //0xe0
    VOID* MapRegisterBase;                                                  //0xe8
    ULONG NumberOfMapRegisters;                                             //0xf0
    ULONG MaxTransferLength;                                                //0xf4
    VOID* CrashDumpRegisterBase[2];                                         //0xf8
    ULONG NumberOfCrashDumpRegisters[2];                                    //0x108
    ULONG CrashDumpRegisterRefCount[2];                                     //0x110
    struct _LIST_ENTRY AdapterCrashDumpList;                                //0x118
    struct _MDL* MapRegisterMdl;                                            //0x128
    ULONGLONG MapRegisterMdlLock;                                           //0x130
    struct _EX_PUSH_LOCK ExpiredLock;                                       //0x138
    VOID* AllocationHandle;                                                 //0x140
    VOID* VirtualAddress;                                                   //0x148
    UCHAR IsAllocationMdlBased;                                             //0x150
    UCHAR NoLocalPool;                                                      //0x151
    UCHAR ExpiredFlag;                                                      //0x152
    struct _WAIT_CONTEXT_BLOCK* CurrentWcb;                                 //0x158
    struct _DMA_TRANSFER_CONTEXT* CurrentTransferContext;                   //0x160
    struct _HALP_DMA_CONTROLLER* DmaController;                             //0x168
    ULONG Controller;                                                       //0x170
    ULONG ChannelNumber;                                                    //0x174
    ULONG RequestLine;                                                      //0x178
    ULONG RequestedChannelCount;                                            //0x17c
    ULONG AllocatedChannelCount;                                            //0x180
    ULONG AllocatedChannels[8];                                             //0x184
    VOID* ChannelAdapter;                                                   //0x1a8
    UCHAR NeedsMapRegisters;                                                //0x1b0
    UCHAR MasterDevice;                                                     //0x1b1
    UCHAR ScatterGather;                                                    //0x1b2
    UCHAR AutoInitialize;                                                   //0x1b3
    UCHAR IgnoreCount;                                                      //0x1b4
    UCHAR CacheCoherent;                                                    //0x1b5
    union
    {
        struct
        {
            UCHAR Dma32BitAddresses;                                        //0x1b8
            UCHAR Dma64BitAddresses;                                        //0x1b9
        };
        ULONG DmaAddressWidth;                                              //0x1b8
    };
    enum _DMA_WIDTH DmaPortWidth;                                           //0x1bc
    union _LARGE_INTEGER DeviceAddress;                                     //0x1c0
    struct _LIST_ENTRY AdapterList;                                         //0x1c8
    struct _WORK_QUEUE_ITEM WorkItem;                                       //0x1d8
    struct _HALP_DMA_DOMAIN_OBJECT* DomainPointer;                          //0x1f8
    enum _EXT_IOMMU_TRANSLATION_TYPE TranslationType;                       //0x200
    UCHAR AdapterInUse;                                                     //0x204
    struct _DEVICE_OBJECT* DeviceObject;                                    //0x208
    struct _EXT_IOMMU_DEVICE_ID* DeviceId;                                  //0x210
    VOID* IommuDevice;                                                      //0x218
    struct _MDL* ScatterGatherMdl;                                          //0x220
    ULONGLONG LowMemoryLogicalAddressBase;                                  //0x228
    ULONGLONG LowMemoryLogicalAddressQueueLock;                             //0x230
    struct _LIST_ENTRY LowMemoryLogicalAddressQueue;                        //0x238
    UCHAR LowMemoryLogicalAddressQueueInUse;                                //0x248
    struct _HALP_EMERGENCY_LA_QUEUE_ENTRY LowMemoryLogicalAddressQueueEntry; //0x250
    enum _HALP_DMA_ADAPTER_ALLOCATION_STATE AllocationState;                //0x268
    ULONG ScatterGatherBufferLength;                                        //0x26c
    struct _SCATTER_GATHER_LIST ScatterGatherBuffer;                        //0x270
}; 
//0x50 bytes (sizeof)
struct _AGGREGATED_PAYLOAD_FILTER
{
    USHORT MagicValue:12;                                                   //0x0
    USHORT DescriptorVersion:4;                                             //0x0
    USHORT Size;                                                            //0x2
    USHORT PredicateCount;                                                  //0x4
    USHORT Reserved;                                                        //0x6
    ULONGLONG HashedEventIdBitmap;                                          //0x8
    struct _GUID ProviderGuid;                                              //0x10
    USHORT EachEventTableOffset;                                            //0x20
    USHORT EachEventTableLength;                                            //0x22
    USHORT PayloadDecoderTableOffset;                                       //0x24
    USHORT PayloadDecoderTableLength;                                       //0x26
    USHORT EventFilterTableOffset;                                          //0x28
    USHORT EventFilterTableLength;                                          //0x2a
    USHORT UNICODEStringTableOffset;                                        //0x2c
    USHORT UNICODEStringTableLength;                                        //0x2e
    USHORT ANSIStringTableOffset;                                           //0x30
    USHORT ANSIStringTableLength;                                           //0x32
    struct _EVENT_PAYLOAD_PREDICATE PredicateTable[1];                      //0x38
}; 
//0x48 bytes (sizeof)
struct _ALPC_COMMUNICATION_INFO
{
    struct _ALPC_PORT* ConnectionPort;                                      //0x0
    struct _ALPC_PORT* ServerCommunicationPort;                             //0x8
    struct _ALPC_PORT* ClientCommunicationPort;                             //0x10
    struct _LIST_ENTRY CommunicationList;                                   //0x18
    struct _ALPC_HANDLE_TABLE HandleTable;                                  //0x28
    struct _KALPC_MESSAGE* CloseMessage;                                    //0x40
}; 
//0xa0 bytes (sizeof)
struct _ALPC_COMPLETION_LIST
{
    struct _LIST_ENTRY Entry;                                               //0x0
    struct _EPROCESS* OwnerProcess;                                         //0x10
    struct _EX_PUSH_LOCK CompletionListLock;                                //0x18
    struct _MDL* Mdl;                                                       //0x20
    VOID* UserVa;                                                           //0x28
    VOID* UserLimit;                                                        //0x30
    VOID* DataUserVa;                                                       //0x38
    VOID* SystemVa;                                                         //0x40
    ULONGLONG TotalSize;                                                    //0x48
    struct _ALPC_COMPLETION_LIST_HEADER* Header;                            //0x50
    VOID* List;                                                             //0x58
    ULONGLONG ListSize;                                                     //0x60
    VOID* Bitmap;                                                           //0x68
    ULONGLONG BitmapSize;                                                   //0x70
    VOID* Data;                                                             //0x78
    ULONGLONG DataSize;                                                     //0x80
    ULONG BitmapLimit;                                                      //0x88
    ULONG BitmapNextHint;                                                   //0x8c
    ULONG ConcurrencyCount;                                                 //0x90
    ULONG AttributeFlags;                                                   //0x94
    ULONG AttributeSize;                                                    //0x98
}; 
//0x180 bytes (sizeof)
struct _ALPC_COMPLETION_LIST_HEADER
{
    ULONGLONG StartMagic;                                                   //0x0
    ULONG TotalSize;                                                        //0x8
    ULONG ListOffset;                                                       //0xc
    ULONG ListSize;                                                         //0x10
    ULONG BitmapOffset;                                                     //0x14
    ULONG BitmapSize;                                                       //0x18
    ULONG DataOffset;                                                       //0x1c
    ULONG DataSize;                                                         //0x20
    ULONG AttributeFlags;                                                   //0x24
    ULONG AttributeSize;                                                    //0x28
    volatile struct _ALPC_COMPLETION_LIST_STATE State;                      //0x40
    volatile ULONG LastMessageId;                                           //0x48
    volatile ULONG LastCallbackId;                                          //0x4c
    volatile ULONG PostCount;                                               //0x80
    volatile ULONG ReturnCount;                                             //0xc0
    volatile ULONG LogSequenceNumber;                                       //0x100
    struct _RTL_SRWLOCK UserLock;                                           //0x140
    ULONGLONG EndMagic;                                                     //0x148
}; 
//0x8 bytes (sizeof)
struct _ALPC_COMPLETION_LIST_STATE
{
    union
    {
        struct
        {
            ULONGLONG Head:24;                                              //0x0
            ULONGLONG Tail:24;                                              //0x0
            ULONGLONG ActiveThreadCount:16;                                 //0x0
        } s1;                                                               //0x0
        LONGLONG Value;                                                     //0x0
    } u1;                                                                   //0x0
}; 
//0x50 bytes (sizeof)
struct _ALPC_COMPLETION_PACKET_LOOKASIDE
{
    ULONGLONG Lock;                                                         //0x0
    ULONG Size;                                                             //0x8
    ULONG ActiveCount;                                                      //0xc
    ULONG PendingNullCount;                                                 //0x10
    ULONG PendingCheckCompletionListCount;                                  //0x14
    ULONG PendingDelete;                                                    //0x18
    struct _SINGLE_LIST_ENTRY FreeListHead;                                 //0x20
    VOID* CompletionPort;                                                   //0x28
    VOID* CompletionKey;                                                    //0x30
    struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY Entry[1];                //0x38
}; 
//0x18 bytes (sizeof)
struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY
{
    struct _SINGLE_LIST_ENTRY ListEntry;                                    //0x0
    struct _IO_MINI_COMPLETION_PACKET_USER* Packet;                         //0x8
    struct _ALPC_COMPLETION_PACKET_LOOKASIDE* Lookaside;                    //0x10
}; 
//0x40 bytes (sizeof)
struct _ALPC_DISPATCH_CONTEXT
{
    struct _ALPC_PORT* PortObject;                                          //0x0
    struct _KALPC_MESSAGE* Message;                                         //0x8
    struct _ALPC_COMMUNICATION_INFO* CommunicationInfo;                     //0x10
    struct _ETHREAD* TargetThread;                                          //0x18
    struct _ALPC_PORT* TargetPort;                                          //0x20
    union _KALPC_DIRECT_EVENT DirectEvent;                                  //0x28
    ULONG Flags;                                                            //0x30
    USHORT TotalLength;                                                     //0x34
    USHORT Type;                                                            //0x36
    USHORT DataInfoOffset;                                                  //0x38
    UCHAR SignalCompletion;                                                 //0x3a
    UCHAR PostedToCompletionList;                                           //0x3b
};
//0x8 bytes (sizeof)
struct _ALPC_HANDLE_ENTRY
{
    VOID* Object;                                                           //0x0
}; 
//0x18 bytes (sizeof)
struct _ALPC_HANDLE_TABLE
{
    struct _ALPC_HANDLE_ENTRY* Handles;                                     //0x0
    ULONG TotalHandles;                                                     //0x8
    ULONG Flags;                                                            //0xc
    struct _EX_PUSH_LOCK Lock;                                              //0x10
}; 
//0x8 bytes (sizeof)
struct _ALPC_MESSAGE_ATTRIBUTES
{
    ULONG AllocatedAttributes;                                              //0x0
    ULONG ValidAttributes;                                                  //0x4
};
//0x1d8 bytes (sizeof)
struct _ALPC_PORT
{
    struct _LIST_ENTRY PortListEntry;                                       //0x0
    struct _ALPC_COMMUNICATION_INFO* CommunicationInfo;                     //0x10
    struct _EPROCESS* OwnerProcess;                                         //0x18
    VOID* CompletionPort;                                                   //0x20
    VOID* CompletionKey;                                                    //0x28
    struct _ALPC_COMPLETION_PACKET_LOOKASIDE* CompletionPacketLookaside;    //0x30
    VOID* PortContext;                                                      //0x38
    struct _SECURITY_CLIENT_CONTEXT StaticSecurity;                         //0x40
    struct _EX_PUSH_LOCK IncomingQueueLock;                                 //0x88
    struct _LIST_ENTRY MainQueue;                                           //0x90
    struct _LIST_ENTRY LargeMessageQueue;                                   //0xa0
    struct _EX_PUSH_LOCK PendingQueueLock;                                  //0xb0
    struct _LIST_ENTRY PendingQueue;                                        //0xb8
    struct _EX_PUSH_LOCK DirectQueueLock;                                   //0xc8
    struct _LIST_ENTRY DirectQueue;                                         //0xd0
    struct _EX_PUSH_LOCK WaitQueueLock;                                     //0xe0
    struct _LIST_ENTRY WaitQueue;                                           //0xe8
    union
    {
        struct _KSEMAPHORE* Semaphore;                                      //0xf8
        struct _KEVENT* DummyEvent;                                         //0xf8
    };
    struct _ALPC_PORT_ATTRIBUTES PortAttributes;                            //0x100
    struct _EX_PUSH_LOCK ResourceListLock;                                  //0x148
    struct _LIST_ENTRY ResourceListHead;                                    //0x150
    struct _EX_PUSH_LOCK PortObjectLock;                                    //0x160
    struct _ALPC_COMPLETION_LIST* CompletionList;                           //0x168
    struct _CALLBACK_OBJECT* CallbackObject;                                //0x170
    VOID* CallbackContext;                                                  //0x178
    struct _LIST_ENTRY CanceledQueue;                                       //0x180
    LONG SequenceNo;                                                        //0x190
    LONG ReferenceNo;                                                       //0x194
    struct _PALPC_PORT_REFERENCE_WAIT_BLOCK* ReferenceNoWait;               //0x198
    union
    {
        struct
        {
            ULONG Initialized:1;                                            //0x1a0
            ULONG Type:2;                                                   //0x1a0
            ULONG ConnectionPending:1;                                      //0x1a0
            ULONG ConnectionRefused:1;                                      //0x1a0
            ULONG Disconnected:1;                                           //0x1a0
            ULONG Closed:1;                                                 //0x1a0
            ULONG NoFlushOnClose:1;                                         //0x1a0
            ULONG ReturnExtendedInfo:1;                                     //0x1a0
            ULONG Waitable:1;                                               //0x1a0
            ULONG DynamicSecurity:1;                                        //0x1a0
            ULONG Wow64CompletionList:1;                                    //0x1a0
            ULONG Lpc:1;                                                    //0x1a0
            ULONG LpcToLpc:1;                                               //0x1a0
            ULONG HasCompletionList:1;                                      //0x1a0
            ULONG HadCompletionList:1;                                      //0x1a0
            ULONG EnableCompletionList:1;                                   //0x1a0
        } s1;                                                               //0x1a0
        ULONG State;                                                        //0x1a0
    } u1;                                                                   //0x1a0
    struct _ALPC_PORT* TargetQueuePort;                                     //0x1a8
    struct _ALPC_PORT* TargetSequencePort;                                  //0x1b0
    struct _KALPC_MESSAGE* CachedMessage;                                   //0x1b8
    ULONG MainQueueLength;                                                  //0x1c0
    ULONG LargeMessageQueueLength;                                          //0x1c4
    ULONG PendingQueueLength;                                               //0x1c8
    ULONG DirectQueueLength;                                                //0x1cc
    ULONG CanceledQueueLength;                                              //0x1d0
    ULONG WaitQueueLength;                                                  //0x1d4
}; 
//0x48 bytes (sizeof)
struct _ALPC_PORT_ATTRIBUTES
{
    ULONG Flags;                                                            //0x0
    struct _SECURITY_QUALITY_OF_SERVICE SecurityQos;                        //0x4
    ULONGLONG MaxMessageLength;                                             //0x10
    ULONGLONG MemoryBandwidth;                                              //0x18
    ULONGLONG MaxPoolUsage;                                                 //0x20
    ULONGLONG MaxSectionSize;                                               //0x28
    ULONGLONG MaxViewSize;                                                  //0x30
    ULONGLONG MaxTotalSectionSize;                                          //0x38
    ULONG DupObjectTypes;                                                   //0x40
    ULONG Reserved;                                                         //0x44
}; 
//0x20 bytes (sizeof)
struct _ALPC_PROCESS_CONTEXT
{
    struct _EX_PUSH_LOCK Lock;                                              //0x0
    struct _LIST_ENTRY ViewListHead;                                        //0x8
    volatile ULONGLONG PagedPoolQuotaCache;                                 //0x18
}; 
//0x8 bytes (sizeof)
struct _ALPC_WORK_ON_BEHALF_TICKET
{
    ULONG ThreadId;                                                         //0x0
    ULONG ThreadCreationTimeLow;                                            //0x4
}; 
//0x1c bytes (sizeof)
struct _AMD64_DBGKD_CONTROL_SET
{
    ULONG TraceFlag;                                                        //0x0
    ULONGLONG Dr7;                                                          //0x4
    ULONGLONG CurrentSymbolStart;                                           //0xc
    ULONGLONG CurrentSymbolEnd;                                             //0x14
}; 
//0x8 bytes (sizeof)
struct _ARBITER_ADD_RESERVED_PARAMETERS
{
    struct _DEVICE_OBJECT* ReserveDevice;                                   //0x0
}; 
//0x50 bytes (sizeof)
struct _ARBITER_ALLOCATION_STATE
{
    ULONGLONG Start;                                                        //0x0
    ULONGLONG End;                                                          //0x8
    ULONGLONG CurrentMinimum;                                               //0x10
    ULONGLONG CurrentMaximum;                                               //0x18
    struct _ARBITER_LIST_ENTRY* Entry;                                      //0x20
    struct _ARBITER_ALTERNATIVE* CurrentAlternative;                        //0x28
    ULONG AlternativeCount;                                                 //0x30
    struct _ARBITER_ALTERNATIVE* Alternatives;                              //0x38
    USHORT Flags;                                                           //0x40
    UCHAR RangeAttributes;                                                  //0x42
    UCHAR RangeAvailableAttributes;                                         //0x43
    ULONGLONG WorkSpace;                                                    //0x48
}; 
//0x40 bytes (sizeof)
struct _ARBITER_ALTERNATIVE
{
    ULONGLONG Minimum;                                                      //0x0
    ULONGLONG Maximum;                                                      //0x8
    ULONGLONG Length;                                                       //0x10
    ULONGLONG Alignment;                                                    //0x18
    LONG Priority;                                                          //0x20
    ULONG Flags;                                                            //0x24
    struct _IO_RESOURCE_DESCRIPTOR* Descriptor;                             //0x28
    ULONG Reserved[3];                                                      //0x30
}; 
//0x8 bytes (sizeof)
struct _ARBITER_BOOT_ALLOCATION_PARAMETERS
{
    struct _LIST_ENTRY* ArbitrationList;                                    //0x0
}; 
//0x18 bytes (sizeof)
struct _ARBITER_CONFLICT_INFO
{
    struct _DEVICE_OBJECT* OwningObject;                                    //0x0
    ULONGLONG Start;                                                        //0x8
    ULONGLONG End;                                                          //0x10
}; 
//0x158 bytes (sizeof)
struct _ARBITER_INSTANCE
{
    ULONG Signature;                                                        //0x0
    struct _KEVENT* MutexEvent;                                             //0x8
    WCHAR* Name;                                                            //0x10
    WCHAR* OrderingName;                                                    //0x18
    LONG ResourceType;                                                      //0x20
    struct _RTL_RANGE_LIST* Allocation;                                     //0x28
    struct _RTL_RANGE_LIST* PossibleAllocation;                             //0x30
    struct _ARBITER_ORDERING_LIST OrderingList;                             //0x38
    struct _ARBITER_ORDERING_LIST ReservedList;                             //0x48
    LONG ReferenceCount;                                                    //0x58
    struct _ARBITER_INTERFACE* Interface;                                   //0x60
    ULONG AllocationStackMaxSize;                                           //0x68
    struct _ARBITER_ALLOCATION_STATE* AllocationStack;                      //0x70
    LONG (*UnpackRequirement)(struct _IO_RESOURCE_DESCRIPTOR* arg1, ULONGLONG* arg2, ULONGLONG* arg3, ULONGLONG* arg4, ULONGLONG* arg5); //0x78
    LONG (*PackResource)(struct _IO_RESOURCE_DESCRIPTOR* arg1, ULONGLONG arg2, struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* arg3); //0x80
    LONG (*UnpackResource)(struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* arg1, ULONGLONG* arg2, ULONGLONG* arg3); //0x88
    LONG (*ScoreRequirement)(struct _IO_RESOURCE_DESCRIPTOR* arg1);         //0x90
    LONG (*TestAllocation)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_TEST_ALLOCATION_PARAMETERS* arg2); //0x98
    LONG (*RetestAllocation)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_RETEST_ALLOCATION_PARAMETERS* arg2); //0xa0
    LONG (*CommitAllocation)(struct _ARBITER_INSTANCE* arg1);               //0xa8
    LONG (*RollbackAllocation)(struct _ARBITER_INSTANCE* arg1);             //0xb0
    LONG (*BootAllocation)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_BOOT_ALLOCATION_PARAMETERS* arg2); //0xb8
    LONG (*QueryArbitrate)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_QUERY_ARBITRATE_PARAMETERS* arg2); //0xc0
    LONG (*QueryConflict)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_QUERY_CONFLICT_PARAMETERS* arg2); //0xc8
    LONG (*AddReserved)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ADD_RESERVED_PARAMETERS* arg2); //0xd0
    LONG (*StartArbiter)(struct _ARBITER_INSTANCE* arg1, struct _CM_RESOURCE_LIST* arg2); //0xd8
    LONG (*PreprocessEntry)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0xe0
    LONG (*AllocateEntry)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0xe8
    UCHAR (*GetNextAllocationRange)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0xf0
    UCHAR (*FindSuitableRange)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0xf8
    VOID (*AddAllocation)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0x100
    VOID (*BacktrackAllocation)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0x108
    UCHAR (*OverrideConflict)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0x110
    LONG (*InitializeRangeList)(struct _ARBITER_INSTANCE* arg1, ULONG arg2, struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* arg3, struct _RTL_RANGE_LIST* arg4); //0x118
    LONG (*DeleteOwnerRanges)(struct _ARBITER_INSTANCE* arg1, VOID* arg2);  //0x120
    UCHAR TransactionInProgress;                                            //0x128
    struct _KEVENT* TransactionEvent;                                       //0x130
    VOID* Extension;                                                        //0x138
    struct _DEVICE_OBJECT* BusDeviceObject;                                 //0x140
    VOID* ConflictCallbackContext;                                          //0x148
    UCHAR (*ConflictCallback)(VOID* arg1, struct _RTL_RANGE* arg2);         //0x150
}; 
//0x30 bytes (sizeof)
struct _ARBITER_INTERFACE
{
    USHORT Size;                                                            //0x0
    USHORT Version;                                                         //0x2
    VOID* Context;                                                          //0x8
    VOID (*InterfaceReference)(VOID* arg1);                                 //0x10
    VOID (*InterfaceDereference)(VOID* arg1);                               //0x18
    LONG (*ArbiterHandler)(VOID* arg1, enum _ARBITER_ACTION arg2, struct _ARBITER_PARAMETERS* arg3); //0x20
    ULONG Flags;                                                            //0x28
}; 
//0x60 bytes (sizeof)
struct _ARBITER_LIST_ENTRY
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    ULONG AlternativeCount;                                                 //0x10
    struct _IO_RESOURCE_DESCRIPTOR* Alternatives;                           //0x18
    struct _DEVICE_OBJECT* PhysicalDeviceObject;                            //0x20
    enum _ARBITER_REQUEST_SOURCE RequestSource;                             //0x28
    ULONG Flags;                                                            //0x2c
    LONGLONG WorkSpace;                                                     //0x30
    enum _INTERFACE_TYPE InterfaceType;                                     //0x38
    ULONG SlotNumber;                                                       //0x3c
    ULONG BusNumber;                                                        //0x40
    struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* Assignment;                     //0x48
    struct _IO_RESOURCE_DESCRIPTOR* SelectedAlternative;                    //0x50
    enum _ARBITER_RESULT Result;                                            //0x58
}; 
//0x10 bytes (sizeof)
struct _ARBITER_ORDERING
{
    ULONGLONG Start;                                                        //0x0
    ULONGLONG End;                                                          //0x8
}; 
//0x10 bytes (sizeof)
struct _ARBITER_ORDERING_LIST
{
    USHORT Count;                                                           //0x0
    USHORT Maximum;                                                         //0x2
    struct _ARBITER_ORDERING* Orderings;                                    //0x8
}; 
//0x20 bytes (sizeof)
struct _ARBITER_PARAMETERS
{
    union
    {
        struct _ARBITER_TEST_ALLOCATION_PARAMETERS TestAllocation;          //0x0
        struct _ARBITER_RETEST_ALLOCATION_PARAMETERS RetestAllocation;      //0x0
        struct _ARBITER_BOOT_ALLOCATION_PARAMETERS BootAllocation;          //0x0
        struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS QueryAllocatedResources; //0x0
        struct _ARBITER_QUERY_CONFLICT_PARAMETERS QueryConflict;            //0x0
        struct _ARBITER_QUERY_ARBITRATE_PARAMETERS QueryArbitrate;          //0x0
        struct _ARBITER_ADD_RESERVED_PARAMETERS AddReserved;                //0x0
    } Parameters;                                                           //0x0
}; 
//0x8 bytes (sizeof)
struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS
{
    struct _CM_PARTIAL_RESOURCE_LIST** AllocatedResources;                  //0x0
}; 
//0x8 bytes (sizeof)
struct _ARBITER_QUERY_ARBITRATE_PARAMETERS
{
    struct _LIST_ENTRY* ArbitrationList;                                    //0x0
}; 
//0x20 bytes (sizeof)
struct _ARBITER_QUERY_CONFLICT_PARAMETERS
{
    struct _DEVICE_OBJECT* PhysicalDeviceObject;                            //0x0
    struct _IO_RESOURCE_DESCRIPTOR* ConflictingResource;                    //0x8
    ULONG* ConflictCount;                                                   //0x10
    struct _ARBITER_CONFLICT_INFO** Conflicts;                              //0x18
}; 
//0x18 bytes (sizeof)
struct _ARBITER_RETEST_ALLOCATION_PARAMETERS
{
    struct _LIST_ENTRY* ArbitrationList;                                    //0x0
    ULONG AllocateFromCount;                                                //0x8
    struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;                   //0x10
}; 
//0x18 bytes (sizeof)
struct _ARBITER_TEST_ALLOCATION_PARAMETERS
{
    struct _LIST_ENTRY* ArbitrationList;                                    //0x0
    ULONG AllocateFromCount;                                                //0x8
    struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;                   //0x10
}; 
//0x10 bytes (sizeof)
struct _ARC_DISK_INFORMATION
{
    struct _LIST_ENTRY DiskSignatures;                                      //0x0
}; 
//0x18 bytes (sizeof)
struct _ARM64_DBGKD_CONTROL_SET
{
    ULONG Continue;                                                         //0x0
    ULONG TraceFlag;                                                        //0x4
    ULONGLONG CurrentSymbolStart;                                           //0x8
    ULONGLONG CurrentSymbolEnd;                                             //0x10
}; 
//0xc bytes (sizeof)
struct _ARMCE_DBGKD_CONTROL_SET
{
    ULONG Continue;                                                         //0x0
    ULONG CurrentSymbolStart;                                               //0x4
    ULONG CurrentSymbolEnd;                                                 //0x8
}; 
//0xc bytes (sizeof)
struct _ARM_DBGKD_CONTROL_SET
{
    ULONG Continue;                                                         //0x0
    ULONG CurrentSymbolStart;                                               //0x4
    ULONG CurrentSymbolEnd;                                                 //0x8
}; 
//0x4 bytes (sizeof)
struct _ARM_LOADER_BLOCK
{
    ULONG PlaceHolder;                                                      //0x0
}; 
//0x0 bytes (sizeof)
struct _ASSEMBLY_STORAGE_MAP; 
//0x194 bytes (sizeof)
struct _ASYNC_READ_THREAD_STATS
{
    ULONG CurrentLoad[101];                                                 //0x0
}; 
//0x260 bytes (sizeof)
struct _AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION
{
    ULONG DeviceGroupsCount;                                                //0x0
    struct _SID_AND_ATTRIBUTES* pDeviceGroups;                              //0x8
    ULONG RestrictedDeviceGroupsCount;                                      //0x10
    struct _SID_AND_ATTRIBUTES* pRestrictedDeviceGroups;                    //0x18
    struct _SID_AND_ATTRIBUTES_HASH DeviceGroupsHash;                       //0x20
    struct _SID_AND_ATTRIBUTES_HASH RestrictedDeviceGroupsHash;             //0x130
    struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION* pUserSecurityAttributes; //0x240
    struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION* pDeviceSecurityAttributes; //0x248
    struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION* pRestrictedUserSecurityAttributes; //0x250
    struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION* pRestrictedDeviceSecurityAttributes; //0x258
}; 
//0x30 bytes (sizeof)
struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION
{
    ULONG SecurityAttributeCount;                                           //0x0
    struct _LIST_ENTRY SecurityAttributesList;                              //0x8
    ULONG WorkingSecurityAttributeCount;                                    //0x18
    struct _LIST_ENTRY WorkingSecurityAttributesList;                       //0x20
}; 
//0xe0 bytes (sizeof)
struct _AUX_ACCESS_DATA
{
    struct _PRIVILEGE_SET* PrivilegesUsed;                                  //0x0
    struct _GENERIC_MAPPING GenericMapping;                                 //0x8
    ULONG AccessesToAudit;                                                  //0x18
    ULONG MaximumAuditMask;                                                 //0x1c
    struct _GUID TransactionId;                                             //0x20
    VOID* NewSecurityDescriptor;                                            //0x30
    VOID* ExistingSecurityDescriptor;                                       //0x38
    VOID* ParentSecurityDescriptor;                                         //0x40
    VOID (*DeRefSecurityDescriptor)(VOID* arg1, VOID* arg2);                //0x48
    VOID* SDLock;                                                           //0x50
    struct _ACCESS_REASONS AccessReasons;                                   //0x58
    UCHAR GenerateStagingEvents;                                            //0xd8
};
//0x0 bytes (sizeof)
struct _AWEINFO; 
//0x30 bytes (sizeof)
struct _BITMAP_RANGE
{
    struct _LIST_ENTRY Links;                                               //0x0
    LONGLONG BasePage;                                                      //0x10
    ULONG FirstDirtyPage;                                                   //0x18
    ULONG LastDirtyPage;                                                    //0x1c
    ULONG DirtyPages;                                                       //0x20
    ULONG* Bitmap;                                                          //0x28
}; 
//0x30 bytes (sizeof)
struct _BLOB
{
    union
    {
        struct _LIST_ENTRY ResourceList;                                    //0x0
        struct _SLIST_ENTRY FreeListEntry;                                  //0x0
    };
    union
    {
        struct
        {
            UCHAR ReferenceCache:1;                                         //0x10
            UCHAR Lookaside:1;                                              //0x10
            UCHAR Initializing:1;                                           //0x10
            UCHAR Deleted:1;                                                //0x10
        } s1;                                                               //0x10
        UCHAR Flags;                                                        //0x10
    } u1;                                                                   //0x10
    UCHAR ResourceId;                                                       //0x11
    SHORT CachedReferences;                                                 //0x12
    LONGLONG ReferenceCount;                                                //0x18
    struct _EX_PUSH_LOCK Lock;                                              //0x20
};
//0x8 bytes (sizeof)
struct _BLOB_COUNTERS
{
    ULONG CreatedObjects;                                                   //0x0
    ULONG DeletedObjects;                                                   //0x4
}; 
//0x38 bytes (sizeof)
struct _BLOB_TYPE
{
    enum _BLOB_ID ResourceId;                                               //0x0
    ULONG PoolTag;                                                          //0x4
    ULONG LookasideIndex;                                                   //0x8
    ULONG Flags;                                                            //0xc
    struct _BLOB_COUNTERS* Counters;                                        //0x10
    VOID (*CleanupProcedure)(VOID* arg1);                                   //0x18
    VOID (*DeleteProcedure)(VOID* arg1);                                    //0x20
    LONG (*DestroyProcedure)(VOID* arg1);                                   //0x28
    ULONGLONG UsualSize;                                                    //0x30
};
//0x868 bytes (sizeof)
struct _BOOT_ENTROPY_LDR_RESULT
{
    ULONG maxEntropySources;                                                //0x0
    struct _BOOT_ENTROPY_SOURCE_LDR_RESULT EntropySourceResult[10];         //0x8
    UCHAR SeedBytesForCng[48];                                              //0x418
    UCHAR RngBytesForNtoskrnl[1024];                                        //0x448
    UCHAR KdEntropy[32];                                                    //0x848
}; 
//0x68 bytes (sizeof)
struct _BOOT_ENTROPY_SOURCE_LDR_RESULT
{
    enum _BOOT_ENTROPY_SOURCE_ID SourceId;                                  //0x0
    ULONGLONG Policy;                                                       //0x8
    enum _BOOT_ENTROPY_SOURCE_RESULT_CODE ResultCode;                       //0x10
    LONG ResultStatus;                                                      //0x14
    ULONGLONG Time;                                                         //0x18
    ULONG EntropyLength;                                                    //0x20
    UCHAR EntropyData[64];                                                  //0x24
}; 
//0x10 bytes (sizeof)
struct _BUS_EXTENSION_LIST
{
    VOID* Next;                                                             //0x0
    struct _PI_BUS_EXTENSION* BusExtension;                                 //0x8
};
//0xb0 bytes (sizeof)
struct _BUS_HANDLER
{
    ULONG Version;                                                          //0x0
    enum _INTERFACE_TYPE InterfaceType;                                     //0x4
    enum _BUS_DATA_TYPE ConfigurationType;                                  //0x8
    ULONG BusNumber;                                                        //0xc
    struct _DEVICE_OBJECT* DeviceObject;                                    //0x10
    struct _BUS_HANDLER* ParentHandler;                                     //0x18
    VOID* BusData;                                                          //0x20
    ULONG DeviceControlExtensionSize;                                       //0x28
    struct _SUPPORTED_RANGES* BusAddresses;                                 //0x30
    ULONG Reserved[4];                                                      //0x38
    ULONG (*GetBusData)(struct _BUS_HANDLER* arg1, struct _BUS_HANDLER* arg2, ULONG arg3, VOID* arg4, ULONG arg5, ULONG arg6); //0x48
    ULONG (*SetBusData)(struct _BUS_HANDLER* arg1, struct _BUS_HANDLER* arg2, ULONG arg3, VOID* arg4, ULONG arg5, ULONG arg6); //0x50
    LONG (*AdjustResourceList)(struct _BUS_HANDLER* arg1, struct _BUS_HANDLER* arg2, struct _IO_RESOURCE_REQUIREMENTS_LIST** arg3); //0x58
    LONG (*AssignSlotResources)(struct _BUS_HANDLER* arg1, struct _BUS_HANDLER* arg2, struct _UNICODE_STRING* arg3, struct _UNICODE_STRING* arg4, struct _DRIVER_OBJECT* arg5, struct _DEVICE_OBJECT* arg6, ULONG arg7, struct _CM_RESOURCE_LIST** arg8); //0x60
    UCHAR (*TranslateBusAddress)(struct _BUS_HANDLER* arg1, struct _BUS_HANDLER* arg2, union _LARGE_INTEGER arg3, ULONG* arg4, union _LARGE_INTEGER* arg5); //0x68
    VOID* Spare1;                                                           //0x70
    VOID* Spare2;                                                           //0x78
    VOID* Spare3;                                                           //0x80
    VOID* Spare4;                                                           //0x88
    VOID* Spare5;                                                           //0x90
    VOID* Spare6;                                                           //0x98
    VOID* Spare7;                                                           //0xa0
    VOID* Spare8;                                                           //0xa8
}; 
//0x20 bytes (sizeof)
struct _CACHED_KSTACK_LIST
{
    union _SLIST_HEADER SListHead;                                          //0x0
    LONG MinimumFree;                                                       //0x10
    ULONG Misses;                                                           //0x14
    ULONG MissesLast;                                                       //0x18
    ULONG AllStacksInUse;                                                   //0x1c
}; 
//0xc bytes (sizeof)
struct _CACHE_DESCRIPTOR
{
    UCHAR Level;                                                            //0x0
    UCHAR Associativity;                                                    //0x1
    USHORT LineSize;                                                        //0x2
    ULONG Size;                                                             //0x4
    enum _PROCESSOR_CACHE_TYPE Type;                                        //0x8
}; 
//0x20 bytes (sizeof)
struct _CACHE_MANAGER_CALLBACKS
{
    UCHAR (*AcquireForLazyWrite)(VOID* arg1, UCHAR arg2);                   //0x0
    VOID (*ReleaseFromLazyWrite)(VOID* arg1);                               //0x8
    UCHAR (*AcquireForReadAhead)(VOID* arg1, UCHAR arg2);                   //0x10
    VOID (*ReleaseFromReadAhead)(VOID* arg1);                               //0x18
}; 
//0x20 bytes (sizeof)
struct _CACHE_UNINITIALIZE_EVENT
{
    struct _CACHE_UNINITIALIZE_EVENT* Next;                                 //0x0
    struct _KEVENT Event;                                                   //0x8
}; 
//0x0 bytes (sizeof)
struct _CALLBACK_OBJECT; 
//0x28 bytes (sizeof)
struct _CALL_HASH_ENTRY
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    VOID* CallersAddress;                                                   //0x10
    VOID* CallersCaller;                                                    //0x18
    ULONG CallCount;                                                        //0x20
};
//0x408 bytes (sizeof)
struct _CALL_PERFORMANCE_DATA
{
    ULONGLONG SpinLock;                                                     //0x0
    struct _LIST_ENTRY HashTable[64];                                       //0x8
};
//0x20 bytes (sizeof)
struct _CC_ASYNC_READ_CONTEXT
{
    UCHAR (*CompletionRoutine)(VOID* arg1);                                 //0x0
    VOID* Context;                                                          //0x8
    struct _MDL* Mdl;                                                       //0x10
    CHAR RequestorMode;                                                     //0x18
    ULONG NestingLevel;                                                     //0x1c
}; 
//0x30 bytes (sizeof)
struct _CC_EXTERNAL_CACHE_INFO
{
    VOID (*Callback)(VOID* arg1, ULONGLONG arg2, ULONG arg3);               //0x0
    struct _DIRTY_PAGE_STATISTICS DirtyPageStatistics;                      //0x8
    struct _LIST_ENTRY Links;                                               //0x20
};
//0x440 bytes (sizeof)
struct _CC_PARTITION
{
    SHORT NodeTypeCode;                                                     //0x0
    SHORT NodeByteSize;                                                     //0x2
    struct _EPARTITION* PartitionObject;                                    //0x8
    struct _LIST_ENTRY CleanSharedCacheMapList;                             //0x10
    struct _LIST_ENTRY CleanSharedCacheMapWithLogHandleList;                //0x20
    struct _SHARED_CACHE_MAP_LIST_CURSOR DirtySharedCacheMapList;           //0x30
    struct _SHARED_CACHE_MAP_LIST_CURSOR LazyWriteCursor;                   //0x48
    struct _LIST_ENTRY DirtySharedCacheMapWithLogHandleList;                //0x60
    ULONGLONG PrivateLock;                                                  //0x80
    ULONG ConsecutiveWorklessLazyScanCount;                                 //0x88
    UCHAR ForcedDisableLazywriteScan;                                       //0x8c
    ULONGLONG WorkQueueLock;                                                //0xc0
    ULONG NumberWorkerThreads;                                              //0xc8
    ULONG NumberActiveWorkerThreads;                                        //0xcc
    struct _LIST_ENTRY IdleWorkerThreadList;                                //0xd0
    struct _LIST_ENTRY FastTeardownWorkQueue;                               //0xe0
    struct _LIST_ENTRY ExpressWorkQueue;                                    //0xf0
    struct _LIST_ENTRY RegularWorkQueue;                                    //0x100
    struct _LIST_ENTRY PostTickWorkQueue;                                   //0x110
    struct _LIST_ENTRY CleanCachemapUninitWorkQueue;                        //0x120
    struct _LIST_ENTRY IdleExtraWriteBehindThreadList;                      //0x130
    ULONG ActiveExtraWriteBehindThreads;                                    //0x140
    ULONG MaxExtraWriteBehindThreads;                                       //0x144
    struct _LIST_ENTRY IdleCacheMapUninitThreadList;                        //0x148
    ULONG ActiveCacheMapUninitThreads;                                      //0x158
    ULONG MaxCacheMapUninitThreads;                                         //0x15c
    UCHAR QueueThrottle;                                                    //0x160
    ULONG PostTickWorkItemCount;                                            //0x164
    ULONG ThreadsActiveBeforeThrottle;                                      //0x168
    ULONG ExtraWBThreadsActiveBeforeThrottle;                               //0x16c
    ULONG ExecutingWriteBehindWorkItems;                                    //0x170
    ULONG ExecutingHighPriorityWorkItem;                                    //0x174
    struct _KEVENT LowMemoryEvent;                                          //0x178
    struct _KEVENT PowerEvent;                                              //0x190
    struct _KEVENT PeriodicEvent;                                           //0x1a8
    struct _KEVENT WaitingForTeardownEvent;                                 //0x1c0
    struct _KEVENT CoalescingFlushEvent;                                    //0x1d8
    ULONG PagesYetToWrite;                                                  //0x1f0
    struct _LAZY_WRITER LazyWriter;                                         //0x1f8
    struct _DIRTY_PAGE_STATISTICS DirtyPageStatistics;                      //0x280
    struct _DIRTY_PAGE_THRESHOLDS DirtyPageThresholds;                      //0x298
    struct _WRITE_BEHIND_THROUGHPUT* ThroughputStats;                       //0x2d0
    LONG ThroughputTrend;                                                   //0x2d8
    ULONGLONG AverageAvailablePages;                                        //0x2e0
    ULONGLONG AverageDirtyPages;                                            //0x2e8
    ULONGLONG PagesSkippedDueToHotSpot;                                     //0x2f0
    union _LARGE_INTEGER PrevRegularQueueItemRunTime;                       //0x2f8
    union _LARGE_INTEGER PrevExtraWBThreadCheckTime;                        //0x300
    UCHAR AddExtraWriteBehindThreads;                                       //0x308
    UCHAR RemoveExtraThreadPending;                                         //0x309
    struct _LIST_ENTRY DeferredWrites;                                      //0x310
    ULONGLONG DeferredWriteSpinLock;                                        //0x340
    struct _LIST_ENTRY* IdleAsyncReadWorkerThreadList;                      //0x348
    ULONG* NumberActiveAsyncReadWorkerThreads;                              //0x350
    ULONG* NumberActiveCompleteAsyncReadWorkItems;                          //0x358
    struct _LIST_ENTRY* AsyncReadWorkQueue;                                 //0x360
    struct _LIST_ENTRY* AsyncReadCompletionWorkQueue;                       //0x368
    struct _KEVENT* NewAsyncReadRequestEvent;                               //0x370
    struct _ASYNC_READ_THREAD_STATS* ReaderThreadsStats;                    //0x378
    struct _EX_PUSH_LOCK AsyncReadWorkQueueLock;                            //0x380
    struct _LIST_ENTRY VacbFreeHighPriorityList;                            //0x388
    ULONG NumberOfFreeHighPriorityVacbs;                                    //0x398
    struct _ETHREAD* LowPriWorkerThread;                                    //0x3a0
    struct _SHARED_CACHE_MAP* LowPriSharedCacheMap;                         //0x3a8
    LONG LowPriOldCpuPriority;                                              //0x3b0
    enum _IO_PRIORITY_HINT LowPriOldIoPriority;                             //0x3b4
    struct _EX_PUSH_LOCK LowPriorityWorkerThreadLock;                       //0x3b8
    ULONG MaxNumberOfWriteBehindThreads;                                    //0x3c0
    UCHAR CoalescingState;                                                  //0x3c4
    UCHAR ActivePartition;                                                  //0x3c5
    UCHAR RundownPhase;                                                     //0x3c6
    LONGLONG RefCount;                                                      //0x3c8
    struct _KEVENT ExitEvent;                                               //0x3d0
    struct _KEVENT FinalDereferenceEvent;                                   //0x3e8
    VOID* LazyWriteScanThreadHandle;                                        //0x400
}; 
//0x50 bytes (sizeof)
struct _CELL_DATA
{
    union _u u;                                                             //0x0
}; 
//0x8 bytes (sizeof)
struct _CHILD_LIST
{
    ULONG Count;                                                            //0x0
    ULONG List;                                                             //0x4
}; 
//0x0 bytes (sizeof)
struct _CI_NGEN_PATHS; 
//0x10 bytes (sizeof)
struct _CLIENT_ID
{
    VOID* UniqueProcess;                                                    //0x0
    VOID* UniqueThread;                                                     //0x8
}; 
//0x8 bytes (sizeof)
struct _CLIENT_ID32
{
    ULONG UniqueProcess;                                                    //0x0
    ULONG UniqueThread;                                                     //0x4
}; 
//0x10 bytes (sizeof)
struct _CLIENT_ID64
{
    ULONGLONG UniqueProcess;                                                //0x0
    ULONGLONG UniqueThread;                                                 //0x8
}; 
//0x12e8 bytes (sizeof)
struct _CMHIVE
{
    struct _HHIVE Hive;                                                     //0x0
    VOID* FileHandles[6];                                                   //0x600
    struct _LIST_ENTRY NotifyList;                                          //0x630
    struct _LIST_ENTRY HiveList;                                            //0x640
    struct _LIST_ENTRY PreloadedHiveList;                                   //0x650
    struct _EX_RUNDOWN_REF HiveRundown;                                     //0x660
    struct _CM_KEY_HASH_TABLE_ENTRY* KcbCacheTable;                         //0x668
    ULONG KcbCacheTableSize;                                                //0x670
    struct _CM_KEY_HASH_TABLE_ENTRY* DeletedKcbTable;                       //0x678
    ULONG DeletedKcbTableSize;                                              //0x680
    ULONG Identity;                                                         //0x684
    struct _CMSI_RW_LOCK HiveLock;                                          //0x688
    struct _RTL_BITMAP FlushDirtyVector;                                    //0x690
    ULONG FlushDirtyVectorSize;                                             //0x6a0
    struct CMP_OFFSET_ARRAY* FlushLogEntryOffsetArray;                      //0x6a8
    ULONG FlushLogEntryOffsetArrayCount;                                    //0x6b0
    ULONG FlushLogEntrySize;                                                //0x6b4
    ULONG FlushHiveTruncated;                                               //0x6b8
    UCHAR FlushBaseBlockDirty;                                              //0x6bc
    struct _RTL_BITMAP CapturedUnreconciledVector;                          //0x6c0
    ULONG CapturedUnreconciledVectorSize;                                   //0x6d0
    struct CMP_OFFSET_ARRAY* UnreconciledOffsetArray;                       //0x6d8
    ULONG UnreconciledOffsetArrayCount;                                     //0x6e0
    struct _HBASE_BLOCK* UnreconciledBaseBlock;                             //0x6e8
    struct _EX_PUSH_LOCK SecurityLock;                                      //0x6f0
    ULONG LastShrinkHiveSize;                                               //0x6f8
    union _LARGE_INTEGER ActualFileSize;                                    //0x700
    union _LARGE_INTEGER LogFileSizes[2];                                   //0x708
    struct _UNICODE_STRING FileFullPath;                                    //0x718
    struct _UNICODE_STRING FileUserName;                                    //0x728
    struct _UNICODE_STRING HiveRootPath;                                    //0x738
    ULONG SecurityCount;                                                    //0x748
    ULONG SecurityCacheSize;                                                //0x74c
    LONG SecurityHitHint;                                                   //0x750
    struct _CM_KEY_SECURITY_CACHE_ENTRY* SecurityCache;                     //0x758
    struct _LIST_ENTRY SecurityHash[64];                                    //0x760
    ULONG UnloadEventCount;                                                 //0xb60
    struct _KEVENT** UnloadEventArray;                                      //0xb68
    struct _CM_KEY_CONTROL_BLOCK* RootKcb;                                  //0xb70
    UCHAR Frozen;                                                           //0xb78
    struct _CM_WORKITEM* UnloadWorkItem;                                    //0xb80
    struct _CM_WORKITEM UnloadWorkItemHolder;                               //0xb88
    struct _CM_DIRTY_VECTOR_LOG DirtyVectorLog;                             //0xbb0
    ULONG Flags;                                                            //0x1038
    struct _LIST_ENTRY TrustClassEntry;                                     //0x1040
    ULONGLONG DirtyTime;                                                    //0x1050
    ULONGLONG UnreconciledTime;                                             //0x1058
    struct _CM_RM* CmRm;                                                    //0x1060
    ULONG CmRmInitFailPoint;                                                //0x1068
    LONG CmRmInitFailStatus;                                                //0x106c
    struct _KTHREAD* CreatorOwner;                                          //0x1070
    struct _KTHREAD* RundownThread;                                         //0x1078
    union _LARGE_INTEGER LastWriteTime;                                     //0x1080
    struct _HIVE_WRITE_WAIT_QUEUE FlushQueue;                               //0x1088
    struct _HIVE_WRITE_WAIT_QUEUE ReconcileQueue;                           //0x1098
    union
    {
        ULONG FlushFlags;                                                   //0x10a8
        struct
        {
            ULONG PrimaryFilePurged:1;                                      //0x10a8
            ULONG DiskFileBad:1;                                            //0x10a8
        };
    };
    ULONG PrimaryFileSizeBeforeLastFlush;                                   //0x10ac
    volatile LONG ReferenceCount;                                           //0x10b0
    LONG UnloadHistoryIndex;                                                //0x10b4
    ULONG UnloadHistory[128];                                               //0x10b8
    ULONG BootStart;                                                        //0x12b8
    ULONG UnaccessedStart;                                                  //0x12bc
    ULONG UnaccessedEnd;                                                    //0x12c0
    ULONG LoadedKeyCount;                                                   //0x12c4
    volatile ULONG HandleClosePending;                                      //0x12c8
    struct _EX_PUSH_LOCK HandleClosePendingEvent;                           //0x12d0
    UCHAR FinalFlushSucceeded;                                              //0x12d8
    struct _CMP_VOLUME_CONTEXT* VolumeContext;                              //0x12e0
}; 
//0x20 bytes (sizeof)
struct _CMP_DISCARD_AND_REPLACE_KCB_CONTEXT
{
    struct _CM_KEY_CONTROL_BLOCK* BaseKcb;                                  //0x0
    LONG PrepareStatus;                                                     //0x8
    struct _LIST_ENTRY ClonedKcbListHead;                                   //0x10
}; 
//0x48 bytes (sizeof)
struct _CMP_VOLUME_CONTEXT
{
    struct _LIST_ENTRY VolumeContextListEntry;                              //0x0
    struct _CMP_VOLUME_MANAGER* VolumeManager;                              //0x10
    LONGLONG RefCount;                                                      //0x18
    struct _GUID VolumeGuid;                                                //0x20
    VOID* VolumeFileObject;                                                 //0x30
    struct _CMSI_RW_LOCK VolumeContextLock;                                 //0x38
    UCHAR DeviceUsageNotificationSent;                                      //0x40
}; 
//0x18 bytes (sizeof)
struct _CMP_VOLUME_MANAGER
{
    struct _CMSI_RW_LOCK VolumeContextListLock;                             //0x0
    struct _LIST_ENTRY VolumeContextListHead;                               //0x8
}; 
//0x10 bytes (sizeof)
struct _CMSI_PROCESS_TUPLE
{
    VOID* ProcessHandle;                                                    //0x0
    VOID* ProcessReference;                                                 //0x8
}; 
//0x8 bytes (sizeof)
struct _CMSI_RW_LOCK
{
    VOID* Reserved;                                                         //0x0
}; 
//0x8 bytes (sizeof)
struct _CM_BIG_DATA
{
    USHORT Signature;                                                       //0x0
    USHORT Count;                                                           //0x2
    ULONG List;                                                             //0x4
}; 
//0x4 bytes (sizeof)
struct _CM_COMPONENT_HASH
{
    ULONG Hash;                                                             //0x0
}; 
//0x488 bytes (sizeof)
struct _CM_DIRTY_VECTOR_LOG
{
    volatile ULONG Next;                                                    //0x0
    ULONG Size;                                                             //0x4
    struct _CM_DIRTY_VECTOR_LOG_ENTRY Log[16];                              //0x8
}; 
//0x48 bytes (sizeof)
struct _CM_DIRTY_VECTOR_LOG_ENTRY
{
    struct _ETHREAD* Thread;                                                //0x0
    enum _CM_DIRTY_VECTOR_OPERATION Operation;                              //0x8
    union
    {
        struct
        {
            ULONG Start;                                                    //0xc
            ULONG Length;                                                   //0x10
        } DirtyVectorModifiedContext;                                       //0xc
        struct
        {
            ULONG RangeCount;                                               //0xc
            ULONG SetBitCount;                                              //0x10
        } DirtyDataCaptureContext;                                          //0xc
        struct
        {
            ULONG Context1;                                                 //0xc
            ULONG Context2;                                                 //0x10
        } Raw;                                                              //0xc
    } Data;                                                                 //0xc
    VOID* Stack[6];                                                         //0x18
}; 
//0x4 bytes (sizeof)
struct _CM_FAST_LEAF_HINT
{
    union
    {
        UCHAR Characters[4];                                                //0x0
        ULONG FullHint;                                                     //0x0
    };
}; 
//0x24 bytes (sizeof)
struct _CM_FULL_RESOURCE_DESCRIPTOR
{
    enum _INTERFACE_TYPE InterfaceType;                                     //0x0
    ULONG BusNumber;                                                        //0x4
    struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList;                   //0x8
}; 
//0x8 bytes (sizeof)
struct _CM_INDEX
{
    ULONG Cell;                                                             //0x0
    union
    {
        struct _CM_FAST_LEAF_HINT NameHint;                                 //0x4
        struct _CM_COMPONENT_HASH HashKey;                                  //0x4
    };
};
//0x8 bytes (sizeof)
struct _CM_INDEX_HINT_BLOCK
{
    ULONG Count;                                                            //0x0
    ULONG HashKey[1];                                                       //0x4
}; 
//0x10 bytes (sizeof)
struct _CM_INTENT_LOCK
{
    ULONG OwnerCount;                                                       //0x0
    struct _CM_KCB_UOW** OwnerTable;                                        //0x8
}; 
//0x30 bytes (sizeof)
struct _CM_KCB_LAYER_INFO
{
    struct _LIST_ENTRY LayerListEntry;                                      //0x0
    struct _CM_KEY_CONTROL_BLOCK* Kcb;                                      //0x10
    struct _CM_KCB_LAYER_INFO* LowerLayer;                                  //0x18
    struct _LIST_ENTRY UpperLayerListHead;                                  //0x20
}; 
//0x78 bytes (sizeof)
struct _CM_KCB_UOW
{
    struct _LIST_ENTRY TransactionListEntry;                                //0x0
    struct _CM_INTENT_LOCK* KCBLock;                                        //0x10
    struct _CM_INTENT_LOCK* KeyLock;                                        //0x18
    struct _LIST_ENTRY KCBListEntry;                                        //0x20
    struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;                          //0x30
    struct _CM_TRANS* Transaction;                                          //0x38
    ULONG UoWState;                                                         //0x40
    enum UoWActionType ActionType;                                          //0x44
    enum HSTORAGE_TYPE StorageType;                                         //0x48
    struct _CM_KCB_UOW* ParentUoW;                                          //0x50
    union
    {
        struct _CM_KEY_CONTROL_BLOCK* ChildKCB;                             //0x58
        ULONG VolatileKeyCell;                                              //0x58
        struct
        {
            ULONG OldValueCell;                                             //0x58
            ULONG NewValueCell;                                             //0x5c
        };
        ULONG UserFlags;                                                    //0x58
        union _LARGE_INTEGER LastWriteTime;                                 //0x58
        struct
        {
            struct _CM_KEY_SECURITY_CACHE* TxCachedSecurity;                //0x58
            ULONG TxSecurityCell;                                           //0x60
        };
        struct
        {
            struct _CM_KEY_CONTROL_BLOCK* OldChildKCB;                      //0x58
            struct _CM_KEY_CONTROL_BLOCK* NewChildKCB;                      //0x60
        };
        struct
        {
            struct _CM_KEY_CONTROL_BLOCK* OtherChildKCB;                    //0x58
            ULONG ThisVolatileKeyCell;                                      //0x60
        };
    };
    union
    {
        VOID* PrepareDataPointer;                                           //0x68
        struct _CM_UOW_SET_SD_DATA* SecurityData;                           //0x68
        struct _CM_UOW_KEY_STATE_MODIFICATION* ModifyKeysData;              //0x68
        struct _CM_UOW_SET_VALUE_LIST_DATA* SetValueData;                   //0x68
    };
    union
    {
        struct _CM_UOW_SET_VALUE_KEY_DATA* ValueData;                       //0x70
        struct _CMP_DISCARD_AND_REPLACE_KCB_CONTEXT* DiscardReplaceContext; //0x70
    };
}; 
//0x68 bytes (sizeof)
struct _CM_KEY_BODY
{
    ULONG Type;                                                             //0x0
    struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;                          //0x8
    struct _CM_NOTIFY_BLOCK* NotifyBlock;                                   //0x10
    VOID* ProcessID;                                                        //0x18
    struct _LIST_ENTRY KeyBodyList;                                         //0x20
    ULONG Flags:16;                                                         //0x30
    ULONG HandleTags:16;                                                    //0x30
    union _CM_TRANS_PTR Trans;                                              //0x38
    struct _GUID* KtmUow;                                                   //0x40
    struct _LIST_ENTRY ContextListHead;                                     //0x48
    VOID* EnumerationResumeContext;                                         //0x58
    ULONG RestrictedAccessMask;                                             //0x60
}; 
//0x138 bytes (sizeof)
struct _CM_KEY_CONTROL_BLOCK
{
    ULONGLONG RefCount;                                                     //0x0
    ULONG ExtFlags:16;                                                      //0x8
    ULONG Freed:1;                                                          //0x8
    ULONG Discarded:1;                                                      //0x8
    ULONG HiveUnloaded:1;                                                   //0x8
    ULONG Decommissioned:1;                                                 //0x8
    ULONG SpareExtFlag:1;                                                   //0x8
    ULONG TotalLevels:10;                                                   //0x8
    union
    {
        struct _CM_KEY_HASH KeyHash;                                        //0x10
        struct
        {
            struct _CM_PATH_HASH ConvKey;                                   //0x10
            struct _CM_KEY_HASH* NextHash;                                  //0x18
            struct _HHIVE* KeyHive;                                         //0x20
            ULONG KeyCell;                                                  //0x28
        };
    };
    struct _EX_PUSH_LOCK KcbPushlock;                                       //0x30
    union
    {
        struct _KTHREAD* Owner;                                             //0x38
        LONG SharedCount;                                                   //0x38
    };
    UCHAR DelayedDeref:1;                                                   //0x40
    UCHAR DelayedClose:1;                                                   //0x40
    UCHAR Parking:1;                                                        //0x40
    UCHAR LayerSemantics;                                                   //0x41
    SHORT LayerHeight;                                                      //0x42
    ULONG Spare1;                                                           //0x44
    struct _CM_KEY_CONTROL_BLOCK* ParentKcb;                                //0x48
    struct _CM_NAME_CONTROL_BLOCK* NameBlock;                               //0x50
    struct _CM_KEY_SECURITY_CACHE* CachedSecurity;                          //0x58
    struct _CHILD_LIST ValueList;                                           //0x60
    struct _CM_KEY_CONTROL_BLOCK* LinkTarget;                               //0x68
    union
    {
        struct _CM_INDEX_HINT_BLOCK* IndexHint;                             //0x70
        ULONG HashKey;                                                      //0x70
        ULONG SubKeyCount;                                                  //0x70
    };
    union
    {
        struct _LIST_ENTRY KeyBodyListHead;                                 //0x78
        struct _LIST_ENTRY ClonedListEntry;                                 //0x78
    };
    struct _CM_KEY_BODY* KeyBodyArray[4];                                   //0x88
    union _LARGE_INTEGER KcbLastWriteTime;                                  //0xa8
    USHORT KcbMaxNameLen;                                                   //0xb0
    USHORT KcbMaxValueNameLen;                                              //0xb2
    ULONG KcbMaxValueDataLen;                                               //0xb4
    ULONG KcbUserFlags:4;                                                   //0xb8
    ULONG KcbVirtControlFlags:4;                                            //0xb8
    ULONG KcbDebug:8;                                                       //0xb8
    ULONG Flags:16;                                                         //0xb8
    ULONG Spare3;                                                           //0xbc
    struct _CM_KCB_LAYER_INFO* LayerInfo;                                   //0xc0
    CHAR* RealKeyName;                                                      //0xc8
    struct _LIST_ENTRY KCBUoWListHead;                                      //0xd0
    union
    {
        struct _LIST_ENTRY DelayQueueEntry;                                 //0xe0
        volatile UCHAR* Stolen;                                             //0xe0
    };
    struct _CM_TRANS* TransKCBOwner;                                        //0xf0
    struct _CM_INTENT_LOCK KCBLock;                                         //0xf8
    struct _CM_INTENT_LOCK KeyLock;                                         //0x108
    struct _CHILD_LIST TransValueCache;                                     //0x118
    struct _CM_TRANS* TransValueListOwner;                                  //0x120
    union
    {
        struct _UNICODE_STRING* FullKCBName;                                //0x128
        struct
        {
            ULONGLONG FullKCBNameStale:1;                                   //0x128
            ULONGLONG Reserved:63;                                          //0x128
        };
    };
    ULONGLONG SequenceNumber;                                               //0x130
}; 
//0x20 bytes (sizeof)
struct _CM_KEY_HASH
{
    struct _CM_PATH_HASH ConvKey;                                           //0x0
    struct _CM_KEY_HASH* NextHash;                                          //0x8
    struct _HHIVE* KeyHive;                                                 //0x10
    ULONG KeyCell;                                                          //0x18
}; 
//0x18 bytes (sizeof)
struct _CM_KEY_HASH_TABLE_ENTRY
{
    struct _EX_PUSH_LOCK Lock;                                              //0x0
    struct _KTHREAD* Owner;                                                 //0x8
    struct _CM_KEY_HASH* Entry;                                             //0x10
}; 
//0x8 bytes (sizeof)
struct _CM_KEY_INDEX
{
    USHORT Signature;                                                       //0x0
    USHORT Count;                                                           //0x2
    ULONG List[1];                                                          //0x4
}; 
//0x50 bytes (sizeof)
struct _CM_KEY_NODE
{
    USHORT Signature;                                                       //0x0
    USHORT Flags;                                                           //0x2
    union _LARGE_INTEGER LastWriteTime;                                     //0x4
    UCHAR AccessBits;                                                       //0xc
    UCHAR LayerSemantics:2;                                                 //0xd
    UCHAR Spare1:5;                                                         //0xd
    UCHAR InheritClass:1;                                                   //0xd
    USHORT Spare2;                                                          //0xe
    ULONG Parent;                                                           //0x10
    ULONG SubKeyCounts[2];                                                  //0x14
    union
    {
        struct
        {
            ULONG SubKeyLists[2];                                           //0x1c
            struct _CHILD_LIST ValueList;                                   //0x24
        };
        struct _CM_KEY_REFERENCE ChildHiveReference;                        //0x1c
    };
    ULONG Security;                                                         //0x2c
    ULONG Class;                                                            //0x30
    ULONG MaxNameLen:16;                                                    //0x34
    ULONG UserFlags:4;                                                      //0x34
    ULONG VirtControlFlags:4;                                               //0x34
    ULONG Debug:8;                                                          //0x34
    ULONG MaxClassLen;                                                      //0x38
    ULONG MaxValueNameLen;                                                  //0x3c
    ULONG MaxValueDataLen;                                                  //0x40
    ULONG WorkVar;                                                          //0x44
    USHORT NameLength;                                                      //0x48
    USHORT ClassLength;                                                     //0x4a
    WCHAR Name[1];                                                          //0x4c
}; 
//0x10 bytes (sizeof)
struct _CM_KEY_REFERENCE
{
    ULONG KeyCell;                                                          //0x0
    struct _HHIVE* KeyHive;                                                 //0x8
}; 
//0x28 bytes (sizeof)
struct _CM_KEY_SECURITY
{
    USHORT Signature;                                                       //0x0
    USHORT Reserved;                                                        //0x2
    ULONG Flink;                                                            //0x4
    ULONG Blink;                                                            //0x8
    ULONG ReferenceCount;                                                   //0xc
    ULONG DescriptorLength;                                                 //0x10
    struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor;                        //0x14
}; 
//0x38 bytes (sizeof)
struct _CM_KEY_SECURITY_CACHE
{
    ULONG Cell;                                                             //0x0
    ULONG ConvKey;                                                          //0x4
    struct _LIST_ENTRY List;                                                //0x8
    ULONG DescriptorLength;                                                 //0x18
    ULONG RealRefCount;                                                     //0x1c
    struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor;                        //0x20
}; 
//0x10 bytes (sizeof)
struct _CM_KEY_SECURITY_CACHE_ENTRY
{
    ULONG Cell;                                                             //0x0
    struct _CM_KEY_SECURITY_CACHE* CachedSecurity;                          //0x8
}; 
//0x18 bytes (sizeof)
struct _CM_KEY_VALUE
{
    USHORT Signature;                                                       //0x0
    USHORT NameLength;                                                      //0x2
    ULONG DataLength;                                                       //0x4
    ULONG Data;                                                             //0x8
    ULONG Type;                                                             //0xc
    USHORT Flags;                                                           //0x10
    USHORT Spare;                                                           //0x12
    WCHAR Name[1];                                                          //0x14
}; 
//0x20 bytes (sizeof)
struct _CM_NAME_CONTROL_BLOCK
{
    ULONG Compressed:1;                                                     //0x0
    ULONG RefCount:31;                                                      //0x0
    union
    {
        struct _CM_NAME_HASH NameHash;                                      //0x8
        struct
        {
            struct _CM_COMPONENT_HASH ConvKey;                              //0x8
            struct _CM_KEY_HASH* NextHash;                                  //0x10
            USHORT NameLength;                                              //0x18
            WCHAR Name[1];                                                  //0x1a
        };
    };
}; 
//0x18 bytes (sizeof)
struct _CM_NAME_HASH
{
    struct _CM_COMPONENT_HASH ConvKey;                                      //0x0
    struct _CM_NAME_HASH* NextHash;                                         //0x8
    USHORT NameLength;                                                      //0x10
    WCHAR Name[1];                                                          //0x12
}; 
//0x58 bytes (sizeof)
struct _CM_NOTIFY_BLOCK
{
    struct _LIST_ENTRY HiveList;                                            //0x0
    struct _LIST_ENTRY PostList;                                            //0x10
    struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;                          //0x20
    struct _CM_KEY_BODY* KeyBody;                                           //0x28
    ULONG Filter:30;                                                        //0x30
    ULONG WatchTree:1;                                                      //0x30
    ULONG NotifyPending:1;                                                  //0x30
    struct _SECURITY_SUBJECT_CONTEXT SubjectContext;                        //0x38
}; 
//0x50 bytes (sizeof)
struct _CM_PARSE_DEBUG_INFO
{
    struct _CM_KEY_CONTROL_BLOCK* SymlinkCachedKcb;                         //0x0
    struct _CM_KEY_CONTROL_BLOCK* StartingKcb;                              //0x8
    struct _CM_KEY_CONTROL_BLOCK* KcbCacheResult;                           //0x10
    struct _CM_KEY_CONTROL_BLOCK* WalkResult;                               //0x18
    struct _CM_KEY_CONTROL_BLOCK* DeepestKcbFound;                          //0x20
    UCHAR KcbCacheLevels;                                                   //0x28
    UCHAR WalkLevels;                                                       //0x29
    UCHAR FailureCount;                                                     //0x2a
    struct
    {
        LONG Status;                                                        //0x2c
        ULONG Point;                                                        //0x30
    } FailurePoints[4];                                                     //0x2c
}; 
//0x14 bytes (sizeof)
struct _CM_PARTIAL_RESOURCE_DESCRIPTOR
{
    UCHAR Type;                                                             //0x0
    UCHAR ShareDisposition;                                                 //0x1
    USHORT Flags;                                                           //0x2
    union
    {
        struct
        {
            union _LARGE_INTEGER Start;                                     //0x4
            ULONG Length;                                                   //0xc
        } Generic;                                                          //0x4
        struct
        {
            union _LARGE_INTEGER Start;                                     //0x4
            ULONG Length;                                                   //0xc
        } Port;                                                             //0x4
        struct
        {
            USHORT Level;                                                   //0x4
            USHORT Group;                                                   //0x6
            ULONG Vector;                                                   //0x8
            ULONGLONG Affinity;                                             //0xc
        } Interrupt;                                                        //0x4
        struct
        {
            union
            {
                struct
                {
                    USHORT Group;                                           //0x4
                    USHORT MessageCount;                                    //0x6
                    ULONG Vector;                                           //0x8
                    ULONGLONG Affinity;                                     //0xc
                } Raw;                                                      //0x4
                struct
                {
                    USHORT Level;                                           //0x4
                    USHORT Group;                                           //0x6
                    ULONG Vector;                                           //0x8
                    ULONGLONG Affinity;                                     //0xc
                } Translated;                                               //0x4
            };
        } MessageInterrupt;                                                 //0x4
        struct
        {
            union _LARGE_INTEGER Start;                                     //0x4
            ULONG Length;                                                   //0xc
        } Memory;                                                           //0x4
        struct
        {
            ULONG Channel;                                                  //0x4
            ULONG Port;                                                     //0x8
            ULONG Reserved1;                                                //0xc
        } Dma;                                                              //0x4
        struct
        {
            ULONG Channel;                                                  //0x4
            ULONG RequestLine;                                              //0x8
            UCHAR TransferWidth;                                            //0xc
            UCHAR Reserved1;                                                //0xd
            UCHAR Reserved2;                                                //0xe
            UCHAR Reserved3;                                                //0xf
        } DmaV3;                                                            //0x4
        struct
        {
            ULONG Data[3];                                                  //0x4
        } DevicePrivate;                                                    //0x4
        struct
        {
            ULONG Start;                                                    //0x4
            ULONG Length;                                                   //0x8
            ULONG Reserved;                                                 //0xc
        } BusNumber;                                                        //0x4
        struct
        {
            ULONG DataSize;                                                 //0x4
            ULONG Reserved1;                                                //0x8
            ULONG Reserved2;                                                //0xc
        } DeviceSpecificData;                                               //0x4
        struct
        {
            union _LARGE_INTEGER Start;                                     //0x4
            ULONG Length40;                                                 //0xc
        } Memory40;                                                         //0x4
        struct
        {
            union _LARGE_INTEGER Start;                                     //0x4
            ULONG Length48;                                                 //0xc
        } Memory48;                                                         //0x4
        struct
        {
            union _LARGE_INTEGER Start;                                     //0x4
            ULONG Length64;                                                 //0xc
        } Memory64;                                                         //0x4
        struct
        {
            UCHAR Class;                                                    //0x4
            UCHAR Type;                                                     //0x5
            UCHAR Reserved1;                                                //0x6
            UCHAR Reserved2;                                                //0x7
            ULONG IdLowPart;                                                //0x8
            ULONG IdHighPart;                                               //0xc
        } Connection;                                                       //0x4
    } u;                                                                    //0x4
}; 
//0x1c bytes (sizeof)
struct _CM_PARTIAL_RESOURCE_LIST
{
    USHORT Version;                                                         //0x0
    USHORT Revision;                                                        //0x2
    ULONG Count;                                                            //0x4
    struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];           //0x8
}; 
//0x4 bytes (sizeof)
struct _CM_PATH_HASH
{
    ULONG Hash;                                                             //0x0
}; 
//0x28 bytes (sizeof)
struct _CM_RESOURCE_LIST
{
    ULONG Count;                                                            //0x0
    struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];                            //0x4
}; 
//0x88 bytes (sizeof)
struct _CM_RM
{
    struct _LIST_ENTRY RmListEntry;                                         //0x0
    struct _LIST_ENTRY TransactionListHead;                                 //0x10
    VOID* TmHandle;                                                         //0x20
    VOID* Tm;                                                               //0x28
    VOID* RmHandle;                                                         //0x30
    VOID* KtmRm;                                                            //0x38
    ULONG RefCount;                                                         //0x40
    ULONG ContainerNum;                                                     //0x44
    ULONGLONG ContainerSize;                                                //0x48
    struct _CMHIVE* CmHive;                                                 //0x50
    VOID* LogFileObject;                                                    //0x58
    VOID* MarshallingContext;                                               //0x60
    ULONG RmFlags;                                                          //0x68
    LONG LogStartStatus1;                                                   //0x6c
    LONG LogStartStatus2;                                                   //0x70
    ULONGLONG BaseLsn;                                                      //0x78
    struct _ERESOURCE* RmLock;                                              //0x80
}; 
//0xb8 bytes (sizeof)
struct _CM_TRANS
{
    struct _LIST_ENTRY TransactionListEntry;                                //0x0
    struct _LIST_ENTRY KCBUoWListHead;                                      //0x10
    struct _LIST_ENTRY LazyCommitListEntry;                                 //0x20
    union
    {
        struct
        {
            ULONG Prepared:1;                                               //0x30
            ULONG Aborted:1;                                                //0x30
            ULONG Committed:1;                                              //0x30
            ULONG Initializing:1;                                           //0x30
            ULONG Invalid:1;                                                //0x30
            ULONG UseReservation:1;                                         //0x30
            ULONG TmCallbacksActive:1;                                      //0x30
            ULONG LightWeight:1;                                            //0x30
            ULONG Freed1:1;                                                 //0x30
            ULONG Freed2:1;                                                 //0x30
            ULONG Spare1:2;                                                 //0x30
            ULONG Freed:1;                                                  //0x30
            ULONG Spare:19;                                                 //0x30
        };
        ULONG TransState;                                                   //0x30
    };
    union _CM_TRANS_PTR Trans;                                              //0x38
    struct _CM_RM* CmRm;                                                    //0x40
    struct _KENLISTMENT* KtmEnlistmentObject;                               //0x48
    VOID* KtmEnlistmentHandle;                                              //0x50
    struct _GUID KtmUow;                                                    //0x58
    ULONGLONG StartLsn;                                                     //0x68
    ULONG HiveCount;                                                        //0x70
    struct _CMHIVE* HiveArray[8];                                           //0x78
}; 
//0x14 bytes (sizeof)
struct _CM_UOW_KEY_STATE_MODIFICATION
{
    ULONG RefCount;                                                         //0x0
    ULONG SubKeyListCount[2];                                               //0x4
    ULONG NewSubKeyList[2];                                                 //0xc
}; 
//0x4 bytes (sizeof)
struct _CM_UOW_SET_SD_DATA
{
    ULONG SecurityCell;                                                     //0x0
}; 
//0x10 bytes (sizeof)
struct _CM_UOW_SET_VALUE_KEY_DATA
{
    ULONG PreparedCell;                                                     //0x0
    ULONG OldValueCell;                                                     //0x4
    USHORT NameLength;                                                      //0x8
    ULONG DataSize;                                                         //0xc
}; 
//0xc bytes (sizeof)
struct _CM_UOW_SET_VALUE_LIST_DATA
{
    ULONG RefCount;                                                         //0x0
    struct _CHILD_LIST ValueList;                                           //0x4
}; 
//0x28 bytes (sizeof)
struct _CM_WORKITEM
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    ULONG Private;                                                          //0x10
    VOID (*WorkerRoutine)(VOID* arg1);                                      //0x18
    VOID* Parameter;                                                        //0x20
}; 
//0xc bytes (sizeof)
struct _COMPRESSED_DATA_INFO
{
    USHORT CompressionFormatAndEngine;                                      //0x0
    UCHAR CompressionUnitShift;                                             //0x2
    UCHAR ChunkShift;                                                       //0x3
    UCHAR ClusterShift;                                                     //0x4
    UCHAR Reserved;                                                         //0x5
    USHORT NumberOfChunks;                                                  //0x6
    ULONG CompressedChunkSizes[1];                                          //0x8
}; 
//0x28 bytes (sizeof)
struct _CONFIGURATION_COMPONENT
{
    enum _CONFIGURATION_CLASS Class;                                        //0x0
    enum _CONFIGURATION_TYPE Type;                                          //0x4
    struct _DEVICE_FLAGS Flags;                                             //0x8
    USHORT Version;                                                         //0xc
    USHORT Revision;                                                        //0xe
    ULONG Key;                                                              //0x10
    union
    {
        ULONG AffinityMask;                                                 //0x14
        struct
        {
            USHORT Group;                                                   //0x14
            USHORT GroupIndex;                                              //0x16
        };
    };
    ULONG ConfigurationDataLength;                                          //0x18
    ULONG IdentifierLength;                                                 //0x1c
    CHAR* Identifier;                                                       //0x20
}; 
//0x48 bytes (sizeof)
struct _CONFIGURATION_COMPONENT_DATA
{
    struct _CONFIGURATION_COMPONENT_DATA* Parent;                           //0x0
    struct _CONFIGURATION_COMPONENT_DATA* Child;                            //0x8
    struct _CONFIGURATION_COMPONENT_DATA* Sibling;                          //0x10
    struct _CONFIGURATION_COMPONENT ComponentEntry;                         //0x18
    VOID* ConfigurationData;                                                //0x40
}; 
//0x4d0 bytes (sizeof)
struct _CONTEXT
{
    ULONGLONG P1Home;                                                       //0x0
    ULONGLONG P2Home;                                                       //0x8
    ULONGLONG P3Home;                                                       //0x10
    ULONGLONG P4Home;                                                       //0x18
    ULONGLONG P5Home;                                                       //0x20
    ULONGLONG P6Home;                                                       //0x28
    ULONG ContextFlags;                                                     //0x30
    ULONG MxCsr;                                                            //0x34
    USHORT SegCs;                                                           //0x38
    USHORT SegDs;                                                           //0x3a
    USHORT SegEs;                                                           //0x3c
    USHORT SegFs;                                                           //0x3e
    USHORT SegGs;                                                           //0x40
    USHORT SegSs;                                                           //0x42
    ULONG EFlags;                                                           //0x44
    ULONGLONG Dr0;                                                          //0x48
    ULONGLONG Dr1;                                                          //0x50
    ULONGLONG Dr2;                                                          //0x58
    ULONGLONG Dr3;                                                          //0x60
    ULONGLONG Dr6;                                                          //0x68
    ULONGLONG Dr7;                                                          //0x70
    ULONGLONG Rax;                                                          //0x78
    ULONGLONG Rcx;                                                          //0x80
    ULONGLONG Rdx;                                                          //0x88
    ULONGLONG Rbx;                                                          //0x90
    ULONGLONG Rsp;                                                          //0x98
    ULONGLONG Rbp;                                                          //0xa0
    ULONGLONG Rsi;                                                          //0xa8
    ULONGLONG Rdi;                                                          //0xb0
    ULONGLONG R8;                                                           //0xb8
    ULONGLONG R9;                                                           //0xc0
    ULONGLONG R10;                                                          //0xc8
    ULONGLONG R11;                                                          //0xd0
    ULONGLONG R12;                                                          //0xd8
    ULONGLONG R13;                                                          //0xe0
    ULONGLONG R14;                                                          //0xe8
    ULONGLONG R15;                                                          //0xf0
    ULONGLONG Rip;                                                          //0xf8
    union
    {
        struct _XSAVE_FORMAT FltSave;                                       //0x100
        struct
        {
            struct _M128A Header[2];                                        //0x100
            struct _M128A Legacy[8];                                        //0x120
            struct _M128A Xmm0;                                             //0x1a0
            struct _M128A Xmm1;                                             //0x1b0
            struct _M128A Xmm2;                                             //0x1c0
            struct _M128A Xmm3;                                             //0x1d0
            struct _M128A Xmm4;                                             //0x1e0
            struct _M128A Xmm5;                                             //0x1f0
            struct _M128A Xmm6;                                             //0x200
            struct _M128A Xmm7;                                             //0x210
            struct _M128A Xmm8;                                             //0x220
            struct _M128A Xmm9;                                             //0x230
            struct _M128A Xmm10;                                            //0x240
            struct _M128A Xmm11;                                            //0x250
            struct _M128A Xmm12;                                            //0x260
            struct _M128A Xmm13;                                            //0x270
            struct _M128A Xmm14;                                            //0x280
            struct _M128A Xmm15;                                            //0x290
        };
    };
    struct _M128A VectorRegister[26];                                       //0x300
    ULONGLONG VectorControl;                                                //0x4a0
    ULONGLONG DebugControl;                                                 //0x4a8
    ULONGLONG LastBranchToRip;                                              //0x4b0
    ULONGLONG LastBranchFromRip;                                            //0x4b8
    ULONGLONG LastExceptionToRip;                                           //0x4c0
    ULONGLONG LastExceptionFromRip;                                         //0x4c8
}; 
//0x48 bytes (sizeof)
struct _CONTROLLER_OBJECT
{
    SHORT Type;                                                             //0x0
    SHORT Size;                                                             //0x2
    VOID* ControllerExtension;                                              //0x8
    struct _KDEVICE_QUEUE DeviceWaitQueue;                                  //0x10
    ULONG Spare1;                                                           //0x38
    union _LARGE_INTEGER Spare2;                                            //0x40
};
//0x80 bytes (sizeof)
struct _CONTROL_AREA
{
    struct _SEGMENT* Segment;                                               //0x0
    union
    {
        struct _LIST_ENTRY ListHead;                                        //0x8
        VOID* AweContext;                                                   //0x8
    };
    ULONGLONG NumberOfSectionReferences;                                    //0x18
    ULONGLONG NumberOfPfnReferences;                                        //0x20
    ULONGLONG NumberOfMappedViews;                                          //0x28
    ULONGLONG NumberOfUserReferences;                                       //0x30
    union
    {
        ULONG LongFlags;                                                    //0x38
        struct _MMSECTION_FLAGS Flags;                                      //0x38
    } u;                                                                    //0x38
    union
    {
        ULONG LongFlags;                                                    //0x3c
        struct _MMSECTION_FLAGS2 Flags;                                     //0x3c
    } u1;                                                                   //0x3c
    struct _EX_FAST_REF FilePointer;                                        //0x40
    volatile LONG ControlAreaLock;                                          //0x48
    ULONG ModifiedWriteCount;                                               //0x4c
    struct _MI_CONTROL_AREA_WAIT_BLOCK* WaitList;                           //0x50
    union
    {
        struct
        {
            union
            {
                ULONG NumberOfSystemCacheViews;                             //0x58
                ULONG ImageRelocationStartBit;                              //0x58
            };
            union
            {
                volatile LONG WritableUserReferences;                       //0x5c
                struct
                {
                    ULONG ImageRelocationSizeIn64k:16;                      //0x5c
                    ULONG SystemImage:1;                                    //0x5c
                    ULONG CantMove:1;                                       //0x5c
                    ULONG StrongCode:2;                                     //0x5c
                    ULONG BitMap:2;                                         //0x5c
                    ULONG ImageActive:1;                                    //0x5c
                    ULONG ImageBaseOkToReuse:1;                             //0x5c
                };
            };
            union
            {
                ULONG FlushInProgressCount;                                 //0x60
                ULONG NumberOfSubsections;                                  //0x60
                struct _MI_IMAGE_SECURITY_REFERENCE* SeImageStub;           //0x60
            };
        } e2;                                                               //0x58
    } u2;                                                                   //0x58
    struct _EX_PUSH_LOCK FileObjectLock;                                    //0x68
    volatile ULONGLONG LockedPages;                                         //0x70
    union
    {
        ULONGLONG IoAttributionContext:61;                                  //0x78
        ULONGLONG Spare:3;                                                  //0x78
        ULONGLONG ImageCrossPartitionCharge;                                //0x78
        ULONGLONG CommittedPageCount:36;                                    //0x78
    } u3;                                                                   //0x78
}; 
//0x18 bytes (sizeof)
struct _COUNTER_READING
{
    enum _HARDWARE_COUNTER_TYPE Type;                                       //0x0
    ULONG Index;                                                            //0x4
    ULONGLONG Start;                                                        //0x8
    ULONGLONG Total;                                                        //0x10
}; 
//0x30 bytes (sizeof)
struct _CRITICAL_PROCESS_EXCEPTION_DATA
{
    struct _GUID ReportId;                                                  //0x0
    struct _UNICODE_STRING ModuleName;                                      //0x10
    ULONG ModuleTimestamp;                                                  //0x20
    ULONG ModuleSize;                                                       //0x24
    ULONGLONG Offset;                                                       //0x28
};
//0x18 bytes (sizeof)
struct _CURDIR
{
    struct _UNICODE_STRING DosPath;                                         //0x0
    VOID* Handle;                                                           //0x10
}; 
//0x10 bytes (sizeof)
struct _CUSTOM_SYSTEM_EVENT_TRIGGER_CONFIG
{
    ULONG Size;                                                             //0x0
    WCHAR* TriggerId;                                                       //0x8
};
//0x1c bytes (sizeof)
struct _DBGKD_ANY_CONTROL_SET
{
    union
    {
        struct _X86_DBGKD_CONTROL_SET X86ControlSet;                        //0x0
        ULONG AlphaControlSet;                                              //0x0
        struct _IA64_DBGKD_CONTROL_SET IA64ControlSet;                      //0x0
        struct _AMD64_DBGKD_CONTROL_SET Amd64ControlSet;                    //0x0
        struct _ARM_DBGKD_CONTROL_SET ArmControlSet;                        //0x0
        struct _ARM64_DBGKD_CONTROL_SET Arm64ControlSet;                    //0x0
        struct _ARMCE_DBGKD_CONTROL_SET ArmCeControlSet;                    //0x0
        struct _PPC_DBGKD_CONTROL_SET PpcControlSet;                        //0x0
    };
}; 
//0x8 bytes (sizeof)
struct _DBGKD_BREAKPOINTEX
{
    ULONG BreakPointCount;                                                  //0x0
    LONG ContinueStatus;                                                    //0x4
}; 
//0xc bytes (sizeof)
struct _DBGKD_CONTEXT_EX
{
    ULONG Offset;                                                           //0x0
    ULONG ByteCount;                                                        //0x4
    ULONG BytesCopied;                                                      //0x8
}; 
//0x4 bytes (sizeof)
struct _DBGKD_CONTINUE
{
    LONG ContinueStatus;                                                    //0x0
}; 
//0x20 bytes (sizeof)
struct _DBGKD_CONTINUE2
{
    LONG ContinueStatus;                                                    //0x0
    union
    {
        struct _AMD64_DBGKD_CONTROL_SET ControlSet;                         //0x4
        struct _DBGKD_ANY_CONTROL_SET AnyControlSet;                        //0x4
    };
}; 
//0x10 bytes (sizeof)
struct _DBGKD_FILL_MEMORY
{
    ULONGLONG Address;                                                      //0x0
    ULONG Length;                                                           //0x8
    USHORT Flags;                                                           //0xc
    USHORT PatternLength;                                                   //0xe
}; 
//0x4 bytes (sizeof)
struct _DBGKD_GET_CONTEXT
{
    ULONG Unused;                                                           //0x0
}; 
//0x1c bytes (sizeof)
struct _DBGKD_GET_INTERNAL_BREAKPOINT32
{
    ULONG BreakpointAddress;                                                //0x0
    ULONG Flags;                                                            //0x4
    ULONG Calls;                                                            //0x8
    ULONG MaxCallsPerPeriod;                                                //0xc
    ULONG MinInstructions;                                                  //0x10
    ULONG MaxInstructions;                                                  //0x14
    ULONG TotalInstructions;                                                //0x18
}; 
//0x20 bytes (sizeof)
struct _DBGKD_GET_INTERNAL_BREAKPOINT64
{
    ULONGLONG BreakpointAddress;                                            //0x0
    ULONG Flags;                                                            //0x8
    ULONG Calls;                                                            //0xc
    ULONG MaxCallsPerPeriod;                                                //0x10
    ULONG MinInstructions;                                                  //0x14
    ULONG MaxInstructions;                                                  //0x18
    ULONG TotalInstructions;                                                //0x1c
}; 
//0x14 bytes (sizeof)
struct _DBGKD_GET_SET_BUS_DATA
{
    ULONG BusDataType;                                                      //0x0
    ULONG BusNumber;                                                        //0x4
    ULONG SlotNumber;                                                       //0x8
    ULONG Offset;                                                           //0xc
    ULONG Length;                                                           //0x10
}; 
//0x28 bytes (sizeof)
struct _DBGKD_GET_VERSION32
{
    USHORT MajorVersion;                                                    //0x0
    USHORT MinorVersion;                                                    //0x2
    USHORT ProtocolVersion;                                                 //0x4
    USHORT Flags;                                                           //0x6
    ULONG KernBase;                                                         //0x8
    ULONG PsLoadedModuleList;                                               //0xc
    USHORT MachineType;                                                     //0x10
    USHORT ThCallbackStack;                                                 //0x12
    USHORT NextCallback;                                                    //0x14
    USHORT FramePointer;                                                    //0x16
    ULONG KiCallUserMode;                                                   //0x18
    ULONG KeUserCallbackDispatcher;                                         //0x1c
    ULONG BreakpointWithStatus;                                             //0x20
    ULONG DebuggerDataList;                                                 //0x24
}; 
//0x28 bytes (sizeof)
struct _DBGKD_GET_VERSION64
{
    USHORT MajorVersion;                                                    //0x0
    USHORT MinorVersion;                                                    //0x2
    UCHAR ProtocolVersion;                                                  //0x4
    UCHAR KdSecondaryVersion;                                               //0x5
    USHORT Flags;                                                           //0x6
    USHORT MachineType;                                                     //0x8
    UCHAR MaxPacketType;                                                    //0xa
    UCHAR MaxStateChange;                                                   //0xb
    UCHAR MaxManipulate;                                                    //0xc
    UCHAR Simulation;                                                       //0xd
    USHORT Unused[1];                                                       //0xe
    ULONGLONG KernBase;                                                     //0x10
    ULONGLONG PsLoadedModuleList;                                           //0x18
    ULONGLONG DebuggerDataList;                                             //0x20
}; 
//0x18 bytes (sizeof)
struct _DBGKD_LOAD_SYMBOLS32
{
    ULONG PathNameLength;                                                   //0x0
    ULONG BaseOfDll;                                                        //0x4
    ULONG ProcessId;                                                        //0x8
    ULONG CheckSum;                                                         //0xc
    ULONG SizeOfImage;                                                      //0x10
    UCHAR UnloadSymbols;                                                    //0x14
};
//0x28 bytes (sizeof)
struct _DBGKD_LOAD_SYMBOLS64
{
    ULONG PathNameLength;                                                   //0x0
    ULONGLONG BaseOfDll;                                                    //0x8
    ULONGLONG ProcessId;                                                    //0x10
    ULONG CheckSum;                                                         //0x18
    ULONG SizeOfImage;                                                      //0x1c
    UCHAR UnloadSymbols;                                                    //0x20
};
//0x34 bytes (sizeof)
struct _DBGKD_MANIPULATE_STATE32
{
    ULONG ApiNumber;                                                        //0x0
    USHORT ProcessorLevel;                                                  //0x4
    USHORT Processor;                                                       //0x6
    LONG ReturnStatus;                                                      //0x8
    union
    {
        struct _DBGKD_READ_MEMORY32 ReadMemory;                             //0xc
        struct _DBGKD_WRITE_MEMORY32 WriteMemory;                           //0xc
        struct _DBGKD_READ_MEMORY64 ReadMemory64;                           //0xc
        struct _DBGKD_WRITE_MEMORY64 WriteMemory64;                         //0xc
        struct _DBGKD_GET_CONTEXT GetContext;                               //0xc
        struct _DBGKD_SET_CONTEXT SetContext;                               //0xc
        struct _DBGKD_WRITE_BREAKPOINT32 WriteBreakPoint;                   //0xc
        struct _DBGKD_RESTORE_BREAKPOINT RestoreBreakPoint;                 //0xc
        struct _DBGKD_CONTINUE Continue;                                    //0xc
        struct _DBGKD_CONTINUE2 Continue2;                                  //0xc
        struct _DBGKD_READ_WRITE_IO32 ReadWriteIo;                          //0xc
        struct _DBGKD_READ_WRITE_IO_EXTENDED32 ReadWriteIoExtended;         //0xc
        struct _DBGKD_QUERY_SPECIAL_CALLS QuerySpecialCalls;                //0xc
        struct _DBGKD_SET_SPECIAL_CALL32 SetSpecialCall;                    //0xc
        struct _DBGKD_SET_INTERNAL_BREAKPOINT32 SetInternalBreakpoint;      //0xc
        struct _DBGKD_GET_INTERNAL_BREAKPOINT32 GetInternalBreakpoint;      //0xc
        struct _DBGKD_GET_VERSION32 GetVersion32;                           //0xc
        struct _DBGKD_BREAKPOINTEX BreakPointEx;                            //0xc
        struct _DBGKD_READ_WRITE_MSR ReadWriteMsr;                          //0xc
        struct _DBGKD_SEARCH_MEMORY SearchMemory;                           //0xc
        struct _DBGKD_CONTEXT_EX GetContextEx;                              //0xc
        struct _DBGKD_CONTEXT_EX SetContextEx;                              //0xc
    } u;                                                                    //0xc
};
//0x38 bytes (sizeof)
struct _DBGKD_MANIPULATE_STATE64
{
    ULONG ApiNumber;                                                        //0x0
    USHORT ProcessorLevel;                                                  //0x4
    USHORT Processor;                                                       //0x6
    LONG ReturnStatus;                                                      //0x8
    union
    {
        struct _DBGKD_READ_MEMORY64 ReadMemory;                             //0x10
        struct _DBGKD_WRITE_MEMORY64 WriteMemory;                           //0x10
        struct _DBGKD_GET_CONTEXT GetContext;                               //0x10
        struct _DBGKD_SET_CONTEXT SetContext;                               //0x10
        struct _DBGKD_WRITE_BREAKPOINT64 WriteBreakPoint;                   //0x10
        struct _DBGKD_RESTORE_BREAKPOINT RestoreBreakPoint;                 //0x10
        struct _DBGKD_CONTINUE Continue;                                    //0x10
        struct _DBGKD_CONTINUE2 Continue2;                                  //0x10
        struct _DBGKD_READ_WRITE_IO64 ReadWriteIo;                          //0x10
        struct _DBGKD_READ_WRITE_IO_EXTENDED64 ReadWriteIoExtended;         //0x10
        struct _DBGKD_QUERY_SPECIAL_CALLS QuerySpecialCalls;                //0x10
        struct _DBGKD_SET_SPECIAL_CALL64 SetSpecialCall;                    //0x10
        struct _DBGKD_SET_INTERNAL_BREAKPOINT64 SetInternalBreakpoint;      //0x10
        struct _DBGKD_GET_INTERNAL_BREAKPOINT64 GetInternalBreakpoint;      //0x10
        struct _DBGKD_GET_VERSION64 GetVersion64;                           //0x10
        struct _DBGKD_BREAKPOINTEX BreakPointEx;                            //0x10
        struct _DBGKD_READ_WRITE_MSR ReadWriteMsr;                          //0x10
        struct _DBGKD_SEARCH_MEMORY SearchMemory;                           //0x10
        struct _DBGKD_GET_SET_BUS_DATA GetSetBusData;                       //0x10
        struct _DBGKD_FILL_MEMORY FillMemory;                               //0x10
        struct _DBGKD_QUERY_MEMORY QueryMemory;                             //0x10
        struct _DBGKD_SWITCH_PARTITION SwitchPartition;                     //0x10
        struct _DBGKD_CONTEXT_EX GetContextEx;                              //0x10
        struct _DBGKD_CONTEXT_EX SetContextEx;                              //0x10
        struct _DBGKD_WRITE_CUSTOM_BREAKPOINT WriteCustomBreakPoint;        //0x10
    } u;                                                                    //0x10
};
//0x18 bytes (sizeof)
struct _DBGKD_QUERY_MEMORY
{
    ULONGLONG Address;                                                      //0x0
    ULONGLONG Reserved;                                                     //0x8
    ULONG AddressSpace;                                                     //0x10
    ULONG Flags;                                                            //0x14
}; 
//0x4 bytes (sizeof)
struct _DBGKD_QUERY_SPECIAL_CALLS
{
    ULONG NumberOfSpecialCalls;                                             //0x0
}; 
//0xc bytes (sizeof)
struct _DBGKD_READ_MEMORY32
{
    ULONG TargetBaseAddress;                                                //0x0
    ULONG TransferCount;                                                    //0x4
    ULONG ActualBytesRead;                                                  //0x8
}; 
//0x10 bytes (sizeof)
struct _DBGKD_READ_MEMORY64
{
    ULONGLONG TargetBaseAddress;                                            //0x0
    ULONG TransferCount;                                                    //0x8
    ULONG ActualBytesRead;                                                  //0xc
}; 
//0xc bytes (sizeof)
struct _DBGKD_READ_WRITE_IO32
{
    ULONG DataSize;                                                         //0x0
    ULONG IoAddress;                                                        //0x4
    ULONG DataValue;                                                        //0x8
}; 
//0x10 bytes (sizeof)
struct _DBGKD_READ_WRITE_IO64
{
    ULONGLONG IoAddress;                                                    //0x0
    ULONG DataSize;                                                         //0x8
    ULONG DataValue;                                                        //0xc
}; 
//0x18 bytes (sizeof)
struct _DBGKD_READ_WRITE_IO_EXTENDED32
{
    ULONG DataSize;                                                         //0x0
    ULONG InterfaceType;                                                    //0x4
    ULONG BusNumber;                                                        //0x8
    ULONG AddressSpace;                                                     //0xc
    ULONG IoAddress;                                                        //0x10
    ULONG DataValue;                                                        //0x14
}; 
//0x20 bytes (sizeof)
struct _DBGKD_READ_WRITE_IO_EXTENDED64
{
    ULONG DataSize;                                                         //0x0
    ULONG InterfaceType;                                                    //0x4
    ULONG BusNumber;                                                        //0x8
    ULONG AddressSpace;                                                     //0xc
    ULONGLONG IoAddress;                                                    //0x10
    ULONG DataValue;                                                        //0x18
}; 
//0xc bytes (sizeof)
struct _DBGKD_READ_WRITE_MSR
{
    ULONG Msr;                                                              //0x0
    ULONG DataValueLow;                                                     //0x4
    ULONG DataValueHigh;                                                    //0x8
}; 
//0x4 bytes (sizeof)
struct _DBGKD_RESTORE_BREAKPOINT
{
    ULONG BreakPointHandle;                                                 //0x0
}; 
//0x18 bytes (sizeof)
struct _DBGKD_SEARCH_MEMORY
{
    union
    {
        ULONGLONG SearchAddress;                                            //0x0
        ULONGLONG FoundAddress;                                             //0x0
    };
    ULONGLONG SearchLength;                                                 //0x8
    ULONG PatternLength;                                                    //0x10
}; 
//0x4 bytes (sizeof)
struct _DBGKD_SET_CONTEXT
{
    ULONG ContextFlags;                                                     //0x0
}; 
//0x8 bytes (sizeof)
struct _DBGKD_SET_INTERNAL_BREAKPOINT32
{
    ULONG BreakpointAddress;                                                //0x0
    ULONG Flags;                                                            //0x4
}; 
//0x10 bytes (sizeof)
struct _DBGKD_SET_INTERNAL_BREAKPOINT64
{
    ULONGLONG BreakpointAddress;                                            //0x0
    ULONG Flags;                                                            //0x8
}; 
//0x4 bytes (sizeof)
struct _DBGKD_SET_SPECIAL_CALL32
{
    ULONG SpecialCall;                                                      //0x0
}; 
//0x8 bytes (sizeof)
struct _DBGKD_SET_SPECIAL_CALL64
{
    ULONGLONG SpecialCall;                                                  //0x0
}; 
//0x4 bytes (sizeof)
struct _DBGKD_SWITCH_PARTITION
{
    ULONG Partition;                                                        //0x0
}; 
//0x8 bytes (sizeof)
struct _DBGKD_WRITE_BREAKPOINT32
{
    ULONG BreakPointAddress;                                                //0x0
    ULONG BreakPointHandle;                                                 //0x4
}; 
//0x10 bytes (sizeof)
struct _DBGKD_WRITE_BREAKPOINT64
{
    ULONGLONG BreakPointAddress;                                            //0x0
    ULONG BreakPointHandle;                                                 //0x8
}; 
//0x18 bytes (sizeof)
struct _DBGKD_WRITE_CUSTOM_BREAKPOINT
{
    ULONGLONG BreakPointAddress;                                            //0x0
    ULONGLONG BreakPointInstruction;                                        //0x8
    ULONG BreakPointHandle;                                                 //0x10
    UCHAR BreakPointInstructionSize;                                        //0x14
    UCHAR BreakPointInstructionAlignment;                                   //0x15
}; 
//0xc bytes (sizeof)
struct _DBGKD_WRITE_MEMORY32
{
    ULONG TargetBaseAddress;                                                //0x0
    ULONG TransferCount;                                                    //0x4
    ULONG ActualBytesWritten;                                               //0x8
}; 
//0x10 bytes (sizeof)
struct _DBGKD_WRITE_MEMORY64
{
    ULONGLONG TargetBaseAddress;                                            //0x0
    ULONG TransferCount;                                                    //0x8
    ULONG ActualBytesWritten;                                               //0xc
}; 
//0x54 bytes (sizeof)
struct _DBGKM_EXCEPTION32
{
    struct _EXCEPTION_RECORD32 ExceptionRecord;                             //0x0
    ULONG FirstChance;                                                      //0x50
};
//0xa0 bytes (sizeof)
struct _DBGKM_EXCEPTION64
{
    struct _EXCEPTION_RECORD64 ExceptionRecord;                             //0x0
    ULONG FirstChance;                                                      //0x98
};
//0x0 bytes (sizeof)
struct _DBGKP_ERROR_PORT; 
//0x20 bytes (sizeof)
struct _DBGK_SILOSTATE
{
    struct _EX_PUSH_LOCK ErrorPortLock;                                     //0x0
    struct _DBGKP_ERROR_PORT* ErrorPort;                                    //0x8
    struct _EPROCESS* ErrorProcess;                                         //0x10
    struct _KEVENT* ErrorPortRegisteredEvent;                               //0x18
}; 
//0xf8 bytes (sizeof)
struct _DEBUG_DEVICE_DESCRIPTOR
{
    ULONG Bus;                                                              //0x0
    ULONG Slot;                                                             //0x4
    USHORT Segment;                                                         //0x8
    USHORT VendorID;                                                        //0xa
    USHORT DeviceID;                                                        //0xc
    UCHAR BaseClass;                                                        //0xe
    UCHAR SubClass;                                                         //0xf
    UCHAR ProgIf;                                                           //0x10
    union
    {
        UCHAR Flags;                                                        //0x11
        struct
        {
            UCHAR DbgHalScratchAllocated:1;                                 //0x11
            UCHAR DbgBarsMapped:1;                                          //0x11
            UCHAR DbgScratchAllocated:1;                                    //0x11
        };
    };
    UCHAR Initialized;                                                      //0x12
    UCHAR Configured;                                                       //0x13
    struct DEBUG_DEVICE_ADDRESS BaseAddress[6];                             //0x18
    struct DEBUG_MEMORY_REQUIREMENTS Memory;                                //0xa8
    ULONG Dbg2TableIndex;                                                   //0xc8
    USHORT PortType;                                                        //0xcc
    USHORT PortSubtype;                                                     //0xce
    VOID* OemData;                                                          //0xd0
    ULONG OemDataLength;                                                    //0xd8
    enum KD_NAMESPACE_ENUM NameSpace;                                       //0xdc
    WCHAR* NameSpacePath;                                                   //0xe0
    ULONG NameSpacePathLength;                                              //0xe8
    ULONG TransportType;                                                    //0xec
    struct _DEBUG_TRANSPORT_DATA TransportData;                             //0xf0
}; 
//0x8 bytes (sizeof)
struct _DEBUG_TRANSPORT_DATA
{
    ULONG HwContextSize;                                                    //0x0
    UCHAR UseSerialFraming;                                                 //0x4
    UCHAR ValidUSBCoreId;                                                   //0x5
    UCHAR USBCoreId;                                                        //0x6
}; 
//0x60 bytes (sizeof)
struct _DEFERRED_WRITE
{
    SHORT NodeTypeCode;                                                     //0x0
    SHORT NodeByteSize;                                                     //0x2
    struct _FILE_OBJECT* FileObject;                                        //0x8
    ULONG BytesToWrite;                                                     //0x10
    struct _LIST_ENTRY DeferredWriteLinks;                                  //0x18
    struct _KEVENT* Event;                                                  //0x28
    VOID (*PostRoutine)(VOID* arg1, VOID* arg2);                            //0x30
    VOID* Context1;                                                         //0x38
    VOID* Context2;                                                         //0x40
    struct _CC_PARTITION* Partition;                                        //0x48
    UCHAR SoftThrottle;                                                     //0x50
    union _LARGE_INTEGER TimeAdded;                                         //0x58
};
//0x18 bytes (sizeof)
struct _DELAY_ACK_FO
{
    struct _LIST_ENTRY Links;                                               //0x0
    struct _FILE_OBJECT* OriginalFileObject;                                //0x10
};
//0x24 bytes (sizeof)
struct _DESCRIPTION_HEADER
{
    ULONG Signature;                                                        //0x0
    ULONG Length;                                                           //0x4
    UCHAR Revision;                                                         //0x8
    UCHAR Checksum;                                                         //0x9
    CHAR OEMID[6];                                                          //0xa
    CHAR OEMTableID[8];                                                     //0x10
    ULONG OEMRevision;                                                      //0x18
    CHAR CreatorID[4];                                                      //0x1c
    ULONG CreatorRev;                                                       //0x20
}; 
//0x40 bytes (sizeof)
struct _DEVICE_CAPABILITIES
{
    USHORT Size;                                                            //0x0
    USHORT Version;                                                         //0x2
    ULONG DeviceD1:1;                                                       //0x4
    ULONG DeviceD2:1;                                                       //0x4
    ULONG LockSupported:1;                                                  //0x4
    ULONG EjectSupported:1;                                                 //0x4
    ULONG Removable:1;                                                      //0x4
    ULONG DockDevice:1;                                                     //0x4
    ULONG UniqueID:1;                                                       //0x4
    ULONG SilentInstall:1;                                                  //0x4
    ULONG RawDeviceOK:1;                                                    //0x4
    ULONG SurpriseRemovalOK:1;                                              //0x4
    ULONG WakeFromD0:1;                                                     //0x4
    ULONG WakeFromD1:1;                                                     //0x4
    ULONG WakeFromD2:1;                                                     //0x4
    ULONG WakeFromD3:1;                                                     //0x4
    ULONG HardwareDisabled:1;                                               //0x4
    ULONG NonDynamic:1;                                                     //0x4
    ULONG WarmEjectSupported:1;                                             //0x4
    ULONG NoDisplayInUI:1;                                                  //0x4
    ULONG Reserved1:1;                                                      //0x4
    ULONG WakeFromInterrupt:1;                                              //0x4
    ULONG SecureDevice:1;                                                   //0x4
    ULONG ChildOfVgaEnabledBridge:1;                                        //0x4
    ULONG DecodeIoOnBoot:1;                                                 //0x4
    ULONG Reserved:9;                                                       //0x4
    ULONG Address;                                                          //0x8
    ULONG UINumber;                                                         //0xc
    enum _DEVICE_POWER_STATE DeviceState[7];                                //0x10
    enum _SYSTEM_POWER_STATE SystemWake;                                    //0x2c
    enum _DEVICE_POWER_STATE DeviceWake;                                    //0x30
    ULONG D1Latency;                                                        //0x34
    ULONG D2Latency;                                                        //0x38
    ULONG D3Latency;                                                        //0x3c
}; 
//0x10 bytes (sizeof)
struct _DEVICE_DATA_SET_RANGE
{
    LONGLONG StartingOffset;                                                //0x0
    ULONGLONG LengthInBytes;                                                //0x8
};
//0x40 bytes (sizeof)
struct _DEVICE_DESCRIPTION
{
    ULONG Version;                                                          //0x0
    UCHAR Master;                                                           //0x4
    UCHAR ScatterGather;                                                    //0x5
    UCHAR DemandMode;                                                       //0x6
    UCHAR AutoInitialize;                                                   //0x7
    UCHAR Dma32BitAddresses;                                                //0x8
    UCHAR IgnoreCount;                                                      //0x9
    UCHAR Reserved1;                                                        //0xa
    UCHAR Dma64BitAddresses;                                                //0xb
    ULONG BusNumber;                                                        //0xc
    ULONG DmaChannel;                                                       //0x10
    enum _INTERFACE_TYPE InterfaceType;                                     //0x14
    enum _DMA_WIDTH DmaWidth;                                               //0x18
    enum _DMA_SPEED DmaSpeed;                                               //0x1c
    ULONG MaximumLength;                                                    //0x20
    ULONG DmaPort;                                                          //0x24
    ULONG DmaAddressWidth;                                                  //0x28
    ULONG DmaControllerInstance;                                            //0x2c
    ULONG DmaRequestLine;                                                   //0x30
    union _LARGE_INTEGER DeviceAddress;                                     //0x38
};
//0x1c bytes (sizeof)
struct _DEVICE_DSM_DEFINITION
{
    ULONG Action;                                                           //0x0
    UCHAR SingleRange;                                                      //0x4
    ULONG ParameterBlockAlignment;                                          //0x8
    ULONG ParameterBlockLength;                                             //0xc
    UCHAR HasOutput;                                                        //0x10
    ULONG OutputBlockAlignment;                                             //0x14
    ULONG OutputBlockLength;                                                //0x18
};
//0x10 bytes (sizeof)
struct _DEVICE_FAULT_CONFIGURATION
{
    VOID (*FaultHandler)(VOID* arg1, struct _FAULT_INFORMATION* arg2);      //0x0
    VOID* FaultContext;                                                     //0x8
}; 
//0x4 bytes (sizeof)
struct _DEVICE_FLAGS
{
    ULONG Failed:1;                                                         //0x0
    ULONG ReadOnly:1;                                                       //0x0
    ULONG Removable:1;                                                      //0x0
    ULONG ConsoleIn:1;                                                      //0x0
    ULONG ConsoleOut:1;                                                     //0x0
    ULONG Input:1;                                                          //0x0
    ULONG Output:1;                                                         //0x0
}; 
//0x1c bytes (sizeof)
struct _DEVICE_MANAGE_DATA_SET_ATTRIBUTES
{
    ULONG Size;                                                             //0x0
    ULONG Action;                                                           //0x4
    ULONG Flags;                                                            //0x8
    ULONG ParameterBlockOffset;                                             //0xc
    ULONG ParameterBlockLength;                                             //0x10
    ULONG DataSetRangesOffset;                                              //0x14
    ULONG DataSetRangesLength;                                              //0x18
};
//0x24 bytes (sizeof)
struct _DEVICE_MANAGE_DATA_SET_ATTRIBUTES_OUTPUT
{
    ULONG Size;                                                             //0x0
    ULONG Action;                                                           //0x4
    ULONG Flags;                                                            //0x8
    ULONG OperationStatus;                                                  //0xc
    ULONG ExtendedError;                                                    //0x10
    ULONG TargetDetailedError;                                              //0x14
    ULONG ReservedStatus;                                                   //0x18
    ULONG OutputBlockOffset;                                                //0x1c
    ULONG OutputBlockLength;                                                //0x20
};
//0x48 bytes (sizeof)
struct _DEVICE_MAP
{
    struct _OBJECT_DIRECTORY* DosDevicesDirectory;                          //0x0
    struct _OBJECT_DIRECTORY* GlobalDosDevicesDirectory;                    //0x8
    VOID* DosDevicesDirectoryHandle;                                        //0x10
    volatile LONG ReferenceCount;                                           //0x18
    ULONG DriveMap;                                                         //0x1c
    UCHAR DriveType[32];                                                    //0x20
    struct _EJOB* ServerSilo;                                               //0x40
}; 
//0x310 bytes (sizeof)
struct _DEVICE_NODE
{
    struct _DEVICE_NODE* Sibling;                                           //0x0
    struct _DEVICE_NODE* Child;                                             //0x8
    struct _DEVICE_NODE* Parent;                                            //0x10
    struct _DEVICE_NODE* LastChild;                                         //0x18
    struct _DEVICE_OBJECT* PhysicalDeviceObject;                            //0x20
    struct _UNICODE_STRING InstancePath;                                    //0x28
    struct _UNICODE_STRING ServiceName;                                     //0x38
    struct _IRP* PendingIrp;                                                //0x48
    struct _POP_FX_DEVICE* FxDevice;                                        //0x50
    volatile LONG FxDeviceLock;                                             //0x58
    struct _KEVENT FxRemoveEvent;                                           //0x60
    volatile LONG FxActivationCount;                                        //0x78
    volatile LONG FxSleepCount;                                             //0x7c
    struct _UNICODE_STRING UniqueId;                                        //0x80
    struct _POP_FX_PLUGIN* Plugin;                                          //0x90
    ULONG Level;                                                            //0x98
    union _POWER_STATE CurrentPowerState;                                   //0x9c
    struct _PO_DEVICE_NOTIFY Notify;                                        //0xa0
    struct _PO_IRP_MANAGER PoIrpManager;                                    //0x108
    volatile LONG PowerFlags;                                               //0x128
    enum _PNP_DEVNODE_STATE State;                                          //0x12c
    enum _PNP_DEVNODE_STATE PreviousState;                                  //0x130
    enum _PNP_DEVNODE_STATE StateHistory[20];                               //0x134
    ULONG StateHistoryEntry;                                                //0x184
    LONG CompletionStatus;                                                  //0x188
    ULONG Flags;                                                            //0x18c
    ULONG UserFlags;                                                        //0x190
    ULONG Problem;                                                          //0x194
    LONG ProblemStatus;                                                     //0x198
    struct _CM_RESOURCE_LIST* ResourceList;                                 //0x1a0
    struct _CM_RESOURCE_LIST* ResourceListTranslated;                       //0x1a8
    struct _DEVICE_OBJECT* DuplicatePDO;                                    //0x1b0
    struct _IO_RESOURCE_REQUIREMENTS_LIST* ResourceRequirements;            //0x1b8
    enum _INTERFACE_TYPE InterfaceType;                                     //0x1c0
    ULONG BusNumber;                                                        //0x1c4
    enum _INTERFACE_TYPE ChildInterfaceType;                                //0x1c8
    ULONG ChildBusNumber;                                                   //0x1cc
    USHORT ChildBusTypeIndex;                                               //0x1d0
    UCHAR RemovalPolicy;                                                    //0x1d2
    UCHAR HardwareRemovalPolicy;                                            //0x1d3
    struct _LIST_ENTRY TargetDeviceNotify;                                  //0x1d8
    struct _LIST_ENTRY DeviceArbiterList;                                   //0x1e8
    struct _LIST_ENTRY DeviceTranslatorList;                                //0x1f8
    USHORT NoTranslatorMask;                                                //0x208
    USHORT QueryTranslatorMask;                                             //0x20a
    USHORT NoArbiterMask;                                                   //0x20c
    USHORT QueryArbiterMask;                                                //0x20e
    union
    {
        struct _DEVICE_NODE* LegacyDeviceNode;                              //0x210
        struct _DEVICE_RELATIONS* PendingDeviceRelations;                   //0x210
        VOID* Information;                                                  //0x210
    } OverUsed1;                                                            //0x210
    union
    {
        struct _DEVICE_NODE* NextResourceDeviceNode;                        //0x218
    } OverUsed2;                                                            //0x218
    struct _CM_RESOURCE_LIST* BootResources;                                //0x220
    struct _CM_RESOURCE_LIST* BootResourcesTranslated;                      //0x228
    ULONG CapabilityFlags;                                                  //0x230
    struct
    {
        enum PROFILE_STATUS DockStatus;                                     //0x238
        struct _LIST_ENTRY ListEntry;                                       //0x240
        WCHAR* SerialNumber;                                                //0x250
    } DockInfo;                                                             //0x238
    ULONG DisableableDepends;                                               //0x258
    struct _LIST_ENTRY PendedSetInterfaceState;                             //0x260
    struct _LIST_ENTRY LegacyBusListEntry;                                  //0x270
    ULONG DriverUnloadRetryCount;                                           //0x280
    struct _DEVICE_NODE* PreviousParent;                                    //0x288
    LONG DeletedChildren;                                                   //0x290
    ULONG NumaNodeIndex;                                                    //0x294
    struct _GUID ContainerID;                                               //0x298
    UCHAR OverrideFlags;                                                    //0x2a8
    ULONG DeviceIdsHash;                                                    //0x2ac
    UCHAR RequiresUnloadedDriver;                                           //0x2b0
    struct _PENDING_RELATIONS_LIST_ENTRY* PendingEjectRelations;            //0x2b8
    ULONG StateFlags;                                                       //0x2c0
    struct _PNP_REBALANCE_TRACE_CONTEXT* RebalanceContext;                  //0x2c8
    struct _DEVICE_NODE_IOMMU_EXTENSION* IommuExtension;                    //0x2d0
    struct _PO_DIRECTED_DRIPS_STATE DirectedDripsState;                     //0x2d8
}; 
//0x0 bytes (sizeof)
struct _DEVICE_NODE_IOMMU_EXTENSION; 
//0x150 bytes (sizeof)
struct _DEVICE_OBJECT
{
    SHORT Type;                                                             //0x0
    USHORT Size;                                                            //0x2
    LONG ReferenceCount;                                                    //0x4
    struct _DRIVER_OBJECT* DriverObject;                                    //0x8
    struct _DEVICE_OBJECT* NextDevice;                                      //0x10
    struct _DEVICE_OBJECT* AttachedDevice;                                  //0x18
    struct _IRP* CurrentIrp;                                                //0x20
    struct _IO_TIMER* Timer;                                                //0x28
    ULONG Flags;                                                            //0x30
    ULONG Characteristics;                                                  //0x34
    struct _VPB* Vpb;                                                       //0x38
    VOID* DeviceExtension;                                                  //0x40
    ULONG DeviceType;                                                       //0x48
    CHAR StackSize;                                                         //0x4c
    union
    {
        struct _LIST_ENTRY ListEntry;                                       //0x50
        struct _WAIT_CONTEXT_BLOCK Wcb;                                     //0x50
    } Queue;                                                                //0x50
    ULONG AlignmentRequirement;                                             //0x98
    struct _KDEVICE_QUEUE DeviceQueue;                                      //0xa0
    struct _KDPC Dpc;                                                       //0xc8
    ULONG ActiveThreadCount;                                                //0x108
    VOID* SecurityDescriptor;                                               //0x110
    struct _KEVENT DeviceLock;                                              //0x118
    USHORT SectorSize;                                                      //0x130
    USHORT Spare1;                                                          //0x132
    struct _DEVOBJ_EXTENSION* DeviceObjectExtension;                        //0x138
    VOID* Reserved;                                                         //0x140
}; 
//0x28 bytes (sizeof)
struct _DEVICE_OBJECT_LIST
{
    ULONG Count;                                                            //0x0
    ULONG MaxCount;                                                         //0x4
    ULONG TagCount;                                                         //0x8
    enum _PNP_DEVICE_DELETE_TYPE OperationCode;                             //0xc
    struct _DEVICE_OBJECT_LIST_ENTRY Devices[1];                            //0x10
}; 
//0x18 bytes (sizeof)
struct _DEVICE_OBJECT_LIST_ENTRY
{
    struct _DEVICE_OBJECT* DeviceObject;                                    //0x0
    enum _DEVICE_RELATION_LEVEL RelationLevel;                              //0x8
    ULONG Ordinal;                                                          //0xc
    ULONG Flags;                                                            //0x10
}; 
//0x60 bytes (sizeof)
struct _DEVICE_OBJECT_POWER_EXTENSION
{
    volatile ULONG IdleCount;                                               //0x0
    volatile ULONG BusyCount;                                               //0x4
    volatile ULONG BusyReference;                                           //0x8
    ULONG TotalBusyCount;                                                   //0xc
    ULONG ConservationIdleTime;                                             //0x10
    ULONG PerformanceIdleTime;                                              //0x14
    struct _DEVICE_OBJECT* DeviceObject;                                    //0x18
    struct _LIST_ENTRY IdleList;                                            //0x20
    enum _POP_DEVICE_IDLE_TYPE IdleType;                                    //0x30
    enum _DEVICE_POWER_STATE IdleState;                                     //0x34
    enum _DEVICE_POWER_STATE CurrentState;                                  //0x38
    struct _POP_COOLING_EXTENSION* CoolingExtension;                        //0x40
    struct _LIST_ENTRY Volume;                                              //0x48
    union
    {
        struct
        {
            ULONG IdleTime;                                                 //0x58
            ULONG NonIdleTime;                                              //0x5c
        } Disk;                                                             //0x58
    } Specific;                                                             //0x58
}; 
//0x10 bytes (sizeof)
struct _DEVICE_RELATIONS
{
    ULONG Count;                                                            //0x0
    struct _DEVICE_OBJECT* Objects[1];                                      //0x8
}; 
//0x70 bytes (sizeof)
struct _DEVOBJ_EXTENSION
{
    SHORT Type;                                                             //0x0
    USHORT Size;                                                            //0x2
    struct _DEVICE_OBJECT* DeviceObject;                                    //0x8
    ULONG PowerFlags;                                                       //0x10
    struct _DEVICE_OBJECT_POWER_EXTENSION* Dope;                            //0x18
    ULONG ExtensionFlags;                                                   //0x20
    VOID* DeviceNode;                                                       //0x28
    struct _DEVICE_OBJECT* AttachedTo;                                      //0x30
    LONG StartIoCount;                                                      //0x38
    LONG StartIoKey;                                                        //0x3c
    ULONG StartIoFlags;                                                     //0x40
    struct _VPB* Vpb;                                                       //0x48
    VOID* DependencyNode;                                                   //0x50
    VOID* InterruptContext;                                                 //0x58
    LONG InterruptCount;                                                    //0x60
    VOID* VerifierContext;                                                  //0x68
}; 
//0x14 bytes (sizeof)
struct _DEVPROPKEY
{
    struct _GUID fmtid;                                                     //0x0
    ULONG pid;                                                              //0x10
};
//0x28 bytes (sizeof)
struct _DIAGNOSTIC_BUFFER
{
    ULONGLONG Size;                                                         //0x0
    enum _REQUESTER_TYPE CallerType;                                        //0x8
    union
    {
        struct
        {
            ULONGLONG ProcessImageNameOffset;                               //0x10
            ULONG ProcessId;                                                //0x18
            ULONG ServiceTag;                                               //0x1c
        };
        struct
        {
            ULONGLONG DeviceDescriptionOffset;                              //0x10
            ULONGLONG DevicePathOffset;                                     //0x18
        };
    };
    ULONGLONG ReasonOffset;                                                 //0x20
}; 
//0x20 bytes (sizeof)
struct _DIAGNOSTIC_CONTEXT
{
    enum _REQUESTER_TYPE CallerType;                                        //0x0
    union
    {
        struct
        {
            struct _EPROCESS* Process;                                      //0x8
            ULONG ServiceTag;                                               //0x10
        };
        struct _DEVICE_OBJECT* DeviceObject;                                //0x8
    };
    ULONGLONG ReasonSize;                                                   //0x18
}; 
//0x18 bytes (sizeof)
struct _DIRTY_PAGE_STATISTICS
{
    ULONGLONG DirtyPages;                                                   //0x0
    ULONGLONG DirtyPagesLastScan;                                           //0x8
    ULONG DirtyPagesScheduledLastScan;                                      //0x10
}; 
//0x38 bytes (sizeof)
struct _DIRTY_PAGE_THRESHOLDS
{
    ULONGLONG DirtyPageThreshold;                                           //0x0
    ULONGLONG DirtyPageThresholdTop;                                        //0x8
    ULONGLONG DirtyPageThresholdBottom;                                     //0x10
    ULONG DirtyPageTarget;                                                  //0x18
    ULONGLONG AggregateAvailablePages;                                      //0x20
    ULONGLONG AggregateDirtyPages;                                          //0x28
    ULONG AvailableHistory;                                                 //0x30
}; 
//0x10 bytes (sizeof)
struct _DISALLOWED_GUIDS
{
    USHORT Count;                                                           //0x0
    struct _GUID* Guids;                                                    //0x8
}; 
//0x18 bytes (sizeof)
struct _DISPATCHER_HEADER
{
    union
    {
        volatile LONG Lock;                                                 //0x0
        LONG LockNV;                                                        //0x0
        struct
        {
            UCHAR Type;                                                     //0x0
            UCHAR Signalling;                                               //0x1
            UCHAR Size;                                                     //0x2
            UCHAR Reserved1;                                                //0x3
        };
        struct
        {
            UCHAR TimerType;                                                //0x0
            union
            {
                UCHAR TimerControlFlags;                                    //0x1
                struct
                {
                    UCHAR Absolute:1;                                       //0x1
                    UCHAR Wake:1;                                           //0x1
                    UCHAR EncodedTolerableDelay:6;                          //0x1
                };
            };
            UCHAR Hand;                                                     //0x2
            union
            {
                UCHAR TimerMiscFlags;                                       //0x3
                struct
                {
                    UCHAR Index:6;                                          //0x3
                    UCHAR Inserted:1;                                       //0x3
                    volatile UCHAR Expired:1;                               //0x3
                };
            };
        };
        struct
        {
            UCHAR Timer2Type;                                               //0x0
            union
            {
                UCHAR Timer2Flags;                                          //0x1
                struct
                {
                    UCHAR Timer2Inserted:1;                                 //0x1
                    UCHAR Timer2Expiring:1;                                 //0x1
                    UCHAR Timer2CancelPending:1;                            //0x1
                    UCHAR Timer2SetPending:1;                               //0x1
                    UCHAR Timer2Running:1;                                  //0x1
                    UCHAR Timer2Disabled:1;                                 //0x1
                    UCHAR Timer2ReservedFlags:2;                            //0x1
                };
            };
            UCHAR Timer2ComponentId;                                        //0x2
            UCHAR Timer2RelativeId;                                         //0x3
        };
        struct
        {
            UCHAR QueueType;                                                //0x0
            union
            {
                UCHAR QueueControlFlags;                                    //0x1
                struct
                {
                    UCHAR Abandoned:1;                                      //0x1
                    UCHAR DisableIncrement:1;                               //0x1
                    UCHAR QueueReservedControlFlags:6;                      //0x1
                };
            };
            UCHAR QueueSize;                                                //0x2
            UCHAR QueueReserved;                                            //0x3
        };
        struct
        {
            UCHAR ThreadType;                                               //0x0
            UCHAR ThreadReserved;                                           //0x1
            union
            {
                UCHAR ThreadControlFlags;                                   //0x2
                struct
                {
                    UCHAR CycleProfiling:1;                                 //0x2
                    UCHAR CounterProfiling:1;                               //0x2
                    UCHAR GroupScheduling:1;                                //0x2
                    UCHAR AffinitySet:1;                                    //0x2
                    UCHAR Tagged:1;                                         //0x2
                    UCHAR EnergyProfiling:1;                                //0x2
                    UCHAR SchedulerAssist:1;                                //0x2
                    UCHAR ThreadReservedControlFlags:1;                     //0x2
                };
            };
            union
            {
                UCHAR DebugActive;                                          //0x3
                struct
                {
                    UCHAR ActiveDR7:1;                                      //0x3
                    UCHAR Instrumented:1;                                   //0x3
                    UCHAR Minimal:1;                                        //0x3
                    UCHAR Reserved4:2;                                      //0x3
                    UCHAR AltSyscall:1;                                     //0x3
                    UCHAR UmsScheduled:1;                                   //0x3
                    UCHAR UmsPrimary:1;                                     //0x3
                };
            };
        };
        struct
        {
            UCHAR MutantType;                                               //0x0
            UCHAR MutantSize;                                               //0x1
            UCHAR DpcActive;                                                //0x2
            UCHAR MutantReserved;                                           //0x3
        };
    };
    LONG SignalState;                                                       //0x4
    struct _LIST_ENTRY WaitListHead;                                        //0x8
}; 
//0x10 bytes (sizeof)
struct _DMA_ADAPTER
{
    USHORT Version;                                                         //0x0
    USHORT Size;                                                            //0x2
    struct _DMA_OPERATIONS* DmaOperations;                                  //0x8
}; 
//0x18 bytes (sizeof)
struct _DMA_ADAPTER_INFO
{
    ULONG Version;                                                          //0x0
    struct _DMA_ADAPTER_INFO_V1 V1;                                         //0x4
}; 
//0x14 bytes (sizeof)
struct _DMA_ADAPTER_INFO_V1
{
    ULONG ReadDmaCounterAvailable;                                          //0x0
    ULONG ScatterGatherLimit;                                               //0x4
    ULONG DmaAddressWidth;                                                  //0x8
    ULONG Flags;                                                            //0xc
    ULONG MinimumTransferUnit;                                              //0x10
}; 
//0x10 bytes (sizeof)
struct _DMA_COMMON_BUFFER_ENTRY
{
    VOID* VirtualAddress;                                                   //0x0
    union _LARGE_INTEGER LogicalAddress;                                    //0x8
}; 
//0x48 bytes (sizeof)
struct _DMA_COMMON_BUFFER_VECTOR
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    ULONGLONG SizeOfEntries;                                                //0x10
    ULONG NumberOfEntries;                                                  //0x18
    struct _HALP_DMA_DOMAIN_OBJECT* Domain;                                 //0x20
    struct _MDL* Mdl;                                                       //0x28
    VOID* BaseAddress;                                                      //0x30
    ULONGLONG BaseLogicalAddress;                                           //0x38
    struct _DMA_COMMON_BUFFER_ENTRY* Entries;                               //0x40
}; 
//0x50 bytes (sizeof)
struct _DMA_FUNCTION_TABLE
{
    VOID (*InitializeController)(VOID* arg1);                               //0x0
    UCHAR (*ValidateRequestLineBinding)(VOID* arg1, struct _DMA_REQUEST_LINE_BINDING_DESCRIPTION* arg2); //0x8
    ULONG (*QueryMaxFragments)(VOID* arg1, ULONG arg2, ULONG arg3);         //0x10
    VOID (*ProgramChannel)(VOID* arg1, ULONG arg2, ULONG arg3, struct _DMA_SCATTER_GATHER_LIST* arg4, union _LARGE_INTEGER arg5, UCHAR arg6, UCHAR arg7); //0x18
    LONG (*ConfigureChannel)(VOID* arg1, ULONG arg2, ULONG arg3, VOID* arg4); //0x20
    VOID (*FlushChannel)(VOID* arg1, ULONG arg2);                           //0x28
    UCHAR (*HandleInterrupt)(VOID* arg1, ULONG* arg2, enum _DMA_INTERRUPT_TYPE* arg3); //0x30
    ULONG (*ReadDmaCounter)(VOID* arg1, ULONG arg2);                        //0x38
    VOID (*ReportCommonBuffer)(VOID* arg1, ULONG arg2, VOID* arg3, union _LARGE_INTEGER arg4); //0x40
    UCHAR (*CancelTransfer)(VOID* arg1, ULONG arg2);                        //0x48
}; 
//0x70 bytes (sizeof)
struct _DMA_IOMMU_INTERFACE
{
    ULONG Version;                                                          //0x0
    LONG (*CreateDomain)(UCHAR arg1, struct _IOMMU_DMA_DOMAIN** arg2);      //0x8
    LONG (*DeleteDomain)(struct _IOMMU_DMA_DOMAIN* arg1);                   //0x10
    LONG (*AttachDevice)(struct _IOMMU_DMA_DOMAIN* arg1, struct _DEVICE_OBJECT* arg2, ULONG arg3, ULONG arg4); //0x18
    LONG (*DetachDevice)(struct _IOMMU_DMA_DOMAIN* arg1, struct _DEVICE_OBJECT* arg2, ULONG arg3); //0x20
    LONG (*FlushDomain)(struct _IOMMU_DMA_DOMAIN* arg1);                    //0x28
    LONG (*FlushDomainByVaList)(struct _IOMMU_DMA_DOMAIN* arg1, UCHAR arg2, ULONG arg3, VOID* arg4); //0x30
    LONG (*QueryInputMappings)(struct _DEVICE_OBJECT* arg1, struct _INPUT_MAPPING_ELEMENT* arg2, ULONG arg3, ULONG* arg4); //0x38
    LONG (*MapLogicalRange)(struct _IOMMU_DMA_DOMAIN* arg1, ULONG arg2, struct _MDL* arg3, ULONGLONG arg4); //0x40
    LONG (*UnmapLogicalRange)(struct _IOMMU_DMA_DOMAIN* arg1, ULONGLONG arg2, ULONGLONG arg3); //0x48
    LONG (*MapIdentityRange)(struct _IOMMU_DMA_DOMAIN* arg1, ULONG arg2, struct _MDL* arg3); //0x50
    LONG (*UnmapIdentityRange)(struct _IOMMU_DMA_DOMAIN* arg1, struct _MDL* arg2); //0x58
    LONG (*SetDeviceFaultReporting)(struct _DEVICE_OBJECT* arg1, ULONG arg2, UCHAR arg3, struct _DEVICE_FAULT_CONFIGURATION* arg4); //0x60
    LONG (*ConfigureDomain)(struct _IOMMU_DMA_DOMAIN* arg1, struct _DOMAIN_CONFIGURATION* arg2); //0x68
}; 
//0x138 bytes (sizeof)
struct _DMA_OPERATIONS
{
    ULONG Size;                                                             //0x0
    VOID (*PutDmaAdapter)(struct _DMA_ADAPTER* arg1);                       //0x8
    VOID* (*AllocateCommonBuffer)(struct _DMA_ADAPTER* arg1, ULONG arg2, union _LARGE_INTEGER* arg3, UCHAR arg4); //0x10
    VOID (*FreeCommonBuffer)(struct _DMA_ADAPTER* arg1, ULONG arg2, union _LARGE_INTEGER arg3, VOID* arg4, UCHAR arg5); //0x18
    LONG (*AllocateAdapterChannel)(struct _DMA_ADAPTER* arg1, struct _DEVICE_OBJECT* arg2, ULONG arg3, enum _IO_ALLOCATION_ACTION (*arg4)(struct _DEVICE_OBJECT* arg1, struct _IRP* arg2, VOID* arg3, VOID* arg4), VOID* arg5); //0x20
    UCHAR (*FlushAdapterBuffers)(struct _DMA_ADAPTER* arg1, struct _MDL* arg2, VOID* arg3, VOID* arg4, ULONG arg5, UCHAR arg6); //0x28
    VOID (*FreeAdapterChannel)(struct _DMA_ADAPTER* arg1);                  //0x30
    VOID (*FreeMapRegisters)(struct _DMA_ADAPTER* arg1, VOID* arg2, ULONG arg3); //0x38
    union _LARGE_INTEGER (*MapTransfer)(struct _DMA_ADAPTER* arg1, struct _MDL* arg2, VOID* arg3, VOID* arg4, ULONG* arg5, UCHAR arg6); //0x40
    ULONG (*GetDmaAlignment)(struct _DMA_ADAPTER* arg1);                    //0x48
    ULONG (*ReadDmaCounter)(struct _DMA_ADAPTER* arg1);                     //0x50
    LONG (*GetScatterGatherList)(struct _DMA_ADAPTER* arg1, struct _DEVICE_OBJECT* arg2, struct _MDL* arg3, VOID* arg4, ULONG arg5, VOID (*arg6)(struct _DEVICE_OBJECT* arg1, struct _IRP* arg2, struct _SCATTER_GATHER_LIST* arg3, VOID* arg4), VOID* arg7, UCHAR arg8); //0x58
    VOID (*PutScatterGatherList)(struct _DMA_ADAPTER* arg1, struct _SCATTER_GATHER_LIST* arg2, UCHAR arg3); //0x60
    LONG (*CalculateScatterGatherList)(struct _DMA_ADAPTER* arg1, struct _MDL* arg2, VOID* arg3, ULONG arg4, ULONG* arg5, ULONG* arg6); //0x68
    LONG (*BuildScatterGatherList)(struct _DMA_ADAPTER* arg1, struct _DEVICE_OBJECT* arg2, struct _MDL* arg3, VOID* arg4, ULONG arg5, VOID (*arg6)(struct _DEVICE_OBJECT* arg1, struct _IRP* arg2, struct _SCATTER_GATHER_LIST* arg3, VOID* arg4), VOID* arg7, UCHAR arg8, VOID* arg9, ULONG arg10); //0x70
    LONG (*BuildMdlFromScatterGatherList)(struct _DMA_ADAPTER* arg1, struct _SCATTER_GATHER_LIST* arg2, struct _MDL* arg3, struct _MDL** arg4); //0x78
    LONG (*GetDmaAdapterInfo)(struct _DMA_ADAPTER* arg1, struct _DMA_ADAPTER_INFO* arg2); //0x80
    LONG (*GetDmaTransferInfo)(struct _DMA_ADAPTER* arg1, struct _MDL* arg2, ULONGLONG arg3, ULONG arg4, UCHAR arg5, struct _DMA_TRANSFER_INFO* arg6); //0x88
    LONG (*InitializeDmaTransferContext)(struct _DMA_ADAPTER* arg1, VOID* arg2); //0x90
    VOID* (*AllocateCommonBufferEx)(struct _DMA_ADAPTER* arg1, union _LARGE_INTEGER* arg2, ULONG arg3, union _LARGE_INTEGER* arg4, UCHAR arg5, ULONG arg6); //0x98
    LONG (*AllocateAdapterChannelEx)(struct _DMA_ADAPTER* arg1, struct _DEVICE_OBJECT* arg2, VOID* arg3, ULONG arg4, ULONG arg5, enum _IO_ALLOCATION_ACTION (*arg6)(struct _DEVICE_OBJECT* arg1, struct _IRP* arg2, VOID* arg3, VOID* arg4), VOID* arg7, VOID** arg8); //0xa0
    LONG (*ConfigureAdapterChannel)(struct _DMA_ADAPTER* arg1, ULONG arg2, VOID* arg3); //0xa8
    UCHAR (*CancelAdapterChannel)(struct _DMA_ADAPTER* arg1, struct _DEVICE_OBJECT* arg2, VOID* arg3); //0xb0
    LONG (*MapTransferEx)(struct _DMA_ADAPTER* arg1, struct _MDL* arg2, VOID* arg3, ULONGLONG arg4, ULONG arg5, ULONG* arg6, UCHAR arg7, struct _SCATTER_GATHER_LIST* arg8, ULONG arg9, VOID (*arg10)(struct _DMA_ADAPTER* arg1, struct _DEVICE_OBJECT* arg2, VOID* arg3, enum DMA_COMPLETION_STATUS arg4), VOID* arg11); //0xb8
    LONG (*GetScatterGatherListEx)(struct _DMA_ADAPTER* arg1, struct _DEVICE_OBJECT* arg2, VOID* arg3, struct _MDL* arg4, ULONGLONG arg5, ULONG arg6, ULONG arg7, VOID (*arg8)(struct _DEVICE_OBJECT* arg1, struct _IRP* arg2, struct _SCATTER_GATHER_LIST* arg3, VOID* arg4), VOID* arg9, UCHAR arg10, VOID (*arg11)(struct _DMA_ADAPTER* arg1, struct _DEVICE_OBJECT* arg2, VOID* arg3, enum DMA_COMPLETION_STATUS arg4), VOID* arg12, struct _SCATTER_GATHER_LIST** arg13); //0xc0
    LONG (*BuildScatterGatherListEx)(struct _DMA_ADAPTER* arg1, struct _DEVICE_OBJECT* arg2, VOID* arg3, struct _MDL* arg4, ULONGLONG arg5, ULONG arg6, ULONG arg7, VOID (*arg8)(struct _DEVICE_OBJECT* arg1, struct _IRP* arg2, struct _SCATTER_GATHER_LIST* arg3, VOID* arg4), VOID* arg9, UCHAR arg10, VOID* arg11, ULONG arg12, VOID (*arg13)(struct _DMA_ADAPTER* arg1, struct _DEVICE_OBJECT* arg2, VOID* arg3, enum DMA_COMPLETION_STATUS arg4), VOID* arg14, VOID* arg15); //0xc8
    LONG (*FlushAdapterBuffersEx)(struct _DMA_ADAPTER* arg1, struct _MDL* arg2, VOID* arg3, ULONGLONG arg4, ULONG arg5, UCHAR arg6); //0xd0
    VOID (*FreeAdapterObject)(struct _DMA_ADAPTER* arg1, enum _IO_ALLOCATION_ACTION arg2); //0xd8
    LONG (*CancelMappedTransfer)(struct _DMA_ADAPTER* arg1, VOID* arg2);    //0xe0
    LONG (*AllocateDomainCommonBuffer)(struct _DMA_ADAPTER* arg1, VOID* arg2, union _LARGE_INTEGER* arg3, ULONG arg4, ULONG arg5, enum _MEMORY_CACHING_TYPE* arg6, ULONG arg7, union _LARGE_INTEGER* arg8, VOID** arg9); //0xe8
    LONG (*FlushDmaBuffer)(struct _DMA_ADAPTER* arg1, struct _MDL* arg2, UCHAR arg3); //0xf0
    LONG (*JoinDmaDomain)(struct _DMA_ADAPTER* arg1, VOID* arg2);           //0xf8
    LONG (*LeaveDmaDomain)(struct _DMA_ADAPTER* arg1);                      //0x100
    VOID* (*GetDmaDomain)(struct _DMA_ADAPTER* arg1);                       //0x108
    VOID* (*AllocateCommonBufferWithBounds)(struct _DMA_ADAPTER* arg1, union _LARGE_INTEGER* arg2, union _LARGE_INTEGER* arg3, ULONG arg4, ULONG arg5, enum _MEMORY_CACHING_TYPE* arg6, ULONG arg7, union _LARGE_INTEGER* arg8); //0x110
    LONG (*AllocateCommonBufferVector)(struct _DMA_ADAPTER* arg1, union _LARGE_INTEGER arg2, union _LARGE_INTEGER arg3, enum _MEMORY_CACHING_TYPE arg4, ULONG arg5, ULONG arg6, ULONG arg7, ULONGLONG arg8, struct _DMA_COMMON_BUFFER_VECTOR** arg9); //0x118
    VOID (*GetCommonBufferFromVectorByIndex)(struct _DMA_ADAPTER* arg1, struct _DMA_COMMON_BUFFER_VECTOR* arg2, ULONG arg3, VOID** arg4, union _LARGE_INTEGER* arg5); //0x120
    VOID (*FreeCommonBufferFromVector)(struct _DMA_ADAPTER* arg1, struct _DMA_COMMON_BUFFER_VECTOR* arg2, ULONG arg3); //0x128
    VOID (*FreeCommonBufferVector)(struct _DMA_ADAPTER* arg1, struct _DMA_COMMON_BUFFER_VECTOR* arg2); //0x130
}; 
//0x8 bytes (sizeof)
struct _DMA_REQUEST_LINE_BINDING_DESCRIPTION
{
    ULONG RequestLine;                                                      //0x0
    ULONG ChannelNumber;                                                    //0x4
}; 
//0x10 bytes (sizeof)
struct _DMA_SCATTER_GATHER_LIST
{
    ULONG NumberOfElements;                                                 //0x0
    ULONGLONG Reserved;                                                     //0x8
    struct _SCATTER_GATHER_ELEMENT Elements[0];                             //0x10
}; 
//0x60 bytes (sizeof)
struct _DMA_TRANSFER_CONTEXT
{
    ULONG Version;                                                          //0x0
    struct _DMA_TRANSFER_CONTEXT_V1 V1;                                     //0x8
}; 
//0x58 bytes (sizeof)
struct _DMA_TRANSFER_CONTEXT_V1
{
    LONG DmaState;                                                          //0x0
    ULONG TransferState;                                                    //0x4
    struct _WAIT_CONTEXT_BLOCK Wcb;                                         //0x8
    VOID* HalWcb;                                                           //0x50
}; 
//0x14 bytes (sizeof)
struct _DMA_TRANSFER_INFO
{
    ULONG Version;                                                          //0x0
    union
    {
        struct _DMA_TRANSFER_INFO_V1 V1;                                    //0x4
        struct _DMA_TRANSFER_INFO_V2 V2;                                    //0x4
    };
}; 
//0xc bytes (sizeof)
struct _DMA_TRANSFER_INFO_V1
{
    ULONG MapRegisterCount;                                                 //0x0
    ULONG ScatterGatherElementCount;                                        //0x4
    ULONG ScatterGatherListSize;                                            //0x8
}; 
//0x10 bytes (sizeof)
struct _DMA_TRANSFER_INFO_V2
{
    ULONG MapRegisterCount;                                                 //0x0
    ULONG ScatterGatherElementCount;                                        //0x4
    ULONG ScatterGatherListSize;                                            //0x8
    ULONG LogicalPageCount;                                                 //0xc
}; 
//0x28 bytes (sizeof)
struct _DOMAIN_CONFIGURATION
{
    enum _DOMAIN_CONFIGURATION_ARCH Type;                                   //0x0
    struct _DOMAIN_CONFIGURATION_ARM64 Arm64;                               //0x8
}; 
//0x20 bytes (sizeof)
struct _DOMAIN_CONFIGURATION_ARM64
{
    union _LARGE_INTEGER Ttbr0;                                             //0x0
    union _LARGE_INTEGER Ttbr1;                                             //0x8
    ULONG Mair0;                                                            //0x10
    ULONG Mair1;                                                            //0x14
    UCHAR InputSize0;                                                       //0x18
    UCHAR InputSize1;                                                       //0x19
    UCHAR CoherentTableWalks;                                               //0x1a
    UCHAR TranslationEnabled;                                               //0x1b
}; 
//0x28 bytes (sizeof)
struct _DRIVER_EXTENSION
{
    struct _DRIVER_OBJECT* DriverObject;                                    //0x0
    LONG (*AddDevice)(struct _DRIVER_OBJECT* arg1, struct _DEVICE_OBJECT* arg2); //0x8
    ULONG Count;                                                            //0x10
    struct _UNICODE_STRING ServiceKeyName;                                  //0x18
}; 
//0x28 bytes (sizeof)
struct _DRIVER_EXTENSION
{
    struct _DRIVER_OBJECT* DriverObject;                                    //0x0
    LONG (*AddDevice)(struct _DRIVER_OBJECT* arg1, struct _DEVICE_OBJECT* arg2); //0x8
    ULONG Count;                                                            //0x10
    struct _UNICODE_STRING ServiceKeyName;                                  //0x18
}; 
//0x150 bytes (sizeof)
struct _DRIVER_OBJECT
{
    SHORT Type;                                                             //0x0
    SHORT Size;                                                             //0x2
    struct _DEVICE_OBJECT* DeviceObject;                                    //0x8
    ULONG Flags;                                                            //0x10
    VOID* DriverStart;                                                      //0x18
    ULONG DriverSize;                                                       //0x20
    VOID* DriverSection;                                                    //0x28
    struct _DRIVER_EXTENSION* DriverExtension;                              //0x30
    struct _UNICODE_STRING DriverName;                                      //0x38
    struct _UNICODE_STRING* HardwareDatabase;                               //0x48
    struct _FAST_IO_DISPATCH* FastIoDispatch;                               //0x50
    LONG (*DriverInit)(struct _DRIVER_OBJECT* arg1, struct _UNICODE_STRING* arg2); //0x58
    VOID (*DriverStartIo)(struct _DEVICE_OBJECT* arg1, struct _IRP* arg2);  //0x60
    VOID (*DriverUnload)(struct _DRIVER_OBJECT* arg1);                      //0x68
    LONG (*MajorFunction[28])(struct _DEVICE_OBJECT* arg1, struct _IRP* arg2); //0x70
}; 
//0x278 bytes (sizeof)
struct _DUAL
{
    ULONG Length;                                                           //0x0
    struct _HMAP_DIRECTORY* Map;                                            //0x8
    struct _HMAP_TABLE* SmallDir;                                           //0x10
    ULONG Guard;                                                            //0x18
    struct _FREE_DISPLAY FreeDisplay[24];                                   //0x20
    struct _LIST_ENTRY FreeBins;                                            //0x260
    ULONG FreeSummary;                                                      //0x270
}; 
//0x110 bytes (sizeof)
struct _DUMMY_FILE_OBJECT
{
    struct _OBJECT_HEADER ObjectHeader;                                     //0x0
    CHAR FileObjectBody[216];                                               //0x38
}; 
//0x108 bytes (sizeof)
struct _DUMP_INITIALIZATION_CONTEXT
{
    ULONG Length;                                                           //0x0
    ULONG Reserved;                                                         //0x4
    VOID* MemoryBlock;                                                      //0x8
    VOID* CommonBuffer[2];                                                  //0x10
    union _LARGE_INTEGER PhysicalAddress[2];                                //0x20
    VOID (*StallRoutine)(ULONG arg1);                                       //0x30
    UCHAR (*OpenRoutine)(union _LARGE_INTEGER arg1);                        //0x38
    LONG (*WriteRoutine)(union _LARGE_INTEGER* arg1, struct _MDL* arg2);    //0x40
    VOID (*FinishRoutine)();                                                //0x48
    struct _ADAPTER_OBJECT* AdapterObject;                                  //0x50
    VOID* MappedRegisterBase;                                               //0x58
    VOID* PortConfiguration;                                                //0x60
    UCHAR CrashDump;                                                        //0x68
    UCHAR MarkMemoryOnly;                                                   //0x69
    UCHAR HiberResume;                                                      //0x6a
    UCHAR Reserved1;                                                        //0x6b
    ULONG MaximumTransferSize;                                              //0x6c
    ULONG CommonBufferSize;                                                 //0x70
    VOID* TargetAddress;                                                    //0x78
    LONG (*WritePendingRoutine)(LONG arg1, union _LARGE_INTEGER* arg2, struct _MDL* arg3, VOID* arg4); //0x80
    ULONG PartitionStyle;                                                   //0x88
    union
    {
        struct
        {
            ULONG Signature;                                                //0x8c
            ULONG CheckSum;                                                 //0x90
        } Mbr;                                                              //0x8c
        struct
        {
            struct _GUID DiskId;                                            //0x8c
        } Gpt;                                                              //0x8c
    } DiskInfo;                                                             //0x8c
    LONG (*ReadRoutine)(LONG arg1, union _LARGE_INTEGER* arg2, struct _MDL* arg3); //0xa0
    LONG (*GetDriveTelemetryRoutine)(ULONG arg1, ULONG arg2, VOID* arg3, ULONG arg4); //0xa8
    ULONG LogSectionTruncateSize;                                           //0xb0
    ULONG Parameters[16];                                                   //0xb4
    VOID (*GetTransferSizesRoutine)(ULONG* arg1, ULONG* arg2);              //0xf8
    VOID (*DumpNotifyRoutine)(enum _DUMP_EVENTS arg1, VOID* arg2, ULONG arg3); //0x100
}; 
//0x178 bytes (sizeof)
struct _DUMP_STACK_CONTEXT
{
    struct _DUMP_INITIALIZATION_CONTEXT Init;                               //0x0
    union _LARGE_INTEGER PartitionOffset;                                   //0x108
    union
    {
        VOID* DumpPointers;                                                 //0x110
        VOID* StorageInfo;                                                  //0x110
    };
    UCHAR UseStorageInfo;                                                   //0x118
    ULONG PointersLength;                                                   //0x11c
    WCHAR* ModulePrefix;                                                    //0x120
    struct _LIST_ENTRY DriverList;                                          //0x128
    struct _STRING InitMsg;                                                 //0x138
    struct _STRING ProgMsg;                                                 //0x148
    struct _STRING DoneMsg;                                                 //0x158
    VOID* FileObject;                                                       //0x168
    enum _DEVICE_USAGE_NOTIFICATION_TYPE UsageType;                         //0x170
}; 
//0x88 bytes (sizeof)
struct _DYNAMIC_FUNCTION_TABLE
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    struct _IMAGE_RUNTIME_FUNCTION_ENTRY* FunctionTable;                    //0x10
    union _LARGE_INTEGER TimeStamp;                                         //0x18
    ULONGLONG MinimumAddress;                                               //0x20
    ULONGLONG MaximumAddress;                                               //0x28
    ULONGLONG BaseAddress;                                                  //0x30
    struct _IMAGE_RUNTIME_FUNCTION_ENTRY* (*Callback)(ULONGLONG arg1, VOID* arg2); //0x38
    VOID* Context;                                                          //0x40
    WCHAR* OutOfProcessCallbackDll;                                         //0x48
    enum _FUNCTION_TABLE_TYPE Type;                                         //0x50
    ULONG EntryCount;                                                       //0x54
    struct _RTL_BALANCED_NODE TreeNodeMin;                                  //0x58
    struct _RTL_BALANCED_NODE TreeNodeMax;                                  //0x70
}; 
//0x18 bytes (sizeof)
struct _ECP_LIST
{
    ULONG Signature;                                                        //0x0
    ULONG Flags;                                                            //0x4
    struct _LIST_ENTRY EcpList;                                             //0x8
}; 
//0x38 bytes (sizeof)
struct _EFI_FIRMWARE_INFORMATION
{
    ULONG FirmwareVersion;                                                  //0x0
    struct _VIRTUAL_EFI_RUNTIME_SERVICES* VirtualEfiRuntimeServices;        //0x8
    LONG SetVirtualAddressMapStatus;                                        //0x10
    ULONG MissedMappingsCount;                                              //0x14
    struct _LIST_ENTRY FirmwareResourceList;                                //0x18
    VOID* EfiMemoryMap;                                                     //0x28
    ULONG EfiMemoryMapSize;                                                 //0x30
    ULONG EfiMemoryMapDescriptorSize;                                       //0x34
}; 
//0x640 bytes (sizeof)
struct _EJOB
{
    struct _KEVENT Event;                                                   //0x0
    struct _LIST_ENTRY JobLinks;                                            //0x18
    struct _LIST_ENTRY ProcessListHead;                                     //0x28
    struct _ERESOURCE JobLock;                                              //0x38
    union _LARGE_INTEGER TotalUserTime;                                     //0xa0
    union _LARGE_INTEGER TotalKernelTime;                                   //0xa8
    union _LARGE_INTEGER TotalCycleTime;                                    //0xb0
    union _LARGE_INTEGER ThisPeriodTotalUserTime;                           //0xb8
    union _LARGE_INTEGER ThisPeriodTotalKernelTime;                         //0xc0
    ULONGLONG TotalContextSwitches;                                         //0xc8
    ULONG TotalPageFaultCount;                                              //0xd0
    ULONG TotalProcesses;                                                   //0xd4
    ULONG ActiveProcesses;                                                  //0xd8
    ULONG TotalTerminatedProcesses;                                         //0xdc
    union _LARGE_INTEGER PerProcessUserTimeLimit;                           //0xe0
    union _LARGE_INTEGER PerJobUserTimeLimit;                               //0xe8
    ULONGLONG MinimumWorkingSetSize;                                        //0xf0
    ULONGLONG MaximumWorkingSetSize;                                        //0xf8
    ULONG LimitFlags;                                                       //0x100
    ULONG ActiveProcessLimit;                                               //0x104
    struct _KAFFINITY_EX Affinity;                                          //0x108
    struct _JOB_ACCESS_STATE* AccessState;                                  //0x1b0
    VOID* AccessStateQuotaReference;                                        //0x1b8
    ULONG UIRestrictionsClass;                                              //0x1c0
    ULONG EndOfJobTimeAction;                                               //0x1c4
    VOID* CompletionPort;                                                   //0x1c8
    VOID* CompletionKey;                                                    //0x1d0
    ULONGLONG CompletionCount;                                              //0x1d8
    ULONG SessionId;                                                        //0x1e0
    ULONG SchedulingClass;                                                  //0x1e4
    ULONGLONG ReadOperationCount;                                           //0x1e8
    ULONGLONG WriteOperationCount;                                          //0x1f0
    ULONGLONG OtherOperationCount;                                          //0x1f8
    ULONGLONG ReadTransferCount;                                            //0x200
    ULONGLONG WriteTransferCount;                                           //0x208
    ULONGLONG OtherTransferCount;                                           //0x210
    struct _PROCESS_DISK_COUNTERS DiskIoInfo;                               //0x218
    ULONGLONG ProcessMemoryLimit;                                           //0x240
    ULONGLONG JobMemoryLimit;                                               //0x248
    ULONGLONG JobTotalMemoryLimit;                                          //0x250
    ULONGLONG PeakProcessMemoryUsed;                                        //0x258
    ULONGLONG PeakJobMemoryUsed;                                            //0x260
    struct _KAFFINITY_EX EffectiveAffinity;                                 //0x268
    union _LARGE_INTEGER EffectivePerProcessUserTimeLimit;                  //0x310
    ULONGLONG EffectiveMinimumWorkingSetSize;                               //0x318
    ULONGLONG EffectiveMaximumWorkingSetSize;                               //0x320
    ULONGLONG EffectiveProcessMemoryLimit;                                  //0x328
    struct _EJOB* EffectiveProcessMemoryLimitJob;                           //0x330
    struct _EJOB* EffectivePerProcessUserTimeLimitJob;                      //0x338
    struct _EJOB* EffectiveNetIoRateLimitJob;                               //0x340
    struct _EJOB* EffectiveHeapAttributionJob;                              //0x348
    ULONG EffectiveLimitFlags;                                              //0x350
    ULONG EffectiveSchedulingClass;                                         //0x354
    ULONG EffectiveFreezeCount;                                             //0x358
    ULONG EffectiveBackgroundCount;                                         //0x35c
    ULONG EffectiveSwapCount;                                               //0x360
    ULONG EffectiveNotificationLimitCount;                                  //0x364
    UCHAR EffectivePriorityClass;                                           //0x368
    UCHAR PriorityClass;                                                    //0x369
    UCHAR NestingDepth;                                                     //0x36a
    UCHAR Reserved1[1];                                                     //0x36b
    ULONG CompletionFilter;                                                 //0x36c
    union
    {
        struct _WNF_STATE_NAME WakeChannel;                                 //0x370
        struct _PS_JOB_WAKE_INFORMATION WakeInfo;                           //0x370
    };
    struct _JOBOBJECT_WAKE_FILTER WakeFilter;                               //0x3b8
    ULONG LowEdgeLatchFilter;                                               //0x3c0
    struct _EJOB* NotificationLink;                                         //0x3c8
    ULONGLONG CurrentJobMemoryUsed;                                         //0x3d0
    struct _JOB_NOTIFICATION_INFORMATION* NotificationInfo;                 //0x3d8
    VOID* NotificationInfoQuotaReference;                                   //0x3e0
    struct _IO_MINI_COMPLETION_PACKET_USER* NotificationPacket;             //0x3e8
    struct _JOB_CPU_RATE_CONTROL* CpuRateControl;                           //0x3f0
    VOID* EffectiveSchedulingGroup;                                         //0x3f8
    ULONGLONG ReadyTime;                                                    //0x400
    struct _EX_PUSH_LOCK MemoryLimitsLock;                                  //0x408
    struct _LIST_ENTRY SiblingJobLinks;                                     //0x410
    struct _LIST_ENTRY ChildJobListHead;                                    //0x420
    struct _EJOB* ParentJob;                                                //0x430
    struct _EJOB* volatile RootJob;                                         //0x438
    struct _LIST_ENTRY IteratorListHead;                                    //0x440
    ULONGLONG AncestorCount;                                                //0x450
    union
    {
        struct _EJOB** Ancestors;                                           //0x458
        VOID* SessionObject;                                                //0x458
    };
    struct _EPROCESS_VALUES Accounting;                                     //0x460
    ULONG ShadowActiveProcessCount;                                         //0x4c8
    ULONG ActiveAuxiliaryProcessCount;                                      //0x4cc
    ULONG SequenceNumber;                                                   //0x4d0
    ULONG JobId;                                                            //0x4d4
    struct _GUID ContainerId;                                               //0x4d8
    struct _GUID ContainerTelemetryId;                                      //0x4e8
    struct _ESERVERSILO_GLOBALS* ServerSiloGlobals;                         //0x4f8
    struct _PS_PROPERTY_SET PropertySet;                                    //0x500
    struct _PSP_STORAGE* Storage;                                           //0x518
    struct _JOB_NET_RATE_CONTROL* NetRateControl;                           //0x520
    union
    {
        ULONG JobFlags;                                                     //0x528
        struct
        {
            ULONG CloseDone:1;                                              //0x528
            ULONG MultiGroup:1;                                             //0x528
            ULONG OutstandingNotification:1;                                //0x528
            ULONG NotificationInProgress:1;                                 //0x528
            ULONG UILimits:1;                                               //0x528
            ULONG CpuRateControlActive:1;                                   //0x528
            ULONG OwnCpuRateControl:1;                                      //0x528
            ULONG Terminating:1;                                            //0x528
            ULONG WorkingSetLock:1;                                         //0x528
            ULONG JobFrozen:1;                                              //0x528
            ULONG Background:1;                                             //0x528
            ULONG WakeNotificationAllocated:1;                              //0x528
            ULONG WakeNotificationEnabled:1;                                //0x528
            ULONG WakeNotificationPending:1;                                //0x528
            ULONG LimitNotificationRequired:1;                              //0x528
            ULONG ZeroCountNotificationRequired:1;                          //0x528
            ULONG CycleTimeNotificationRequired:1;                          //0x528
            ULONG CycleTimeNotificationPending:1;                           //0x528
            ULONG TimersVirtualized:1;                                      //0x528
            ULONG JobSwapped:1;                                             //0x528
            ULONG ViolationDetected:1;                                      //0x528
            ULONG EmptyJobNotified:1;                                       //0x528
            ULONG NoSystemCharge:1;                                         //0x528
            ULONG DropNoWakeCharges:1;                                      //0x528
            ULONG NoWakeChargePolicyDecided:1;                              //0x528
            ULONG NetRateControlActive:1;                                   //0x528
            ULONG OwnNetRateControl:1;                                      //0x528
            ULONG IoRateControlActive:1;                                    //0x528
            ULONG OwnIoRateControl:1;                                       //0x528
            ULONG DisallowNewProcesses:1;                                   //0x528
            ULONG Silo:1;                                                   //0x528
            ULONG ContainerTelemetryIdSet:1;                                //0x528
        };
    };
    union
    {
        ULONG JobFlags2;                                                    //0x52c
        struct
        {
            ULONG ParentLocked:1;                                           //0x52c
            ULONG EnableUsermodeSiloThreadImpersonation:1;                  //0x52c
            ULONG DisallowUsermodeSiloThreadImpersonation:1;                //0x52c
        };
    };
    struct _PROCESS_EXTENDED_ENERGY_VALUES* EnergyValues;                   //0x530
    volatile ULONGLONG SharedCommitCharge;                                  //0x538
    ULONG DiskIoAttributionUserRefCount;                                    //0x540
    ULONG DiskIoAttributionRefCount;                                        //0x544
    union
    {
        VOID* DiskIoAttributionContext;                                     //0x548
        struct _EJOB* DiskIoAttributionOwnerJob;                            //0x548
    };
    struct _JOB_RATE_CONTROL_HEADER IoRateControlHeader;                    //0x550
    struct _PS_IO_CONTROL_ENTRY GlobalIoControl;                            //0x578
    volatile LONG IoControlStateLock;                                       //0x5b0
    struct _RTL_RB_TREE VolumeIoControlTree;                                //0x5b8
    ULONGLONG IoRateOverQuotaHistory;                                       //0x5c8
    ULONG IoRateCurrentGeneration;                                          //0x5d0
    ULONG IoRateLastQueryGeneration;                                        //0x5d4
    ULONG IoRateGenerationLength;                                           //0x5d8
    ULONG IoRateOverQuotaNotifySequenceId;                                  //0x5dc
    ULONGLONG LastThrottledIoTime;                                          //0x5e0
    struct _EX_PUSH_LOCK IoControlLock;                                     //0x5e8
    LONGLONG SiloHardReferenceCount;                                        //0x5f0
    struct _WORK_QUEUE_ITEM RundownWorkItem;                                //0x5f8
    VOID* PartitionObject;                                                  //0x618
    struct _EJOB* PartitionOwnerJob;                                        //0x620
    union _JOBOBJECT_ENERGY_TRACKING_STATE EnergyTrackingState;             //0x628
    ULONGLONG KernelWaitTime;                                               //0x630
    ULONGLONG UserWaitTime;                                                 //0x638
}; 
//0x1c0 bytes (sizeof)
struct _ENODE
{
    struct _KNODE Ncb;                                                      //0x0
    struct _WORK_QUEUE_ITEM HotAddProcessorWorkItem;                        //0x180
}; 
//0x80 bytes (sizeof)
struct _EPARTITION
{
    VOID* MmPartition;                                                      //0x0
    VOID* CcPartition;                                                      //0x8
    VOID* ExPartition;                                                      //0x10
    LONGLONG HardReferenceCount;                                            //0x18
    LONGLONG OpenHandleCount;                                               //0x20
    struct _LIST_ENTRY ActivePartitionLinks;                                //0x28
    struct _EPARTITION* ParentPartition;                                    //0x38
    struct _WORK_QUEUE_ITEM TeardownWorkItem;                               //0x40
    struct _EX_PUSH_LOCK TeardownLock;                                      //0x60
    struct _EPROCESS* SystemProcess;                                        //0x68
    VOID* SystemProcessHandle;                                              //0x70
    union
    {
        ULONG PartitionFlags;                                               //0x78
        ULONG PairedWithJob:1;                                              //0x78
    };
}; 
//0xa40 bytes (sizeof)
struct _EPROCESS
{
    struct _KPROCESS Pcb;                                                   //0x0
    struct _EX_PUSH_LOCK ProcessLock;                                       //0x438
    VOID* UniqueProcessId;                                                  //0x440
    struct _LIST_ENTRY ActiveProcessLinks;                                  //0x448
    struct _EX_RUNDOWN_REF RundownProtect;                                  //0x458
    union
    {
        ULONG Flags2;                                                       //0x460
        struct
        {
            ULONG JobNotReallyActive:1;                                     //0x460
            ULONG AccountingFolded:1;                                       //0x460
            ULONG NewProcessReported:1;                                     //0x460
            ULONG ExitProcessReported:1;                                    //0x460
            ULONG ReportCommitChanges:1;                                    //0x460
            ULONG LastReportMemory:1;                                       //0x460
            ULONG ForceWakeCharge:1;                                        //0x460
            ULONG CrossSessionCreate:1;                                     //0x460
            ULONG NeedsHandleRundown:1;                                     //0x460
            ULONG RefTraceEnabled:1;                                        //0x460
            ULONG PicoCreated:1;                                            //0x460
            ULONG EmptyJobEvaluated:1;                                      //0x460
            ULONG DefaultPagePriority:3;                                    //0x460
            ULONG PrimaryTokenFrozen:1;                                     //0x460
            ULONG ProcessVerifierTarget:1;                                  //0x460
            ULONG RestrictSetThreadContext:1;                               //0x460
            ULONG AffinityPermanent:1;                                      //0x460
            ULONG AffinityUpdateEnable:1;                                   //0x460
            ULONG PropagateNode:1;                                          //0x460
            ULONG ExplicitAffinity:1;                                       //0x460
            ULONG ProcessExecutionState:2;                                  //0x460
            ULONG EnableReadVmLogging:1;                                    //0x460
            ULONG EnableWriteVmLogging:1;                                   //0x460
            ULONG FatalAccessTerminationRequested:1;                        //0x460
            ULONG DisableSystemAllowedCpuSet:1;                             //0x460
            ULONG ProcessStateChangeRequest:2;                              //0x460
            ULONG ProcessStateChangeInProgress:1;                           //0x460
            ULONG InPrivate:1;                                              //0x460
        };
    };
    union
    {
        ULONG Flags;                                                        //0x464
        struct
        {
            ULONG CreateReported:1;                                         //0x464
            ULONG NoDebugInherit:1;                                         //0x464
            ULONG ProcessExiting:1;                                         //0x464
            ULONG ProcessDelete:1;                                          //0x464
            ULONG ManageExecutableMemoryWrites:1;                           //0x464
            ULONG VmDeleted:1;                                              //0x464
            ULONG OutswapEnabled:1;                                         //0x464
            ULONG Outswapped:1;                                             //0x464
            ULONG FailFastOnCommitFail:1;                                   //0x464
            ULONG Wow64VaSpace4Gb:1;                                        //0x464
            ULONG AddressSpaceInitialized:2;                                //0x464
            ULONG SetTimerResolution:1;                                     //0x464
            ULONG BreakOnTermination:1;                                     //0x464
            ULONG DeprioritizeViews:1;                                      //0x464
            ULONG WriteWatch:1;                                             //0x464
            ULONG ProcessInSession:1;                                       //0x464
            ULONG OverrideAddressSpace:1;                                   //0x464
            ULONG HasAddressSpace:1;                                        //0x464
            ULONG LaunchPrefetched:1;                                       //0x464
            ULONG Background:1;                                             //0x464
            ULONG VmTopDown:1;                                              //0x464
            ULONG ImageNotifyDone:1;                                        //0x464
            ULONG PdeUpdateNeeded:1;                                        //0x464
            ULONG VdmAllowed:1;                                             //0x464
            ULONG ProcessRundown:1;                                         //0x464
            ULONG ProcessInserted:1;                                        //0x464
            ULONG DefaultIoPriority:3;                                      //0x464
            ULONG ProcessSelfDelete:1;                                      //0x464
            ULONG SetTimerResolutionLink:1;                                 //0x464
        };
    };
    union _LARGE_INTEGER CreateTime;                                        //0x468
    ULONGLONG ProcessQuotaUsage[2];                                         //0x470
    ULONGLONG ProcessQuotaPeak[2];                                          //0x480
    ULONGLONG PeakVirtualSize;                                              //0x490
    ULONGLONG VirtualSize;                                                  //0x498
    struct _LIST_ENTRY SessionProcessLinks;                                 //0x4a0
    union
    {
        VOID* ExceptionPortData;                                            //0x4b0
        ULONGLONG ExceptionPortValue;                                       //0x4b0
        ULONGLONG ExceptionPortState:3;                                     //0x4b0
    };
    struct _EX_FAST_REF Token;                                              //0x4b8
    ULONGLONG MmReserved;                                                   //0x4c0
    struct _EX_PUSH_LOCK AddressCreationLock;                               //0x4c8
    struct _EX_PUSH_LOCK PageTableCommitmentLock;                           //0x4d0
    struct _ETHREAD* RotateInProgress;                                      //0x4d8
    struct _ETHREAD* ForkInProgress;                                        //0x4e0
    struct _EJOB* volatile CommitChargeJob;                                 //0x4e8
    struct _RTL_AVL_TREE CloneRoot;                                         //0x4f0
    volatile ULONGLONG NumberOfPrivatePages;                                //0x4f8
    volatile ULONGLONG NumberOfLockedPages;                                 //0x500
    VOID* Win32Process;                                                     //0x508
    struct _EJOB* volatile Job;                                             //0x510
    VOID* SectionObject;                                                    //0x518
    VOID* SectionBaseAddress;                                               //0x520
    ULONG Cookie;                                                           //0x528
    struct _PAGEFAULT_HISTORY* WorkingSetWatch;                             //0x530
    VOID* Win32WindowStation;                                               //0x538
    VOID* InheritedFromUniqueProcessId;                                     //0x540
    volatile ULONGLONG OwnerProcessId;                                      //0x548
    struct _PEB* Peb;                                                       //0x550
    struct _MM_SESSION_SPACE* Session;                                      //0x558
    VOID* Spare1;                                                           //0x560
    struct _EPROCESS_QUOTA_BLOCK* QuotaBlock;                               //0x568
    struct _HANDLE_TABLE* ObjectTable;                                      //0x570
    VOID* DebugPort;                                                        //0x578
    struct _EWOW64PROCESS* WoW64Process;                                    //0x580
    VOID* DeviceMap;                                                        //0x588
    VOID* EtwDataSource;                                                    //0x590
    ULONGLONG PageDirectoryPte;                                             //0x598
    struct _FILE_OBJECT* ImageFilePointer;                                  //0x5a0
    UCHAR ImageFileName[15];                                                //0x5a8
    UCHAR PriorityClass;                                                    //0x5b7
    VOID* SecurityPort;                                                     //0x5b8
    struct _SE_AUDIT_PROCESS_CREATION_INFO SeAuditProcessCreationInfo;      //0x5c0
    struct _LIST_ENTRY JobLinks;                                            //0x5c8
    VOID* HighestUserAddress;                                               //0x5d8
    struct _LIST_ENTRY ThreadListHead;                                      //0x5e0
    volatile ULONG ActiveThreads;                                           //0x5f0
    ULONG ImagePathHash;                                                    //0x5f4
    ULONG DefaultHardErrorProcessing;                                       //0x5f8
    LONG LastThreadExitStatus;                                              //0x5fc
    struct _EX_FAST_REF PrefetchTrace;                                      //0x600
    VOID* LockedPagesList;                                                  //0x608
    union _LARGE_INTEGER ReadOperationCount;                                //0x610
    union _LARGE_INTEGER WriteOperationCount;                               //0x618
    union _LARGE_INTEGER OtherOperationCount;                               //0x620
    union _LARGE_INTEGER ReadTransferCount;                                 //0x628
    union _LARGE_INTEGER WriteTransferCount;                                //0x630
    union _LARGE_INTEGER OtherTransferCount;                                //0x638
    ULONGLONG CommitChargeLimit;                                            //0x640
    volatile ULONGLONG CommitCharge;                                        //0x648
    volatile ULONGLONG CommitChargePeak;                                    //0x650
    struct _MMSUPPORT_FULL Vm;                                              //0x680
    struct _LIST_ENTRY MmProcessLinks;                                      //0x7c0
    ULONG ModifiedPageCount;                                                //0x7d0
    LONG ExitStatus;                                                        //0x7d4
    struct _RTL_AVL_TREE VadRoot;                                           //0x7d8
    VOID* VadHint;                                                          //0x7e0
    ULONGLONG VadCount;                                                     //0x7e8
    volatile ULONGLONG VadPhysicalPages;                                    //0x7f0
    ULONGLONG VadPhysicalPagesLimit;                                        //0x7f8
    struct _ALPC_PROCESS_CONTEXT AlpcContext;                               //0x800
    struct _LIST_ENTRY TimerResolutionLink;                                 //0x820
    struct _PO_DIAG_STACK_RECORD* TimerResolutionStackRecord;               //0x830
    ULONG RequestedTimerResolution;                                         //0x838
    ULONG SmallestTimerResolution;                                          //0x83c
    union _LARGE_INTEGER ExitTime;                                          //0x840
    struct _INVERTED_FUNCTION_TABLE* InvertedFunctionTable;                 //0x848
    struct _EX_PUSH_LOCK InvertedFunctionTableLock;                         //0x850
    ULONG ActiveThreadsHighWatermark;                                       //0x858
    ULONG LargePrivateVadCount;                                             //0x85c
    struct _EX_PUSH_LOCK ThreadListLock;                                    //0x860
    VOID* WnfContext;                                                       //0x868
    struct _EJOB* ServerSilo;                                               //0x870
    UCHAR SignatureLevel;                                                   //0x878
    UCHAR SectionSignatureLevel;                                            //0x879
    struct _PS_PROTECTION Protection;                                       //0x87a
    UCHAR HangCount:3;                                                      //0x87b
    UCHAR GhostCount:3;                                                     //0x87b
    UCHAR PrefilterException:1;                                             //0x87b
    union
    {
        ULONG Flags3;                                                       //0x87c
        struct
        {
            ULONG Minimal:1;                                                //0x87c
            ULONG ReplacingPageRoot:1;                                      //0x87c
            ULONG Crashed:1;                                                //0x87c
            ULONG JobVadsAreTracked:1;                                      //0x87c
            ULONG VadTrackingDisabled:1;                                    //0x87c
            ULONG AuxiliaryProcess:1;                                       //0x87c
            ULONG SubsystemProcess:1;                                       //0x87c
            ULONG IndirectCpuSets:1;                                        //0x87c
            ULONG RelinquishedCommit:1;                                     //0x87c
            ULONG HighGraphicsPriority:1;                                   //0x87c
            ULONG CommitFailLogged:1;                                       //0x87c
            ULONG ReserveFailLogged:1;                                      //0x87c
            ULONG SystemProcess:1;                                          //0x87c
            ULONG HideImageBaseAddresses:1;                                 //0x87c
            ULONG AddressPolicyFrozen:1;                                    //0x87c
            ULONG ProcessFirstResume:1;                                     //0x87c
            ULONG ForegroundExternal:1;                                     //0x87c
            ULONG ForegroundSystem:1;                                       //0x87c
            ULONG HighMemoryPriority:1;                                     //0x87c
            ULONG EnableProcessSuspendResumeLogging:1;                      //0x87c
            ULONG EnableThreadSuspendResumeLogging:1;                       //0x87c
            ULONG SecurityDomainChanged:1;                                  //0x87c
            ULONG SecurityFreezeComplete:1;                                 //0x87c
            ULONG VmProcessorHost:1;                                        //0x87c
            ULONG VmProcessorHostTransition:1;                              //0x87c
            ULONG AltSyscall:1;                                             //0x87c
            ULONG TimerResolutionIgnore:1;                                  //0x87c
            ULONG DisallowUserTerminate:1;                                  //0x87c
        };
    };
    LONG DeviceAsid;                                                        //0x880
    VOID* SvmData;                                                          //0x888
    struct _EX_PUSH_LOCK SvmProcessLock;                                    //0x890
    ULONGLONG SvmLock;                                                      //0x898
    struct _LIST_ENTRY SvmProcessDeviceListHead;                            //0x8a0
    ULONGLONG LastFreezeInterruptTime;                                      //0x8b0
    struct _PROCESS_DISK_COUNTERS* DiskCounters;                            //0x8b8
    VOID* PicoContext;                                                      //0x8c0
    VOID* EnclaveTable;                                                     //0x8c8
    ULONGLONG EnclaveNumber;                                                //0x8d0
    struct _EX_PUSH_LOCK EnclaveLock;                                       //0x8d8
    ULONG HighPriorityFaultsAllowed;                                        //0x8e0
    struct _PO_PROCESS_ENERGY_CONTEXT* EnergyContext;                       //0x8e8
    VOID* VmContext;                                                        //0x8f0
    ULONGLONG SequenceNumber;                                               //0x8f8
    ULONGLONG CreateInterruptTime;                                          //0x900
    ULONGLONG CreateUnbiasedInterruptTime;                                  //0x908
    ULONGLONG TotalUnbiasedFrozenTime;                                      //0x910
    ULONGLONG LastAppStateUpdateTime;                                       //0x918
    ULONGLONG LastAppStateUptime:61;                                        //0x920
    ULONGLONG LastAppState:3;                                               //0x920
    volatile ULONGLONG SharedCommitCharge;                                  //0x928
    struct _EX_PUSH_LOCK SharedCommitLock;                                  //0x930
    struct _LIST_ENTRY SharedCommitLinks;                                   //0x938
    union
    {
        struct
        {
            ULONGLONG AllowedCpuSets;                                       //0x948
            ULONGLONG DefaultCpuSets;                                       //0x950
        };
        struct
        {
            ULONGLONG* AllowedCpuSetsIndirect;                              //0x948
            ULONGLONG* DefaultCpuSetsIndirect;                              //0x950
        };
    };
    VOID* DiskIoAttribution;                                                //0x958
    VOID* DxgProcess;                                                       //0x960
    ULONG Win32KFilterSet;                                                  //0x968
    unionvolatile _PS_INTERLOCKED_TIMER_DELAY_VALUES ProcessTimerDelay;     //0x970
    volatile ULONG KTimerSets;                                              //0x978
    volatile ULONG KTimer2Sets;                                             //0x97c
    volatile ULONG ThreadTimerSets;                                         //0x980
    ULONGLONG VirtualTimerListLock;                                         //0x988
    struct _LIST_ENTRY VirtualTimerListHead;                                //0x990
    union
    {
        struct _WNF_STATE_NAME WakeChannel;                                 //0x9a0
        struct _PS_PROCESS_WAKE_INFORMATION WakeInfo;                       //0x9a0
    };
    union
    {
        ULONG MitigationFlags;                                              //0x9d0
        struct
        {
            ULONG ControlFlowGuardEnabled:1;                                //0x9d0
            ULONG ControlFlowGuardExportSuppressionEnabled:1;               //0x9d0
            ULONG ControlFlowGuardStrict:1;                                 //0x9d0
            ULONG DisallowStrippedImages:1;                                 //0x9d0
            ULONG ForceRelocateImages:1;                                    //0x9d0
            ULONG HighEntropyASLREnabled:1;                                 //0x9d0
            ULONG StackRandomizationDisabled:1;                             //0x9d0
            ULONG ExtensionPointDisable:1;                                  //0x9d0
            ULONG DisableDynamicCode:1;                                     //0x9d0
            ULONG DisableDynamicCodeAllowOptOut:1;                          //0x9d0
            ULONG DisableDynamicCodeAllowRemoteDowngrade:1;                 //0x9d0
            ULONG AuditDisableDynamicCode:1;                                //0x9d0
            ULONG DisallowWin32kSystemCalls:1;                              //0x9d0
            ULONG AuditDisallowWin32kSystemCalls:1;                         //0x9d0
            ULONG EnableFilteredWin32kAPIs:1;                               //0x9d0
            ULONG AuditFilteredWin32kAPIs:1;                                //0x9d0
            ULONG DisableNonSystemFonts:1;                                  //0x9d0
            ULONG AuditNonSystemFontLoading:1;                              //0x9d0
            ULONG PreferSystem32Images:1;                                   //0x9d0
            ULONG ProhibitRemoteImageMap:1;                                 //0x9d0
            ULONG AuditProhibitRemoteImageMap:1;                            //0x9d0
            ULONG ProhibitLowILImageMap:1;                                  //0x9d0
            ULONG AuditProhibitLowILImageMap:1;                             //0x9d0
            ULONG SignatureMitigationOptIn:1;                               //0x9d0
            ULONG AuditBlockNonMicrosoftBinaries:1;                         //0x9d0
            ULONG AuditBlockNonMicrosoftBinariesAllowStore:1;               //0x9d0
            ULONG LoaderIntegrityContinuityEnabled:1;                       //0x9d0
            ULONG AuditLoaderIntegrityContinuity:1;                         //0x9d0
            ULONG EnableModuleTamperingProtection:1;                        //0x9d0
            ULONG EnableModuleTamperingProtectionNoInherit:1;               //0x9d0
            ULONG RestrictIndirectBranchPrediction:1;                       //0x9d0
            ULONG IsolateSecurityDomain:1;                                  //0x9d0
        } MitigationFlagsValues;                                            //0x9d0
    };
    union
    {
        ULONG MitigationFlags2;                                             //0x9d4
        struct
        {
            ULONG EnableExportAddressFilter:1;                              //0x9d4
            ULONG AuditExportAddressFilter:1;                               //0x9d4
            ULONG EnableExportAddressFilterPlus:1;                          //0x9d4
            ULONG AuditExportAddressFilterPlus:1;                           //0x9d4
            ULONG EnableRopStackPivot:1;                                    //0x9d4
            ULONG AuditRopStackPivot:1;                                     //0x9d4
            ULONG EnableRopCallerCheck:1;                                   //0x9d4
            ULONG AuditRopCallerCheck:1;                                    //0x9d4
            ULONG EnableRopSimExec:1;                                       //0x9d4
            ULONG AuditRopSimExec:1;                                        //0x9d4
            ULONG EnableImportAddressFilter:1;                              //0x9d4
            ULONG AuditImportAddressFilter:1;                               //0x9d4
            ULONG DisablePageCombine:1;                                     //0x9d4
            ULONG SpeculativeStoreBypassDisable:1;                          //0x9d4
            ULONG CetUserShadowStacks:1;                                    //0x9d4
            ULONG AuditCetUserShadowStacks:1;                               //0x9d4
            ULONG AuditCetUserShadowStacksLogged:1;                         //0x9d4
            ULONG UserCetSetContextIpValidation:1;                          //0x9d4
            ULONG AuditUserCetSetContextIpValidation:1;                     //0x9d4
            ULONG AuditUserCetSetContextIpValidationLogged:1;               //0x9d4
            ULONG CetUserShadowStacksStrictMode:1;                          //0x9d4
            ULONG BlockNonCetBinaries:1;                                    //0x9d4
            ULONG BlockNonCetBinariesNonEhcont:1;                           //0x9d4
            ULONG AuditBlockNonCetBinaries:1;                               //0x9d4
            ULONG AuditBlockNonCetBinariesLogged:1;                         //0x9d4
            ULONG Reserved1:1;                                              //0x9d4
            ULONG Reserved2:1;                                              //0x9d4
            ULONG Reserved3:1;                                              //0x9d4
            ULONG Reserved4:1;                                              //0x9d4
            ULONG Reserved5:1;                                              //0x9d4
            ULONG CetDynamicApisOutOfProcOnly:1;                            //0x9d4
            ULONG UserCetSetContextIpValidationRelaxedMode:1;               //0x9d4
        } MitigationFlags2Values;                                           //0x9d4
    };
    VOID* PartitionObject;                                                  //0x9d8
    ULONGLONG SecurityDomain;                                               //0x9e0
    ULONGLONG ParentSecurityDomain;                                         //0x9e8
    VOID* CoverageSamplerContext;                                           //0x9f0
    VOID* MmHotPatchContext;                                                //0x9f8
    struct _RTL_AVL_TREE DynamicEHContinuationTargetsTree;                  //0xa00
    struct _EX_PUSH_LOCK DynamicEHContinuationTargetsLock;                  //0xa08
    struct _PS_DYNAMIC_ENFORCED_ADDRESS_RANGES DynamicEnforcedCetCompatibleRanges; //0xa10
    ULONG DisabledComponentFlags;                                           //0xa20
}; 
//0x0 bytes (sizeof)
struct _EPROCESS_QUOTA_BLOCK; 
//0x68 bytes (sizeof)
struct _EPROCESS_VALUES
{
    ULONGLONG KernelTime;                                                   //0x0
    ULONGLONG UserTime;                                                     //0x8
    ULONGLONG ReadyTime;                                                    //0x10
    ULONGLONG CycleTime;                                                    //0x18
    ULONGLONG ContextSwitches;                                              //0x20
    LONGLONG ReadOperationCount;                                            //0x28
    LONGLONG WriteOperationCount;                                           //0x30
    LONGLONG OtherOperationCount;                                           //0x38
    LONGLONG ReadTransferCount;                                             //0x40
    LONGLONG WriteTransferCount;                                            //0x48
    LONGLONG OtherTransferCount;                                            //0x50
    ULONGLONG KernelWaitTime;                                               //0x58
    ULONGLONG UserWaitTime;                                                 //0x60
}; 
//0x68 bytes (sizeof)
struct _ERESOURCE
{
    struct _LIST_ENTRY SystemResourcesList;                                 //0x0
    struct _OWNER_ENTRY* OwnerTable;                                        //0x10
    SHORT ActiveCount;                                                      //0x18
    union
    {
        USHORT Flag;                                                        //0x1a
        struct
        {
            UCHAR ReservedLowFlags;                                         //0x1a
            UCHAR WaiterPriority;                                           //0x1b
        };
    };
    VOID* SharedWaiters;                                                    //0x20
    VOID* ExclusiveWaiters;                                                 //0x28
    struct _OWNER_ENTRY OwnerEntry;                                         //0x30
    ULONG ActiveEntries;                                                    //0x40
    ULONG ContentionCount;                                                  //0x44
    ULONG NumberOfSharedWaiters;                                            //0x48
    ULONG NumberOfExclusiveWaiters;                                         //0x4c
    VOID* Reserved2;                                                        //0x50
    union
    {
        VOID* Address;                                                      //0x58
        ULONGLONG CreatorBackTraceIndex;                                    //0x58
    };
    ULONGLONG SpinLock;                                                     //0x60
}; 
//0x498 bytes (sizeof)
struct _ESERVERSILO_GLOBALS
{
    struct _OBP_SILODRIVERSTATE ObSiloState;                                //0x0
    struct _SEP_SILOSTATE SeSiloState;                                      //0x2e0
    struct _SEP_RM_LSA_CONNECTION_STATE SeRmSiloState;                      //0x310
    struct _ETW_SILODRIVERSTATE* EtwSiloState;                              //0x360
    struct _EPROCESS* MiSessionLeaderProcess;                               //0x368
    struct _EPROCESS* ExpDefaultErrorPortProcess;                           //0x370
    VOID* ExpDefaultErrorPort;                                              //0x378
    ULONG HardErrorState;                                                   //0x380
    struct _EXP_LICENSE_STATE* ExpLicenseState;                             //0x388
    struct _WNF_SILODRIVERSTATE WnfSiloState;                               //0x390
    struct _DBGK_SILOSTATE DbgkSiloState;                                   //0x3c8
    struct _UNICODE_STRING PsProtectedCurrentDirectory;                     //0x3e8
    struct _UNICODE_STRING PsProtectedEnvironment;                          //0x3f8
    VOID* ApiSetSection;                                                    //0x408
    VOID* ApiSetSchema;                                                     //0x410
    UCHAR OneCoreForwardersEnabled;                                         //0x418
    UCHAR TzVirtualizationSupported;                                        //0x419
    struct _EX_TIMEZONE_STATE* ExTimeZoneState;                             //0x420
    struct _UNICODE_STRING NtSystemRoot;                                    //0x428
    struct _UNICODE_STRING SiloRootDirectoryName;                           //0x438
    struct _PSP_STORAGE* Storage;                                           //0x448
    enum _SERVERSILO_STATE State;                                           //0x450
    LONG ExitStatus;                                                        //0x454
    struct _KEVENT* DeleteEvent;                                            //0x458
    struct _SILO_USER_SHARED_DATA* UserSharedData;                          //0x460
    VOID* UserSharedSection;                                                //0x468
    struct _WORK_QUEUE_ITEM TerminateWorkItem;                              //0x470
    UCHAR IsDownlevelContainer;                                             //0x490
}; 
//0x898 bytes (sizeof)
struct _ETHREAD
{
    struct _KTHREAD Tcb;                                                    //0x0
    union _LARGE_INTEGER CreateTime;                                        //0x430
    union
    {
        union _LARGE_INTEGER ExitTime;                                      //0x438
        struct _LIST_ENTRY KeyedWaitChain;                                  //0x438
    };
    union
    {
        struct _LIST_ENTRY PostBlockList;                                   //0x448
        struct
        {
            VOID* ForwardLinkShadow;                                        //0x448
            VOID* StartAddress;                                             //0x450
        };
    };
    union
    {
        struct _TERMINATION_PORT* TerminationPort;                          //0x458
        struct _ETHREAD* ReaperLink;                                        //0x458
        VOID* KeyedWaitValue;                                               //0x458
    };
    ULONGLONG ActiveTimerListLock;                                          //0x460
    struct _LIST_ENTRY ActiveTimerListHead;                                 //0x468
    struct _CLIENT_ID Cid;                                                  //0x478
    union
    {
        struct _KSEMAPHORE KeyedWaitSemaphore;                              //0x488
        struct _KSEMAPHORE AlpcWaitSemaphore;                               //0x488
    };
    union _PS_CLIENT_SECURITY_CONTEXT ClientSecurity;                       //0x4a8
    struct _LIST_ENTRY IrpList;                                             //0x4b0
    ULONGLONG TopLevelIrp;                                                  //0x4c0
    struct _DEVICE_OBJECT* DeviceToVerify;                                  //0x4c8
    VOID* Win32StartAddress;                                                //0x4d0
    VOID* ChargeOnlySession;                                                //0x4d8
    VOID* LegacyPowerObject;                                                //0x4e0
    struct _LIST_ENTRY ThreadListEntry;                                     //0x4e8
    struct _EX_RUNDOWN_REF RundownProtect;                                  //0x4f8
    struct _EX_PUSH_LOCK ThreadLock;                                        //0x500
    ULONG ReadClusterSize;                                                  //0x508
    volatile LONG MmLockOrdering;                                           //0x50c
    union
    {
        ULONG CrossThreadFlags;                                             //0x510
        struct
        {
            ULONG Terminated:1;                                             //0x510
            ULONG ThreadInserted:1;                                         //0x510
            ULONG HideFromDebugger:1;                                       //0x510
            ULONG ActiveImpersonationInfo:1;                                //0x510
            ULONG HardErrorsAreDisabled:1;                                  //0x510
            ULONG BreakOnTermination:1;                                     //0x510
            ULONG SkipCreationMsg:1;                                        //0x510
            ULONG SkipTerminationMsg:1;                                     //0x510
            ULONG CopyTokenOnOpen:1;                                        //0x510
            ULONG ThreadIoPriority:3;                                       //0x510
            ULONG ThreadPagePriority:3;                                     //0x510
            ULONG RundownFail:1;                                            //0x510
            ULONG UmsForceQueueTermination:1;                               //0x510
            ULONG IndirectCpuSets:1;                                        //0x510
            ULONG DisableDynamicCodeOptOut:1;                               //0x510
            ULONG ExplicitCaseSensitivity:1;                                //0x510
            ULONG PicoNotifyExit:1;                                         //0x510
            ULONG DbgWerUserReportActive:1;                                 //0x510
            ULONG ForcedSelfTrimActive:1;                                   //0x510
            ULONG SamplingCoverage:1;                                       //0x510
            ULONG ReservedCrossThreadFlags:8;                               //0x510
        };
    };
    union
    {
        ULONG SameThreadPassiveFlags;                                       //0x514
        struct
        {
            ULONG ActiveExWorker:1;                                         //0x514
            ULONG MemoryMaker:1;                                            //0x514
            ULONG StoreLockThread:2;                                        //0x514
            ULONG ClonedThread:1;                                           //0x514
            ULONG KeyedEventInUse:1;                                        //0x514
            ULONG SelfTerminate:1;                                          //0x514
            ULONG RespectIoPriority:1;                                      //0x514
            ULONG ActivePageLists:1;                                        //0x514
            ULONG SecureContext:1;                                          //0x514
            ULONG ZeroPageThread:1;                                         //0x514
            ULONG WorkloadClass:1;                                          //0x514
            ULONG ReservedSameThreadPassiveFlags:20;                        //0x514
        };
    };
    union
    {
        ULONG SameThreadApcFlags;                                           //0x518
        struct
        {
            UCHAR OwnsProcessAddressSpaceExclusive:1;                       //0x518
            UCHAR OwnsProcessAddressSpaceShared:1;                          //0x518
            UCHAR HardFaultBehavior:1;                                      //0x518
            volatile UCHAR StartAddressInvalid:1;                           //0x518
            UCHAR EtwCalloutActive:1;                                       //0x518
            UCHAR SuppressSymbolLoad:1;                                     //0x518
            UCHAR Prefetching:1;                                            //0x518
            UCHAR OwnsVadExclusive:1;                                       //0x518
            UCHAR SystemPagePriorityActive:1;                               //0x519
            UCHAR SystemPagePriority:3;                                     //0x519
            UCHAR AllowUserWritesToExecutableMemory:1;                      //0x519
            UCHAR AllowKernelWritesToExecutableMemory:1;                    //0x519
            UCHAR OwnsVadShared:1;                                          //0x519
        };
    };
    UCHAR CacheManagerActive;                                               //0x51c
    UCHAR DisablePageFaultClustering;                                       //0x51d
    UCHAR ActiveFaultCount;                                                 //0x51e
    UCHAR LockOrderState;                                                   //0x51f
    ULONG PerformanceCountLowReserved;                                      //0x520
    LONG PerformanceCountHighReserved;                                      //0x524
    ULONGLONG AlpcMessageId;                                                //0x528
    union
    {
        VOID* AlpcMessage;                                                  //0x530
        ULONG AlpcReceiveAttributeSet;                                      //0x530
    };
    struct _LIST_ENTRY AlpcWaitListEntry;                                   //0x538
    LONG ExitStatus;                                                        //0x548
    ULONG CacheManagerCount;                                                //0x54c
    ULONG IoBoostCount;                                                     //0x550
    ULONG IoQoSBoostCount;                                                  //0x554
    ULONG IoQoSThrottleCount;                                               //0x558
    ULONG KernelStackReference;                                             //0x55c
    struct _LIST_ENTRY BoostList;                                           //0x560
    struct _LIST_ENTRY DeboostList;                                         //0x570
    ULONGLONG BoostListLock;                                                //0x580
    ULONGLONG IrpListLock;                                                  //0x588
    VOID* ReservedForSynchTracking;                                         //0x590
    struct _SINGLE_LIST_ENTRY CmCallbackListHead;                           //0x598
    struct _GUID* ActivityId;                                               //0x5a0
    struct _SINGLE_LIST_ENTRY SeLearningModeListHead;                       //0x5a8
    VOID* VerifierContext;                                                  //0x5b0
    VOID* AdjustedClientToken;                                              //0x5b8
    VOID* WorkOnBehalfThread;                                               //0x5c0
    struct _PS_PROPERTY_SET PropertySet;                                    //0x5c8
    VOID* PicoContext;                                                      //0x5e0
    ULONGLONG UserFsBase;                                                   //0x5e8
    ULONGLONG UserGsBase;                                                   //0x5f0
    struct _THREAD_ENERGY_VALUES* EnergyValues;                             //0x5f8
    union
    {
        ULONGLONG SelectedCpuSets;                                          //0x600
        ULONGLONG* SelectedCpuSetsIndirect;                                 //0x600
    };
    struct _EJOB* Silo;                                                     //0x608
    struct _UNICODE_STRING* ThreadName;                                     //0x610
    struct _CONTEXT* SetContextState;                                       //0x618
    ULONG LastExpectedRunTime;                                              //0x620
    ULONG HeapData;                                                         //0x624
    struct _LIST_ENTRY OwnerEntryListHead;                                  //0x628
    ULONGLONG DisownedOwnerEntryListLock;                                   //0x638
    struct _LIST_ENTRY DisownedOwnerEntryListHead;                          //0x640
    struct _KLOCK_ENTRY LockEntries[6];                                     //0x650
    VOID* CmDbgInfo;                                                        //0x890
}; 
//0x138 bytes (sizeof)
struct _ETIMER
{
    struct _KTIMER KeTimer;                                                 //0x0
    ULONGLONG Lock;                                                         //0x40
    struct _KAPC TimerApc;                                                  //0x48
    struct _KDPC TimerDpc;                                                  //0xa0
    struct _LIST_ENTRY ActiveTimerListEntry;                                //0xe0
    ULONG Period;                                                           //0xf0
    union
    {
        CHAR TimerFlags;                                                    //0xf4
        struct
        {
            UCHAR ApcAssociated:1;                                          //0xf4
            UCHAR FlushDpcs:1;                                              //0xf4
            UCHAR Paused:1;                                                 //0xf4
            UCHAR Spare1:5;                                                 //0xf4
        };
    };
    UCHAR DueTimeType;                                                      //0xf5
    USHORT Spare2;                                                          //0xf6
    struct _DIAGNOSTIC_CONTEXT* volatile WakeReason;                        //0xf8
    struct _LIST_ENTRY WakeTimerListEntry;                                  //0x100
    VOID* VirtualizedTimerCookie;                                           //0x110
    struct _LIST_ENTRY VirtualizedTimerLinks;                               //0x118
    ULONGLONG DueTime;                                                      //0x128
    ULONG CoalescingWindow;                                                 //0x130
};
//0x48 bytes (sizeof)
struct _ETWP_NOTIFICATION_HEADER
{
    enum _ETW_NOTIFICATION_TYPE NotificationType;                           //0x0
    ULONG NotificationSize;                                                 //0x4
    LONG RefCount;                                                          //0x8
    UCHAR ReplyRequested;                                                   //0xc
    union
    {
        ULONG ReplyIndex;                                                   //0x10
        ULONG Timeout;                                                      //0x10
    };
    union
    {
        ULONG ReplyCount;                                                   //0x14
        ULONG NotifyeeCount;                                                //0x14
    };
    union
    {
        ULONGLONG ReplyHandle;                                              //0x18
        VOID* ReplyObject;                                                  //0x18
        ULONG RegIndex;                                                     //0x18
    };
    ULONG TargetPID;                                                        //0x20
    ULONG SourcePID;                                                        //0x24
    struct _GUID DestinationGuid;                                           //0x28
    struct _GUID SourceGuid;                                                //0x38
}; 
//0x60 bytes (sizeof)
struct _ETW_APC_ENTRY
{
    union
    {
        struct _SLIST_ENTRY SListEntry;                                     //0x0
        struct _KAPC Apc;                                                   //0x0
    };
}; 
//0x4 bytes (sizeof)
struct _ETW_BUFFER_CONTEXT
{
    union
    {
        struct
        {
            UCHAR ProcessorNumber;                                          //0x0
            UCHAR Alignment;                                                //0x1
        };
        USHORT ProcessorIndex;                                              //0x0
    };
    USHORT LoggerId;                                                        //0x2
}; 
//0x10 bytes (sizeof)
struct _ETW_BUFFER_QUEUE
{
    struct _SINGLE_LIST_ENTRY* QueueTail;                                   //0x0
    struct _SINGLE_LIST_ENTRY QueueEntry;                                   //0x8
}; 
//0x10 bytes (sizeof)
struct _ETW_COUNTERS
{
    LONG GuidCount;                                                         //0x0
    LONG PoolUsage[2];                                                      //0x4
    LONG SessionCount;                                                      //0xc
}; 
//0x38 bytes (sizeof)
struct _ETW_DEBUGID_TRACKING_ENTRY
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    UCHAR ConsumersNotified;                                                //0x10
    UCHAR Spare[3];                                                         //0x11
    ULONG DebugIdSize;                                                      //0x14
    union _CVDD DebugId;                                                    //0x18
};
//0x30 bytes (sizeof)
struct _ETW_DECODE_CONTROL_ENTRY
{
    struct _ETW_DECODE_CONTROL_ENTRY* Next;                                 //0x0
    struct _GUID Decode;                                                    //0x8
    struct _GUID Control;                                                   //0x18
    UCHAR ConsumersNotified;                                                //0x28
}; 
//0x0 bytes (sizeof)
struct _ETW_EVENT_CALLBACK_CONTEXT; 
//0x28 bytes (sizeof)
struct _ETW_FILTER_EVENT_NAME_DATA
{
    UCHAR FilterIn;                                                         //0x0
    UCHAR Level;                                                            //0x1
    ULONGLONG MatchAnyKeyword;                                              //0x8
    ULONGLONG MatchAllKeyword;                                              //0x10
    struct _RTL_HASH_TABLE NameTable;                                       //0x18
}; 
//0x68 bytes (sizeof)
struct _ETW_FILTER_HEADER
{
    LONG FilterFlags;                                                       //0x0
    struct _ETW_FILTER_PID* PidFilter;                                      //0x8
    struct _ETW_FILTER_STRING_TOKEN* ExeFilter;                             //0x10
    struct _ETW_FILTER_STRING_TOKEN* PkgIdFilter;                           //0x18
    struct _ETW_FILTER_STRING_TOKEN* PkgAppIdFilter;                        //0x20
    struct _ETW_FILTER_STRING_TOKEN* ContainerFilter;                       //0x28
    struct _ETW_PERFECT_HASH_FUNCTION* StackWalkIdFilter;                   //0x30
    struct _ETW_FILTER_EVENT_NAME_DATA* StackWalkNameFilter;                //0x38
    struct _EVENT_FILTER_LEVEL_KW* StackWalkLevelKwFilter;                  //0x40
    struct _ETW_PERFECT_HASH_FUNCTION* EventIdFilter;                       //0x48
    struct _ETW_PAYLOAD_FILTER* PayloadFilter;                              //0x50
    struct _EVENT_FILTER_HEADER* ProviderSideFilter;                        //0x58
    struct _ETW_FILTER_EVENT_NAME_DATA* EventNameFilter;                    //0x60
}; 
//0x24 bytes (sizeof)
struct _ETW_FILTER_PID
{
    ULONG Count;                                                            //0x0
    ULONG Pids[8];                                                          //0x4
}; 
//0x18 bytes (sizeof)
struct _ETW_FILTER_STRING_TOKEN
{
    USHORT Count;                                                           //0x0
    struct _ETW_FILTER_STRING_TOKEN_ELEMENT Tokens[1];                      //0x8
}; 
//0x10 bytes (sizeof)
struct _ETW_FILTER_STRING_TOKEN_ELEMENT
{
    USHORT Length;                                                          //0x0
    WCHAR* String;                                                          //0x8
}; 
//0x1a8 bytes (sizeof)
struct _ETW_GUID_ENTRY
{
    struct _LIST_ENTRY GuidList;                                            //0x0
    struct _LIST_ENTRY SiloGuidList;                                        //0x10
    volatile LONGLONG RefCount;                                             //0x20
    struct _GUID Guid;                                                      //0x28
    struct _LIST_ENTRY RegListHead;                                         //0x38
    VOID* SecurityDescriptor;                                               //0x48
    union
    {
        struct _ETW_LAST_ENABLE_INFO LastEnable;                            //0x50
        ULONGLONG MatchId;                                                  //0x50
    };
    struct _TRACE_ENABLE_INFO ProviderEnableInfo;                           //0x60
    struct _TRACE_ENABLE_INFO EnableInfo[8];                                //0x80
    struct _ETW_FILTER_HEADER* FilterData;                                  //0x180
    struct _ETW_SILODRIVERSTATE* SiloState;                                 //0x188
    struct _ETW_GUID_ENTRY* HostEntry;                                      //0x190
    struct _EX_PUSH_LOCK Lock;                                              //0x198
    struct _ETHREAD* LockOwner;                                             //0x1a0
}; 
//0x38 bytes (sizeof)
struct _ETW_HASH_BUCKET
{
    struct _LIST_ENTRY ListHead[3];                                         //0x0
    struct _EX_PUSH_LOCK BucketLock;                                        //0x30
}; 
//0x18 bytes (sizeof)
struct _ETW_HW_TRACE_EXT_INTERFACE
{
    LONG (*StartProcessorTraceOnEachCore)(ULONGLONG arg1, VOID** arg2);     //0x0
    LONG (*StopProcessorTraceOnEachCore)(VOID* arg1);                       //0x8
    LONG (*LogProcessorTraceOnCurrentCore)(VOID* arg1, VOID* arg2);         //0x10
}; 
//0x28 bytes (sizeof)
struct _ETW_IPT_SUPPORT
{
    VOID* IptHandle;                                                        //0x0
    ULONGLONG IptOption;                                                    //0x8
    struct _ETW_HW_TRACE_EXT_INTERFACE* EtwHwTraceExtInterface;             //0x10
    volatile ULONG HookIdCount;                                             //0x18
    USHORT HookId[4];                                                       //0x1c
}; 
//0x10 bytes (sizeof)
struct _ETW_LAST_ENABLE_INFO
{
    union _LARGE_INTEGER EnableFlags;                                       //0x0
    USHORT LoggerId;                                                        //0x8
    UCHAR Level;                                                            //0xa
    UCHAR Enabled:1;                                                        //0xb
    UCHAR InternalFlag:7;                                                   //0xb
}; 
//0x14 bytes (sizeof)
struct _ETW_LBR_SUPPORT
{
    ULONG LbrHandle;                                                        //0x0
    ULONG LbrOptions;                                                       //0x4
    volatile ULONG HookIdCount;                                             //0x8
    USHORT HookId[4];                                                       //0xc
}; 
//0x1 bytes (sizeof)
struct _ETW_LOGGER_HANDLE
{
    UCHAR DereferenceAndLeave;                                              //0x0
};
//0x8 bytes (sizeof)
struct _ETW_PARTITION_CONTEXT
{
    struct _EPARTITION* Partition;                                          //0x0
}; 
//0x58 bytes (sizeof)
struct _ETW_PAYLOAD_FILTER
{
    LONG RefCount;                                                          //0x0
    struct _AGGREGATED_PAYLOAD_FILTER PayloadFilter;                        //0x8
}; 
//0x0 bytes (sizeof)
struct _ETW_PERFECT_HASH_FUNCTION; 
//0x18 bytes (sizeof)
struct _ETW_PERF_COUNTERS
{
    LONG TotalActiveSessions;                                               //0x0
    LONG TotalBufferMemoryNonPagedPool;                                     //0x4
    LONG TotalBufferMemoryPagedPool;                                        //0x8
    LONG TotalGuidsEnabled;                                                 //0xc
    LONG TotalGuidsNotEnabled;                                              //0x10
    LONG TotalGuidsPreEnabled;                                              //0x14
};
//0x20 bytes (sizeof)
struct _ETW_PMC_SUPPORT
{
    enum _KPROFILE_SOURCE* Source;                                          //0x0
    volatile ULONG HookIdCount;                                             //0x8
    USHORT HookId[4];                                                       //0xc
    volatile ULONG CountersCount;                                           //0x14
    struct _HAL_PMC_COUNTERS* ProcessorCtrs[1];                             //0x18
}; 
//0x20 bytes (sizeof)
struct _ETW_PRIV_HANDLE_DEMUX_TABLE
{
    struct _RTL_RB_TREE Tree;                                               //0x0
    struct _EX_PUSH_LOCK Lock;                                              //0x10
    USHORT SequenceNumber;                                                  //0x18
}; 
//0x20 bytes (sizeof)
struct _ETW_PROVIDER_TRAITS
{
    struct _RTL_BALANCED_NODE Node;                                         //0x0
    ULONG ReferenceCount;                                                   //0x18
    UCHAR Traits[1];                                                        //0x1c
}; 
//0x38 bytes (sizeof)
struct _ETW_QUEUE_ENTRY
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    struct _ETWP_NOTIFICATION_HEADER* DataBlock;                            //0x10
    struct _ETW_REG_ENTRY* RegEntry;                                        //0x18
    struct _ETW_REG_ENTRY* ReplyObject;                                     //0x20
    VOID* WakeReference;                                                    //0x28
    USHORT RegIndex;                                                        //0x30
    USHORT ReplyIndex;                                                      //0x32
    ULONG Flags;                                                            //0x34
}; 
//0xa0 bytes (sizeof)
struct _ETW_REALTIME_CONSUMER
{
    struct _LIST_ENTRY Links;                                               //0x0
    VOID* ProcessHandle;                                                    //0x10
    struct _EPROCESS* ProcessObject;                                        //0x18
    VOID* NextNotDelivered;                                                 //0x20
    VOID* RealtimeConnectContext;                                           //0x28
    struct _KEVENT* DisconnectEvent;                                        //0x30
    struct _KEVENT* DataAvailableEvent;                                     //0x38
    ULONG* UserBufferCount;                                                 //0x40
    struct _SINGLE_LIST_ENTRY* UserBufferListHead;                          //0x48
    ULONG BuffersLost;                                                      //0x50
    ULONG EmptyBuffersCount;                                                //0x54
    USHORT LoggerId;                                                        //0x58
    union
    {
        UCHAR Flags;                                                        //0x5a
        struct
        {
            UCHAR ShutDownRequested:1;                                      //0x5a
            UCHAR NewBuffersLost:1;                                         //0x5a
            UCHAR Disconnected:1;                                           //0x5a
            UCHAR Notified:1;                                               //0x5a
            UCHAR Wow:1;                                                    //0x5a
        };
    };
    struct _RTL_BITMAP ReservedBufferSpaceBitMap;                           //0x60
    UCHAR* ReservedBufferSpace;                                             //0x70
    ULONG ReservedBufferSpaceSize;                                          //0x78
    ULONG UserPagesAllocated;                                               //0x7c
    ULONG UserPagesReused;                                                  //0x80
    ULONG* EventsLostCount;                                                 //0x88
    ULONG* BuffersLostCount;                                                //0x90
    struct _ETW_SILODRIVERSTATE* SiloState;                                 //0x98
}; 
//0x10 bytes (sizeof)
struct _ETW_REF_CLOCK
{
    union _LARGE_INTEGER StartTime;                                         //0x0
    union _LARGE_INTEGER StartPerfClock;                                    //0x8
}; 
//0x70 bytes (sizeof)
struct _ETW_REG_ENTRY
{
    struct _LIST_ENTRY RegList;                                             //0x0
    struct _LIST_ENTRY GroupRegList;                                        //0x10
    struct _ETW_GUID_ENTRY* GuidEntry;                                      //0x20
    struct _ETW_GUID_ENTRY* GroupEntry;                                     //0x28
    union
    {
        struct _ETW_REPLY_QUEUE* ReplyQueue;                                //0x30
        struct _ETW_QUEUE_ENTRY* ReplySlot[4];                              //0x30
        struct
        {
            VOID* Caller;                                                   //0x30
            ULONG SessionId;                                                //0x38
        };
    };
    union
    {
        struct _EPROCESS* Process;                                          //0x50
        VOID* CallbackContext;                                              //0x50
    };
    VOID* Callback;                                                         //0x58
    USHORT Index;                                                           //0x60
    union
    {
        USHORT Flags;                                                       //0x62
        struct
        {
            USHORT DbgKernelRegistration:1;                                 //0x62
            USHORT DbgUserRegistration:1;                                   //0x62
            USHORT DbgReplyRegistration:1;                                  //0x62
            USHORT DbgClassicRegistration:1;                                //0x62
            USHORT DbgSessionSpaceRegistration:1;                           //0x62
            USHORT DbgModernRegistration:1;                                 //0x62
            USHORT DbgClosed:1;                                             //0x62
            USHORT DbgInserted:1;                                           //0x62
            USHORT DbgWow64:1;                                              //0x62
            USHORT DbgUseDescriptorType:1;                                  //0x62
            USHORT DbgDropProviderTraits:1;                                 //0x62
        };
    };
    UCHAR EnableMask;                                                       //0x64
    UCHAR GroupEnableMask;                                                  //0x65
    UCHAR HostEnableMask;                                                   //0x66
    UCHAR HostGroupEnableMask;                                              //0x67
    struct _ETW_PROVIDER_TRAITS* Traits;                                    //0x68
}; 
//0x48 bytes (sizeof)
struct _ETW_REPLY_QUEUE
{
    struct _KQUEUE Queue;                                                   //0x0
    LONG EventsLost;                                                        //0x40
}; 
//0x18 bytes (sizeof)
struct _ETW_SESSION_PERF_COUNTERS
{
    LONG BufferMemoryPagedPool;                                             //0x0
    LONG BufferMemoryNonPagedPool;                                          //0x4
    ULONGLONG EventsLoggedCount;                                            //0x8
    LONG EventsLost;                                                        //0x10
    LONG NumConsumers;                                                      //0x14
};
//0x1220 bytes (sizeof)
struct _ETW_SILODRIVERSTATE
{
    struct _EJOB* Silo;                                                     //0x0
    struct _ESERVERSILO_GLOBALS* SiloGlobals;                               //0x8
    ULONG MaxLoggers;                                                       //0x10
    struct _ETW_GUID_ENTRY EtwpSecurityProviderGuidEntry;                   //0x18
    struct _EX_RUNDOWN_REF_CACHE_AWARE** EtwpLoggerRundown;                 //0x1c0
    struct _WMI_LOGGER_CONTEXT** EtwpLoggerContext;                         //0x1c8
    struct _ETW_HASH_BUCKET EtwpGuidHashTable[64];                          //0x1d0
    USHORT EtwpSecurityLoggers[8];                                          //0xfd0
    UCHAR EtwpSecurityProviderEnableMask;                                   //0xfe0
    LONG EtwpShutdownInProgress;                                            //0xfe4
    ULONG EtwpSecurityProviderPID;                                          //0xfe8
    struct _ETW_PRIV_HANDLE_DEMUX_TABLE PrivHandleDemuxTable;               //0xff0
    struct _ETW_COUNTERS EtwpCounters;                                      //0x1010
    union _LARGE_INTEGER LogfileBytesWritten;                               //0x1020
    struct _ETW_SILO_TRACING_BLOCK* ProcessorBlocks;                        //0x1028
    struct _EX_WNF_SUBSCRIPTION* ContainerRestoreWnfSubscription;           //0x1030
    struct _GUID PartitionId;                                               //0x1038
    struct _GUID ParentId;                                                  //0x1048
    union _LARGE_INTEGER QpcOffsetFromRoot;                                 //0x1058
    CHAR* PartitionName;                                                    //0x1060
    USHORT PartitionNameSize;                                               //0x1068
    USHORT UnusedPadding;                                                   //0x106a
    ULONG PartitionType;                                                    //0x106c
    struct _ETW_SYSTEM_LOGGER_SETTINGS SystemLoggerSettings;                //0x1070
    struct _KMUTANT EtwpStartTraceMutex;                                    //0x11e8
}; 
//0x40 bytes (sizeof)
struct _ETW_SILO_TRACING_BLOCK
{
    struct _EX_FAST_REF* ProcessorBuffers;                                  //0x0
    ULONGLONG* EventsLoggedCount;                                           //0x8
    LONGLONG* QpcDelta;                                                     //0x10
}; 
//0x0 bytes (sizeof)
struct _ETW_SOFT_RESTART_CONTEXT; 
//0x0 bytes (sizeof)
struct _ETW_STACK_CACHE; 
//0x80 bytes (sizeof)
struct _ETW_STACK_TRACE_BLOCK
{
    union _LARGE_INTEGER RelatedTimestamp;                                  //0x0
    struct _ETHREAD* Thread;                                                //0x8
    struct _KDPC StackWalkDpc;                                              //0x10
    union _SLIST_HEADER ApcListHead;                                        //0x50
    struct _ETW_APC_ENTRY* ApcEntry;                                        //0x60
    ULONG ApcEntryCount;                                                    //0x68
    LONG Flags;                                                             //0x6c
    LONG ApcCount;                                                          //0x70
    LONG MaxApcCount;                                                       //0x74
}; 
//0x10 bytes (sizeof)
struct _ETW_SYSTEMTIME
{
    USHORT Year;                                                            //0x0
    USHORT Month;                                                           //0x2
    USHORT DayOfWeek;                                                       //0x4
    USHORT Day;                                                             //0x6
    USHORT Hour;                                                            //0x8
    USHORT Minute;                                                          //0xa
    USHORT Second;                                                          //0xc
    USHORT Milliseconds;                                                    //0xe
};
//0x2 bytes (sizeof)
struct _ETW_SYSTEM_LOGGER
{
    UCHAR LoggerId;                                                         //0x0
    UCHAR ClockType;                                                        //0x1
}; 
//0x174 bytes (sizeof)
struct _ETW_SYSTEM_LOGGER_SETTINGS
{
    struct _ETW_SYSTEM_LOGGER EtwpSystemLogger[8];                          //0x0
    volatile ULONG EtwpActiveSystemLoggers;                                 //0x10
    struct _PERFINFO_GROUPMASK SiloGlobalGroupMask;                         //0x14
    struct _PERFINFO_GROUPMASK EtwpGroupMasks[10];                          //0x34
}; 
//0xf0 bytes (sizeof)
struct _ETW_WMITRACE_WORK
{
    ULONG LoggerId;                                                         //0x0
    ULONG SiloSessionId;                                                    //0x4
    union
    {
        struct
        {
            CHAR LoggerName[65];                                            //0x8
            CHAR FileName[129];                                             //0x49
            ULONG MaximumFileSize;                                          //0xcc
            ULONG MinBuffers;                                               //0xd0
            ULONG MaxBuffers;                                               //0xd4
            ULONG BufferSize;                                               //0xd8
            ULONG Mode;                                                     //0xdc
            ULONG FlushTimer;                                               //0xe0
        };
        struct
        {
            ULONGLONG MatchAny;                                             //0x8
            ULONGLONG MatchAll;                                             //0x10
            ULONG EnableProperty;                                           //0x18
            struct _GUID Guid;                                              //0x1c
            UCHAR Level;                                                    //0x2c
        };
    };
    LONG Status;                                                            //0xe8
};
//0x10 bytes (sizeof)
struct _EVENT_DATA_DESCRIPTOR
{
    ULONGLONG Ptr;                                                          //0x0
    ULONG Size;                                                             //0x8
    union
    {
        ULONG Reserved;                                                     //0xc
        struct
        {
            UCHAR Type;                                                     //0xc
            UCHAR Reserved1;                                                //0xd
            USHORT Reserved2;                                               //0xe
        };
    };
};
//0x10 bytes (sizeof)
struct _EVENT_DESCRIPTOR
{
    USHORT Id;                                                              //0x0
    UCHAR Version;                                                          //0x2
    UCHAR Channel;                                                          //0x3
