#include <windef.h>
#ifndef WINDOWS_10_REDSTONE_3_X64_H
#define WINDOWS_10_REDSTONE_3_X64_H
//0x8 bytes (sizeof)
struct BATTERY_REPORTING_SCALE
{
    ULONG Granularity;                                                      //0x0
    ULONG Capacity;                                                         //0x4
}; 
//0x18 bytes (sizeof)
struct CMP_OFFSET_ARRAY
{
    ULONG FileOffset;                                                       //0x0
    VOID* DataBuffer;                                                       //0x8
    ULONG DataLength;                                                       //0x10
}; 
//0x30 bytes (sizeof)
struct DOCK_INTERFACE
{
    USHORT Size;                                                            //0x0
    USHORT Version;                                                         //0x2
    VOID* Context;                                                          //0x8
    VOID (*InterfaceReference)(VOID* arg1);                                 //0x10
    VOID (*InterfaceDereference)(VOID* arg1);                               //0x18
    ULONG (*ProfileDepartureSetMode)(VOID* arg1, enum PROFILE_DEPARTURE_STYLE arg2); //0x20
    ULONG (*ProfileDepartureUpdate)(VOID* arg1);                            //0x28
}; 
//0x8 bytes (sizeof)
struct LIST_ENTRY32
{
    ULONG Flink;                                                            //0x0
    ULONG Blink;                                                            //0x4
}; 
//0x10 bytes (sizeof)
struct LIST_ENTRY64
{
    ULONGLONG Flink;                                                        //0x0
    ULONGLONG Blink;                                                        //0x8
}; 
//0x4 bytes (sizeof)
struct PEPHANDLE__
{
    LONG unused;                                                            //0x0
}; 
//0xc bytes (sizeof)
struct POWER_ACTION_POLICY
{
    enum POWER_ACTION Action;                                               //0x0
    ULONG Flags;                                                            //0x4
    ULONG EventCode;                                                        //0x8
}; 
//0x3d8 bytes (sizeof)
struct PO_MEMORY_IMAGE
{
    ULONG Signature;                                                        //0x0
    ULONG ImageType;                                                        //0x4
    ULONG CheckSum;                                                         //0x8
    ULONG LengthSelf;                                                       //0xc
    ULONGLONG PageSelf;                                                     //0x10
    ULONG PageSize;                                                         //0x18
    union _LARGE_INTEGER SystemTime;                                        //0x20
    ULONGLONG InterruptTime;                                                //0x28
    ULONGLONG FeatureFlags;                                                 //0x30
    UCHAR HiberFlags;                                                       //0x38
    UCHAR spare[3];                                                         //0x39
    ULONG NoHiberPtes;                                                      //0x3c
    ULONGLONG HiberVa;                                                      //0x40
    ULONG NoFreePages;                                                      //0x48
    ULONG FreeMapCheck;                                                     //0x4c
    ULONG WakeCheck;                                                        //0x50
    ULONGLONG NumPagesForLoader;                                            //0x58
    ULONGLONG FirstSecureRestorePage;                                       //0x60
    ULONGLONG FirstBootRestorePage;                                         //0x68
    ULONGLONG FirstKernelRestorePage;                                       //0x70
    ULONGLONG FirstChecksumRestorePage;                                     //0x78
    ULONGLONG NoChecksumEntries;                                            //0x80
    struct _PO_HIBER_PERF PerfInfo;                                         //0x88
    ULONG FirmwareRuntimeInformationPages;                                  //0x280
    ULONGLONG FirmwareRuntimeInformation[1];                                //0x288
    ULONG SiLogOffset;                                                      //0x290
    ULONG NoBootLoaderLogPages;                                             //0x294
    ULONGLONG BootLoaderLogPages[24];                                       //0x298
    ULONG NotUsed;                                                          //0x358
    ULONG ResumeContextCheck;                                               //0x35c
    ULONG ResumeContextPages;                                               //0x360
    UCHAR Hiberboot;                                                        //0x364
    ULONGLONG HvCr3;                                                        //0x368
    ULONGLONG HvEntryPoint;                                                 //0x370
    ULONGLONG HvReservedTransitionAddress;                                  //0x378
    ULONGLONG HvReservedTransitionAddressSize;                              //0x380
    ULONGLONG BootFlags;                                                    //0x388
    ULONGLONG RestoreProcessorStateRoutine;                                 //0x390
    ULONGLONG HighestPhysicalPage;                                          //0x398
    ULONGLONG BitlockerKeyPfns[4];                                          //0x3a0
    ULONG HardwareSignature;                                                //0x3c0
    union _LARGE_INTEGER SMBiosTablePhysicalAddress;                        //0x3c8
    ULONG SMBiosTableLength;                                                //0x3d0
    UCHAR SMBiosMajorVersion;                                               //0x3d4
    UCHAR SMBiosMinorVersion;                                               //0x3d5
}; 
//0x8 bytes (sizeof)
struct PROCESSOR_IDLESTATE_INFO
{
    ULONG TimeCheck;                                                        //0x0
    UCHAR DemotePercent;                                                    //0x4
    UCHAR PromotePercent;                                                   //0x5
    UCHAR Spare[2];                                                         //0x6
}; 
//0x20 bytes (sizeof)
struct PROCESSOR_IDLESTATE_POLICY
{
    USHORT Revision;                                                        //0x0
    union
    {
        USHORT AsUSHORT;                                                    //0x2
        USHORT AllowScaling:1;                                              //0x2
        USHORT Disabled:1;                                                  //0x2
        USHORT Reserved:14;                                                 //0x2
    } Flags;                                                                //0x2
    ULONG PolicyCount;                                                      //0x4
    struct PROCESSOR_IDLESTATE_INFO Policy[3];                              //0x8
};
//0x1c bytes (sizeof)
struct PROCESSOR_PERFSTATE_POLICY
{
    ULONG Revision;                                                         //0x0
    UCHAR MaxThrottle;                                                      //0x4
    UCHAR MinThrottle;                                                      //0x5
    UCHAR BusyAdjThreshold;                                                 //0x6
    union
    {
        UCHAR Spare;                                                        //0x7
        union
        {
            UCHAR AsUCHAR;                                                  //0x7
            UCHAR NoDomainAccounting:1;                                     //0x7
            UCHAR IncreasePolicy:2;                                         //0x7
            UCHAR DecreasePolicy:2;                                         //0x7
            UCHAR Reserved:3;                                               //0x7
        } Flags;                                                            //0x7
    };
    ULONG TimeCheck;                                                        //0x8
    ULONG IncreaseTime;                                                     //0xc
    ULONG DecreaseTime;                                                     //0x10
    ULONG IncreasePercent;                                                  //0x14
    ULONG DecreasePercent;                                                  //0x18
};
//0x4c bytes (sizeof)
struct SYSTEM_POWER_CAPABILITIES
{
    UCHAR PowerButtonPresent;                                               //0x0
    UCHAR SleepButtonPresent;                                               //0x1
    UCHAR LidPresent;                                                       //0x2
    UCHAR SystemS1;                                                         //0x3
    UCHAR SystemS2;                                                         //0x4
    UCHAR SystemS3;                                                         //0x5
    UCHAR SystemS4;                                                         //0x6
    UCHAR SystemS5;                                                         //0x7
    UCHAR HiberFilePresent;                                                 //0x8
    UCHAR FullWake;                                                         //0x9
    UCHAR VideoDimPresent;                                                  //0xa
    UCHAR ApmPresent;                                                       //0xb
    UCHAR UpsPresent;                                                       //0xc
    UCHAR ThermalControl;                                                   //0xd
    UCHAR ProcessorThrottle;                                                //0xe
    UCHAR ProcessorMinThrottle;                                             //0xf
    UCHAR ProcessorMaxThrottle;                                             //0x10
    UCHAR FastSystemS4;                                                     //0x11
    UCHAR Hiberboot;                                                        //0x12
    UCHAR WakeAlarmPresent;                                                 //0x13
    UCHAR AoAc;                                                             //0x14
    UCHAR DiskSpinDown;                                                     //0x15
    UCHAR HiberFileType;                                                    //0x16
    UCHAR AoAcConnectivitySupported;                                        //0x17
    UCHAR spare3[6];                                                        //0x18
    UCHAR SystemBatteriesPresent;                                           //0x1e
    UCHAR BatteriesAreShortTerm;                                            //0x1f
    struct BATTERY_REPORTING_SCALE BatteryScale[3];                         //0x20
    enum _SYSTEM_POWER_STATE AcOnLineWake;                                  //0x38
    enum _SYSTEM_POWER_STATE SoftLidWake;                                   //0x3c
    enum _SYSTEM_POWER_STATE RtcWake;                                       //0x40
    enum _SYSTEM_POWER_STATE MinDeviceWakeState;                            //0x44
    enum _SYSTEM_POWER_STATE DefaultLowLatencyWake;                         //0x48
}; 
//0x18 bytes (sizeof)
struct SYSTEM_POWER_LEVEL
{
    UCHAR Enable;                                                           //0x0
    UCHAR Spare[3];                                                         //0x1
    ULONG BatteryLevel;                                                     //0x4
    struct POWER_ACTION_POLICY PowerPolicy;                                 //0x8
    enum _SYSTEM_POWER_STATE MinSystemState;                                //0x14
}; 
//0x20 bytes (sizeof)
struct VACB_LEVEL_ALLOCATION_LIST
{
    struct _LIST_ENTRY VacbLevelList;                                       //0x0
    VOID* VacbLevelWithBcbListHeads;                                        //0x10
    ULONG VacbLevelsAllocated;                                              //0x18
};
//0x80 bytes (sizeof)
struct _ACCESS_REASONS
{
    ULONG Data[32];                                                         //0x0
}; 
//0xa0 bytes (sizeof)
struct _ACCESS_STATE
{
    struct _LUID OperationID;                                               //0x0
    UCHAR SecurityEvaluated;                                                //0x8
    UCHAR GenerateAudit;                                                    //0x9
    UCHAR GenerateOnClose;                                                  //0xa
    UCHAR PrivilegesAllocated;                                              //0xb
    ULONG Flags;                                                            //0xc
    ULONG RemainingDesiredAccess;                                           //0x10
    ULONG PreviouslyGrantedAccess;                                          //0x14
    ULONG OriginalDesiredAccess;                                            //0x18
    struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext;                //0x20
    VOID* SecurityDescriptor;                                               //0x40
    VOID* AuxData;                                                          //0x48
    union
    {
        struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;                  //0x50
        struct _PRIVILEGE_SET PrivilegeSet;                                 //0x50
    } Privileges;                                                           //0x50
    UCHAR AuditPrivileges;                                                  //0x7c
    struct _UNICODE_STRING ObjectName;                                      //0x80
    struct _UNICODE_STRING ObjectTypeName;                                  //0x90
}; 
//0x8 bytes (sizeof)
struct _ACL
{
    UCHAR AclRevision;                                                      //0x0
    UCHAR Sbz1;                                                             //0x1
    USHORT AclSize;                                                         //0x2
    USHORT AceCount;                                                        //0x4
    USHORT Sbz2;                                                            //0x6
}; 
//0x0 bytes (sizeof)
struct _ACTIVATION_CONTEXT; 
//0x0 bytes (sizeof)
struct _ACTIVATION_CONTEXT_DATA; 
//0x28 bytes (sizeof)
struct _ACTIVATION_CONTEXT_STACK
{
    struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* ActiveFrame;                //0x0
    struct _LIST_ENTRY FrameListCache;                                      //0x8
    ULONG Flags;                                                            //0x18
    ULONG NextCookieSequenceNumber;                                         //0x1c
    ULONG StackId;                                                          //0x20
}; 
//0x18 bytes (sizeof)
struct _ACTIVATION_CONTEXT_STACK32
{
    ULONG ActiveFrame;                                                      //0x0
    struct LIST_ENTRY32 FrameListCache;                                     //0x4
    ULONG Flags;                                                            //0xc
    ULONG NextCookieSequenceNumber;                                         //0x10
    ULONG StackId;                                                          //0x14
}; 
//0x28 bytes (sizeof)
struct _ACTIVATION_CONTEXT_STACK64
{
    ULONGLONG ActiveFrame;                                                  //0x0
    struct LIST_ENTRY64 FrameListCache;                                     //0x8
    ULONG Flags;                                                            //0x18
    ULONG NextCookieSequenceNumber;                                         //0x1c
    ULONG StackId;                                                          //0x20
}; 
//0x0 bytes (sizeof)
struct _ADAPTER_OBJECT; 
//0x50 bytes (sizeof)
struct _AGGREGATED_PAYLOAD_FILTER
{
    USHORT MagicValue:12;                                                   //0x0
    USHORT DescriptorVersion:4;                                             //0x0
    USHORT Size;                                                            //0x2
    USHORT PredicateCount;                                                  //0x4
    USHORT Reserved;                                                        //0x6
    ULONGLONG HashedEventIdBitmap;                                          //0x8
    struct _GUID ProviderGuid;                                              //0x10
    USHORT EachEventTableOffset;                                            //0x20
    USHORT EachEventTableLength;                                            //0x22
    USHORT PayloadDecoderTableOffset;                                       //0x24
    USHORT PayloadDecoderTableLength;                                       //0x26
    USHORT EventFilterTableOffset;                                          //0x28
    USHORT EventFilterTableLength;                                          //0x2a
    USHORT UNICODEStringTableOffset;                                        //0x2c
    USHORT UNICODEStringTableLength;                                        //0x2e
    USHORT ANSIStringTableOffset;                                           //0x30
    USHORT ANSIStringTableLength;                                           //0x32
    struct _EVENT_PAYLOAD_PREDICATE PredicateTable[1];                      //0x38
}; 
//0x48 bytes (sizeof)
struct _ALPC_COMMUNICATION_INFO
{
    struct _ALPC_PORT* ConnectionPort;                                      //0x0
    struct _ALPC_PORT* ServerCommunicationPort;                             //0x8
    struct _ALPC_PORT* ClientCommunicationPort;                             //0x10
    struct _LIST_ENTRY CommunicationList;                                   //0x18
    struct _ALPC_HANDLE_TABLE HandleTable;                                  //0x28
    struct _KALPC_MESSAGE* CloseMessage;                                    //0x40
}; 
//0xa0 bytes (sizeof)
struct _ALPC_COMPLETION_LIST
{
    struct _LIST_ENTRY Entry;                                               //0x0
    struct _EPROCESS* OwnerProcess;                                         //0x10
    struct _EX_PUSH_LOCK CompletionListLock;                                //0x18
    struct _MDL* Mdl;                                                       //0x20
    VOID* UserVa;                                                           //0x28
    VOID* UserLimit;                                                        //0x30
    VOID* DataUserVa;                                                       //0x38
    VOID* SystemVa;                                                         //0x40
    ULONGLONG TotalSize;                                                    //0x48
    struct _ALPC_COMPLETION_LIST_HEADER* Header;                            //0x50
    VOID* List;                                                             //0x58
    ULONGLONG ListSize;                                                     //0x60
    VOID* Bitmap;                                                           //0x68
    ULONGLONG BitmapSize;                                                   //0x70
    VOID* Data;                                                             //0x78
    ULONGLONG DataSize;                                                     //0x80
    ULONG BitmapLimit;                                                      //0x88
    ULONG BitmapNextHint;                                                   //0x8c
    ULONG ConcurrencyCount;                                                 //0x90
    ULONG AttributeFlags;                                                   //0x94
    ULONG AttributeSize;                                                    //0x98
}; 
//0x180 bytes (sizeof)
struct _ALPC_COMPLETION_LIST_HEADER
{
    ULONGLONG StartMagic;                                                   //0x0
    ULONG TotalSize;                                                        //0x8
    ULONG ListOffset;                                                       //0xc
    ULONG ListSize;                                                         //0x10
    ULONG BitmapOffset;                                                     //0x14
    ULONG BitmapSize;                                                       //0x18
    ULONG DataOffset;                                                       //0x1c
    ULONG DataSize;                                                         //0x20
    ULONG AttributeFlags;                                                   //0x24
    ULONG AttributeSize;                                                    //0x28
    volatile struct _ALPC_COMPLETION_LIST_STATE State;                      //0x40
    volatile ULONG LastMessageId;                                           //0x48
    volatile ULONG LastCallbackId;                                          //0x4c
    volatile ULONG PostCount;                                               //0x80
    volatile ULONG ReturnCount;                                             //0xc0
    volatile ULONG LogSequenceNumber;                                       //0x100
    struct _RTL_SRWLOCK UserLock;                                           //0x140
    ULONGLONG EndMagic;                                                     //0x148
}; 
//0x8 bytes (sizeof)
struct _ALPC_COMPLETION_LIST_STATE
{
    union
    {
        struct
        {
            ULONGLONG Head:24;                                              //0x0
            ULONGLONG Tail:24;                                              //0x0
            ULONGLONG ActiveThreadCount:16;                                 //0x0
        } s1;                                                               //0x0
        LONGLONG Value;                                                     //0x0
    } u1;                                                                   //0x0
}; 
//0x50 bytes (sizeof)
struct _ALPC_COMPLETION_PACKET_LOOKASIDE
{
    ULONGLONG Lock;                                                         //0x0
    ULONG Size;                                                             //0x8
    ULONG ActiveCount;                                                      //0xc
    ULONG PendingNullCount;                                                 //0x10
    ULONG PendingCheckCompletionListCount;                                  //0x14
    ULONG PendingDelete;                                                    //0x18
    struct _SINGLE_LIST_ENTRY FreeListHead;                                 //0x20
    VOID* CompletionPort;                                                   //0x28
    VOID* CompletionKey;                                                    //0x30
    struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY Entry[1];                //0x38
}; 
//0x18 bytes (sizeof)
struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY
{
    struct _SINGLE_LIST_ENTRY ListEntry;                                    //0x0
    struct _IO_MINI_COMPLETION_PACKET_USER* Packet;                         //0x8
    struct _ALPC_COMPLETION_PACKET_LOOKASIDE* Lookaside;                    //0x10
}; 
//0x40 bytes (sizeof)
struct _ALPC_DISPATCH_CONTEXT
{
    struct _ALPC_PORT* PortObject;                                          //0x0
    struct _KALPC_MESSAGE* Message;                                         //0x8
    struct _ALPC_COMMUNICATION_INFO* CommunicationInfo;                     //0x10
    struct _ETHREAD* TargetThread;                                          //0x18
    struct _ALPC_PORT* TargetPort;                                          //0x20
    union _KALPC_DIRECT_EVENT DirectEvent;                                  //0x28
    ULONG Flags;                                                            //0x30
    USHORT TotalLength;                                                     //0x34
    USHORT Type;                                                            //0x36
    USHORT DataInfoOffset;                                                  //0x38
    UCHAR SignalCompletion;                                                 //0x3a
    UCHAR PostedToCompletionList;                                           //0x3b
};
//0x8 bytes (sizeof)
struct _ALPC_HANDLE_ENTRY
{
    VOID* Object;                                                           //0x0
}; 
//0x18 bytes (sizeof)
struct _ALPC_HANDLE_TABLE
{
    struct _ALPC_HANDLE_ENTRY* Handles;                                     //0x0
    ULONG TotalHandles;                                                     //0x8
    ULONG Flags;                                                            //0xc
    struct _EX_PUSH_LOCK Lock;                                              //0x10
}; 
//0x8 bytes (sizeof)
struct _ALPC_MESSAGE_ATTRIBUTES
{
    ULONG AllocatedAttributes;                                              //0x0
    ULONG ValidAttributes;                                                  //0x4
};
//0x1d8 bytes (sizeof)
struct _ALPC_PORT
{
    struct _LIST_ENTRY PortListEntry;                                       //0x0
    struct _ALPC_COMMUNICATION_INFO* CommunicationInfo;                     //0x10
    struct _EPROCESS* OwnerProcess;                                         //0x18
    VOID* CompletionPort;                                                   //0x20
    VOID* CompletionKey;                                                    //0x28
    struct _ALPC_COMPLETION_PACKET_LOOKASIDE* CompletionPacketLookaside;    //0x30
    VOID* PortContext;                                                      //0x38
    struct _SECURITY_CLIENT_CONTEXT StaticSecurity;                         //0x40
    struct _EX_PUSH_LOCK IncomingQueueLock;                                 //0x88
    struct _LIST_ENTRY MainQueue;                                           //0x90
    struct _LIST_ENTRY LargeMessageQueue;                                   //0xa0
    struct _EX_PUSH_LOCK PendingQueueLock;                                  //0xb0
    struct _LIST_ENTRY PendingQueue;                                        //0xb8
    struct _EX_PUSH_LOCK DirectQueueLock;                                   //0xc8
    struct _LIST_ENTRY DirectQueue;                                         //0xd0
    struct _EX_PUSH_LOCK WaitQueueLock;                                     //0xe0
    struct _LIST_ENTRY WaitQueue;                                           //0xe8
    union
    {
        struct _KSEMAPHORE* Semaphore;                                      //0xf8
        struct _KEVENT* DummyEvent;                                         //0xf8
    };
    struct _ALPC_PORT_ATTRIBUTES PortAttributes;                            //0x100
    struct _EX_PUSH_LOCK ResourceListLock;                                  //0x148
    struct _LIST_ENTRY ResourceListHead;                                    //0x150
    struct _EX_PUSH_LOCK PortObjectLock;                                    //0x160
    struct _ALPC_COMPLETION_LIST* CompletionList;                           //0x168
    struct _CALLBACK_OBJECT* CallbackObject;                                //0x170
    VOID* CallbackContext;                                                  //0x178
    struct _LIST_ENTRY CanceledQueue;                                       //0x180
    LONG SequenceNo;                                                        //0x190
    LONG ReferenceNo;                                                       //0x194
    struct _PALPC_PORT_REFERENCE_WAIT_BLOCK* ReferenceNoWait;               //0x198
    union
    {
        struct
        {
            ULONG Initialized:1;                                            //0x1a0
            ULONG Type:2;                                                   //0x1a0
            ULONG ConnectionPending:1;                                      //0x1a0
            ULONG ConnectionRefused:1;                                      //0x1a0
            ULONG Disconnected:1;                                           //0x1a0
            ULONG Closed:1;                                                 //0x1a0
            ULONG NoFlushOnClose:1;                                         //0x1a0
            ULONG ReturnExtendedInfo:1;                                     //0x1a0
            ULONG Waitable:1;                                               //0x1a0
            ULONG DynamicSecurity:1;                                        //0x1a0
            ULONG Wow64CompletionList:1;                                    //0x1a0
            ULONG Lpc:1;                                                    //0x1a0
            ULONG LpcToLpc:1;                                               //0x1a0
            ULONG HasCompletionList:1;                                      //0x1a0
            ULONG HadCompletionList:1;                                      //0x1a0
            ULONG EnableCompletionList:1;                                   //0x1a0
        } s1;                                                               //0x1a0
        ULONG State;                                                        //0x1a0
    } u1;                                                                   //0x1a0
    struct _ALPC_PORT* TargetQueuePort;                                     //0x1a8
    struct _ALPC_PORT* TargetSequencePort;                                  //0x1b0
    struct _KALPC_MESSAGE* CachedMessage;                                   //0x1b8
    ULONG MainQueueLength;                                                  //0x1c0
    ULONG LargeMessageQueueLength;                                          //0x1c4
    ULONG PendingQueueLength;                                               //0x1c8
    ULONG DirectQueueLength;                                                //0x1cc
    ULONG CanceledQueueLength;                                              //0x1d0
    ULONG WaitQueueLength;                                                  //0x1d4
}; 
//0x48 bytes (sizeof)
struct _ALPC_PORT_ATTRIBUTES
{
    ULONG Flags;                                                            //0x0
    struct _SECURITY_QUALITY_OF_SERVICE SecurityQos;                        //0x4
    ULONGLONG MaxMessageLength;                                             //0x10
    ULONGLONG MemoryBandwidth;                                              //0x18
    ULONGLONG MaxPoolUsage;                                                 //0x20
    ULONGLONG MaxSectionSize;                                               //0x28
    ULONGLONG MaxViewSize;                                                  //0x30
    ULONGLONG MaxTotalSectionSize;                                          //0x38
    ULONG DupObjectTypes;                                                   //0x40
    ULONG Reserved;                                                         //0x44
}; 
//0x20 bytes (sizeof)
struct _ALPC_PROCESS_CONTEXT
{
    struct _EX_PUSH_LOCK Lock;                                              //0x0
    struct _LIST_ENTRY ViewListHead;                                        //0x8
    volatile ULONGLONG PagedPoolQuotaCache;                                 //0x18
}; 
//0x8 bytes (sizeof)
struct _ALPC_WORK_ON_BEHALF_TICKET
{
    ULONG ThreadId;                                                         //0x0
    ULONG ThreadCreationTimeLow;                                            //0x4
}; 
//0x1c bytes (sizeof)
struct _AMD64_DBGKD_CONTROL_SET
{
    ULONG TraceFlag;                                                        //0x0
    ULONGLONG Dr7;                                                          //0x4
    ULONGLONG CurrentSymbolStart;                                           //0xc
    ULONGLONG CurrentSymbolEnd;                                             //0x14
}; 
//0x8 bytes (sizeof)
struct _ARBITER_ADD_RESERVED_PARAMETERS
{
    struct _DEVICE_OBJECT* ReserveDevice;                                   //0x0
}; 
//0x50 bytes (sizeof)
struct _ARBITER_ALLOCATION_STATE
{
    ULONGLONG Start;                                                        //0x0
    ULONGLONG End;                                                          //0x8
    ULONGLONG CurrentMinimum;                                               //0x10
    ULONGLONG CurrentMaximum;                                               //0x18
    struct _ARBITER_LIST_ENTRY* Entry;                                      //0x20
    struct _ARBITER_ALTERNATIVE* CurrentAlternative;                        //0x28
    ULONG AlternativeCount;                                                 //0x30
    struct _ARBITER_ALTERNATIVE* Alternatives;                              //0x38
    USHORT Flags;                                                           //0x40
    UCHAR RangeAttributes;                                                  //0x42
    UCHAR RangeAvailableAttributes;                                         //0x43
    ULONGLONG WorkSpace;                                                    //0x48
}; 
//0x40 bytes (sizeof)
struct _ARBITER_ALTERNATIVE
{
    ULONGLONG Minimum;                                                      //0x0
    ULONGLONG Maximum;                                                      //0x8
    ULONGLONG Length;                                                       //0x10
    ULONGLONG Alignment;                                                    //0x18
    LONG Priority;                                                          //0x20
    ULONG Flags;                                                            //0x24
    struct _IO_RESOURCE_DESCRIPTOR* Descriptor;                             //0x28
    ULONG Reserved[3];                                                      //0x30
}; 
//0x8 bytes (sizeof)
struct _ARBITER_BOOT_ALLOCATION_PARAMETERS
{
    struct _LIST_ENTRY* ArbitrationList;                                    //0x0
}; 
//0x18 bytes (sizeof)
struct _ARBITER_CONFLICT_INFO
{
    struct _DEVICE_OBJECT* OwningObject;                                    //0x0
    ULONGLONG Start;                                                        //0x8
    ULONGLONG End;                                                          //0x10
}; 
//0x150 bytes (sizeof)
struct _ARBITER_INSTANCE
{
    ULONG Signature;                                                        //0x0
    struct _KEVENT* MutexEvent;                                             //0x8
    WCHAR* Name;                                                            //0x10
    WCHAR* OrderingName;                                                    //0x18
    LONG ResourceType;                                                      //0x20
    struct _RTL_RANGE_LIST* Allocation;                                     //0x28
    struct _RTL_RANGE_LIST* PossibleAllocation;                             //0x30
    struct _ARBITER_ORDERING_LIST OrderingList;                             //0x38
    struct _ARBITER_ORDERING_LIST ReservedList;                             //0x48
    LONG ReferenceCount;                                                    //0x58
    struct _ARBITER_INTERFACE* Interface;                                   //0x60
    ULONG AllocationStackMaxSize;                                           //0x68
    struct _ARBITER_ALLOCATION_STATE* AllocationStack;                      //0x70
    LONG (*UnpackRequirement)(struct _IO_RESOURCE_DESCRIPTOR* arg1, ULONGLONG* arg2, ULONGLONG* arg3, ULONGLONG* arg4, ULONGLONG* arg5); //0x78
    LONG (*PackResource)(struct _IO_RESOURCE_DESCRIPTOR* arg1, ULONGLONG arg2, struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* arg3); //0x80
    LONG (*UnpackResource)(struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* arg1, ULONGLONG* arg2, ULONGLONG* arg3); //0x88
    LONG (*ScoreRequirement)(struct _IO_RESOURCE_DESCRIPTOR* arg1);         //0x90
    LONG (*TestAllocation)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_TEST_ALLOCATION_PARAMETERS* arg2); //0x98
    LONG (*RetestAllocation)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_RETEST_ALLOCATION_PARAMETERS* arg2); //0xa0
    LONG (*CommitAllocation)(struct _ARBITER_INSTANCE* arg1);               //0xa8
    LONG (*RollbackAllocation)(struct _ARBITER_INSTANCE* arg1);             //0xb0
    LONG (*BootAllocation)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_BOOT_ALLOCATION_PARAMETERS* arg2); //0xb8
    LONG (*QueryArbitrate)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_QUERY_ARBITRATE_PARAMETERS* arg2); //0xc0
    LONG (*QueryConflict)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_QUERY_CONFLICT_PARAMETERS* arg2); //0xc8
    LONG (*AddReserved)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ADD_RESERVED_PARAMETERS* arg2); //0xd0
    LONG (*StartArbiter)(struct _ARBITER_INSTANCE* arg1, struct _CM_RESOURCE_LIST* arg2); //0xd8
    LONG (*PreprocessEntry)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0xe0
    LONG (*AllocateEntry)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0xe8
    UCHAR (*GetNextAllocationRange)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0xf0
    UCHAR (*FindSuitableRange)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0xf8
    VOID (*AddAllocation)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0x100
    VOID (*BacktrackAllocation)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0x108
    UCHAR (*OverrideConflict)(struct _ARBITER_INSTANCE* arg1, struct _ARBITER_ALLOCATION_STATE* arg2); //0x110
    LONG (*InitializeRangeList)(struct _ARBITER_INSTANCE* arg1, ULONG arg2, struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* arg3, struct _RTL_RANGE_LIST* arg4); //0x118
    UCHAR TransactionInProgress;                                            //0x120
    struct _KEVENT* TransactionEvent;                                       //0x128
    VOID* Extension;                                                        //0x130
    struct _DEVICE_OBJECT* BusDeviceObject;                                 //0x138
    VOID* ConflictCallbackContext;                                          //0x140
    UCHAR (*ConflictCallback)(VOID* arg1, struct _RTL_RANGE* arg2);         //0x148
}; 
//0x30 bytes (sizeof)
struct _ARBITER_INTERFACE
{
    USHORT Size;                                                            //0x0
    USHORT Version;                                                         //0x2
    VOID* Context;                                                          //0x8
    VOID (*InterfaceReference)(VOID* arg1);                                 //0x10
    VOID (*InterfaceDereference)(VOID* arg1);                               //0x18
    LONG (*ArbiterHandler)(VOID* arg1, enum _ARBITER_ACTION arg2, struct _ARBITER_PARAMETERS* arg3); //0x20
    ULONG Flags;                                                            //0x28
}; 
//0x60 bytes (sizeof)
struct _ARBITER_LIST_ENTRY
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    ULONG AlternativeCount;                                                 //0x10
    struct _IO_RESOURCE_DESCRIPTOR* Alternatives;                           //0x18
    struct _DEVICE_OBJECT* PhysicalDeviceObject;                            //0x20
    enum _ARBITER_REQUEST_SOURCE RequestSource;                             //0x28
    ULONG Flags;                                                            //0x2c
    LONGLONG WorkSpace;                                                     //0x30
    enum _INTERFACE_TYPE InterfaceType;                                     //0x38
    ULONG SlotNumber;                                                       //0x3c
    ULONG BusNumber;                                                        //0x40
    struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* Assignment;                     //0x48
    struct _IO_RESOURCE_DESCRIPTOR* SelectedAlternative;                    //0x50
    enum _ARBITER_RESULT Result;                                            //0x58
}; 
//0x10 bytes (sizeof)
struct _ARBITER_ORDERING
{
    ULONGLONG Start;                                                        //0x0
    ULONGLONG End;                                                          //0x8
}; 
//0x10 bytes (sizeof)
struct _ARBITER_ORDERING_LIST
{
    USHORT Count;                                                           //0x0
    USHORT Maximum;                                                         //0x2
    struct _ARBITER_ORDERING* Orderings;                                    //0x8
}; 
//0x20 bytes (sizeof)
struct _ARBITER_PARAMETERS
{
    union
    {
        struct _ARBITER_TEST_ALLOCATION_PARAMETERS TestAllocation;          //0x0
        struct _ARBITER_RETEST_ALLOCATION_PARAMETERS RetestAllocation;      //0x0
        struct _ARBITER_BOOT_ALLOCATION_PARAMETERS BootAllocation;          //0x0
        struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS QueryAllocatedResources; //0x0
        struct _ARBITER_QUERY_CONFLICT_PARAMETERS QueryConflict;            //0x0
        struct _ARBITER_QUERY_ARBITRATE_PARAMETERS QueryArbitrate;          //0x0
        struct _ARBITER_ADD_RESERVED_PARAMETERS AddReserved;                //0x0
    } Parameters;                                                           //0x0
}; 
//0x8 bytes (sizeof)
struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS
{
    struct _CM_PARTIAL_RESOURCE_LIST** AllocatedResources;                  //0x0
}; 
//0x8 bytes (sizeof)
struct _ARBITER_QUERY_ARBITRATE_PARAMETERS
{
    struct _LIST_ENTRY* ArbitrationList;                                    //0x0
}; 
//0x20 bytes (sizeof)
struct _ARBITER_QUERY_CONFLICT_PARAMETERS
{
    struct _DEVICE_OBJECT* PhysicalDeviceObject;                            //0x0
    struct _IO_RESOURCE_DESCRIPTOR* ConflictingResource;                    //0x8
    ULONG* ConflictCount;                                                   //0x10
    struct _ARBITER_CONFLICT_INFO** Conflicts;                              //0x18
}; 
//0x18 bytes (sizeof)
struct _ARBITER_RETEST_ALLOCATION_PARAMETERS
{
    struct _LIST_ENTRY* ArbitrationList;                                    //0x0
    ULONG AllocateFromCount;                                                //0x8
    struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;                   //0x10
}; 
//0x18 bytes (sizeof)
struct _ARBITER_TEST_ALLOCATION_PARAMETERS
{
    struct _LIST_ENTRY* ArbitrationList;                                    //0x0
    ULONG AllocateFromCount;                                                //0x8
    struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;                   //0x10
}; 
//0x18 bytes (sizeof)
struct _ARM64_DBGKD_CONTROL_SET
{
    ULONG Continue;                                                         //0x0
    ULONG TraceFlag;                                                        //0x4
    ULONGLONG CurrentSymbolStart;                                           //0x8
    ULONGLONG CurrentSymbolEnd;                                             //0x10
}; 
//0xc bytes (sizeof)
struct _ARMCE_DBGKD_CONTROL_SET
{
    ULONG Continue;                                                         //0x0
    ULONG CurrentSymbolStart;                                               //0x4
    ULONG CurrentSymbolEnd;                                                 //0x8
}; 
//0xc bytes (sizeof)
struct _ARM_DBGKD_CONTROL_SET
{
    ULONG Continue;                                                         //0x0
    ULONG CurrentSymbolStart;                                               //0x4
    ULONG CurrentSymbolEnd;                                                 //0x8
}; 
//0x0 bytes (sizeof)
struct _ASSEMBLY_STORAGE_MAP; 
//0x194 bytes (sizeof)
struct _ASYNC_READ_THREAD_STATS
{
    ULONG CurrentLoad[101];                                                 //0x0
}; 
//0x260 bytes (sizeof)
struct _AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION
{
    ULONG DeviceGroupsCount;                                                //0x0
    struct _SID_AND_ATTRIBUTES* pDeviceGroups;                              //0x8
    ULONG RestrictedDeviceGroupsCount;                                      //0x10
    struct _SID_AND_ATTRIBUTES* pRestrictedDeviceGroups;                    //0x18
    struct _SID_AND_ATTRIBUTES_HASH DeviceGroupsHash;                       //0x20
    struct _SID_AND_ATTRIBUTES_HASH RestrictedDeviceGroupsHash;             //0x130
    struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION* pUserSecurityAttributes; //0x240
    struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION* pDeviceSecurityAttributes; //0x248
    struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION* pRestrictedUserSecurityAttributes; //0x250
    struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION* pRestrictedDeviceSecurityAttributes; //0x258
}; 
//0x30 bytes (sizeof)
struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION
{
    ULONG SecurityAttributeCount;                                           //0x0
    struct _LIST_ENTRY SecurityAttributesList;                              //0x8
    ULONG WorkingSecurityAttributeCount;                                    //0x18
    struct _LIST_ENTRY WorkingSecurityAttributesList;                       //0x20
}; 
//0xe0 bytes (sizeof)
struct _AUX_ACCESS_DATA
{
    struct _PRIVILEGE_SET* PrivilegesUsed;                                  //0x0
    struct _GENERIC_MAPPING GenericMapping;                                 //0x8
    ULONG AccessesToAudit;                                                  //0x18
    ULONG MaximumAuditMask;                                                 //0x1c
    struct _GUID TransactionId;                                             //0x20
    VOID* NewSecurityDescriptor;                                            //0x30
    VOID* ExistingSecurityDescriptor;                                       //0x38
    VOID* ParentSecurityDescriptor;                                         //0x40
    VOID (*DeRefSecurityDescriptor)(VOID* arg1, VOID* arg2);                //0x48
    VOID* SDLock;                                                           //0x50
    struct _ACCESS_REASONS AccessReasons;                                   //0x58
    UCHAR GenerateStagingEvents;                                            //0xd8
};
//0x30 bytes (sizeof)
struct _BITMAP_RANGE
{
    struct _LIST_ENTRY Links;                                               //0x0
    LONGLONG BasePage;                                                      //0x10
    ULONG FirstDirtyPage;                                                   //0x18
    ULONG LastDirtyPage;                                                    //0x1c
    ULONG DirtyPages;                                                       //0x20
    ULONG* Bitmap;                                                          //0x28
}; 
//0x30 bytes (sizeof)
struct _BLOB
{
    union
    {
        struct _LIST_ENTRY ResourceList;                                    //0x0
        struct _SLIST_ENTRY FreeListEntry;                                  //0x0
    };
    union
    {
        struct
        {
            UCHAR ReferenceCache:1;                                         //0x10
            UCHAR Lookaside:1;                                              //0x10
            UCHAR Initializing:1;                                           //0x10
            UCHAR Deleted:1;                                                //0x10
        } s1;                                                               //0x10
        UCHAR Flags;                                                        //0x10
    } u1;                                                                   //0x10
    UCHAR ResourceId;                                                       //0x11
    SHORT CachedReferences;                                                 //0x12
    LONGLONG ReferenceCount;                                                //0x18
    struct _EX_PUSH_LOCK Lock;                                              //0x20
};
//0x8 bytes (sizeof)
struct _BLOB_COUNTERS
{
    ULONG CreatedObjects;                                                   //0x0
    ULONG DeletedObjects;                                                   //0x4
}; 
//0x30 bytes (sizeof)
struct _BLOB_TYPE
{
    enum _BLOB_ID ResourceId;                                               //0x0
    ULONG PoolTag;                                                          //0x4
    ULONG LookasideIndex;                                                   //0x8
    ULONG Flags;                                                            //0xc
    struct _BLOB_COUNTERS* Counters;                                        //0x10
    VOID (*DeleteProcedure)(VOID* arg1);                                    //0x18
    LONG (*DestroyProcedure)(VOID* arg1);                                   //0x20
    ULONGLONG UsualSize;                                                    //0x28
};
//0x10 bytes (sizeof)
struct _BUS_EXTENSION_LIST
{
    VOID* Next;                                                             //0x0
    struct _PI_BUS_EXTENSION* BusExtension;                                 //0x8
};
//0x10 bytes (sizeof)
struct _CACHED_CHILD_LIST
{
    ULONG Count;                                                            //0x0
    union
    {
        ULONGLONG ValueList;                                                //0x8
        struct _CM_KEY_CONTROL_BLOCK* RealKcb;                              //0x8
    };
}; 
//0x20 bytes (sizeof)
struct _CACHED_KSTACK_LIST
{
    union _SLIST_HEADER SListHead;                                          //0x0
    LONG MinimumFree;                                                       //0x10
    ULONG Misses;                                                           //0x14
    ULONG MissesLast;                                                       //0x18
    ULONG AllStacksInUse;                                                   //0x1c
}; 
//0xc bytes (sizeof)
struct _CACHE_DESCRIPTOR
{
    UCHAR Level;                                                            //0x0
    UCHAR Associativity;                                                    //0x1
    USHORT LineSize;                                                        //0x2
    ULONG Size;                                                             //0x4
    enum _PROCESSOR_CACHE_TYPE Type;                                        //0x8
}; 
//0x20 bytes (sizeof)
struct _CACHE_MANAGER_CALLBACKS
{
    UCHAR (*AcquireForLazyWrite)(VOID* arg1, UCHAR arg2);                   //0x0
    VOID (*ReleaseFromLazyWrite)(VOID* arg1);                               //0x8
    UCHAR (*AcquireForReadAhead)(VOID* arg1, UCHAR arg2);                   //0x10
    VOID (*ReleaseFromReadAhead)(VOID* arg1);                               //0x18
}; 
//0x20 bytes (sizeof)
struct _CACHE_UNINITIALIZE_EVENT
{
    struct _CACHE_UNINITIALIZE_EVENT* Next;                                 //0x0
    struct _KEVENT Event;                                                   //0x8
}; 
//0x0 bytes (sizeof)
struct _CALLBACK_OBJECT; 
//0x28 bytes (sizeof)
struct _CALL_HASH_ENTRY
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    VOID* CallersAddress;                                                   //0x10
    VOID* CallersCaller;                                                    //0x18
    ULONG CallCount;                                                        //0x20
};
//0x408 bytes (sizeof)
struct _CALL_PERFORMANCE_DATA
{
    ULONGLONG SpinLock;                                                     //0x0
    struct _LIST_ENTRY HashTable[64];                                       //0x8
};
//0x20 bytes (sizeof)
struct _CC_ASYNC_READ_CONTEXT
{
    UCHAR (*CompletionRoutine)(VOID* arg1);                                 //0x0
    VOID* Context;                                                          //0x8
    struct _MDL* Mdl;                                                       //0x10
    CHAR RequestorMode;                                                     //0x18
    ULONG NestingLevel;                                                     //0x1c
}; 
//0x30 bytes (sizeof)
struct _CC_EXTERNAL_CACHE_INFO
{
    VOID (*Callback)(VOID* arg1, ULONGLONG arg2, ULONG arg3);               //0x0
    struct _DIRTY_PAGE_STATISTICS DirtyPageStatistics;                      //0x8
    struct _LIST_ENTRY Links;                                               //0x20
};
//0x400 bytes (sizeof)
struct _CC_PARTITION
{
    SHORT NodeTypeCode;                                                     //0x0
    SHORT NodeByteSize;                                                     //0x2
    struct _EPARTITION* PartitionObject;                                    //0x8
    struct _LIST_ENTRY CleanSharedCacheMapList;                             //0x10
    struct _LIST_ENTRY CleanSharedCacheMapWithLogHandleList;                //0x20
    struct _SHARED_CACHE_MAP_LIST_CURSOR DirtySharedCacheMapList;           //0x30
    struct _SHARED_CACHE_MAP_LIST_CURSOR LazyWriteCursor;                   //0x48
    struct _LIST_ENTRY DirtySharedCacheMapWithLogHandleList;                //0x60
    ULONGLONG PrivateLock;                                                  //0x80
    ULONG ConsecutiveWorklessLazyScanCount;                                 //0x88
    UCHAR ForcedDisableLazywriteScan;                                       //0x8c
    ULONGLONG WorkQueueLock;                                                //0xc0
    ULONG NumberWorkerThreads;                                              //0xc8
    ULONG NumberActiveWorkerThreads;                                        //0xcc
    struct _LIST_ENTRY IdleWorkerThreadList;                                //0xd0
    struct _LIST_ENTRY FastTeardownWorkQueue;                               //0xe0
    struct _LIST_ENTRY ExpressWorkQueue;                                    //0xf0
    struct _LIST_ENTRY RegularWorkQueue;                                    //0x100
    struct _LIST_ENTRY PostTickWorkQueue;                                   //0x110
    struct _LIST_ENTRY IdleExtraWriteBehindThreadList;                      //0x120
    ULONG ActiveExtraWriteBehindThreads;                                    //0x130
    ULONG MaxExtraWriteBehindThreads;                                       //0x134
    UCHAR QueueThrottle;                                                    //0x138
    ULONG PostTickWorkItemCount;                                            //0x13c
    ULONG ThreadsActiveBeforeThrottle;                                      //0x140
    ULONG ExtraWBThreadsActiveBeforeThrottle;                               //0x144
    ULONG ExecutingWriteBehindWorkItems;                                    //0x148
    ULONG ExecutingHighPriorityWorkItem;                                    //0x14c
    struct _KEVENT LowMemoryEvent;                                          //0x150
    struct _KEVENT PowerEvent;                                              //0x168
    struct _KEVENT PeriodicEvent;                                           //0x180
    struct _KEVENT WaitingForTeardownEvent;                                 //0x198
    struct _KEVENT CoalescingFlushEvent;                                    //0x1b0
    ULONG PagesYetToWrite;                                                  //0x1c8
    struct _LAZY_WRITER LazyWriter;                                         //0x1d0
    struct _DIRTY_PAGE_STATISTICS DirtyPageStatistics;                      //0x258
    struct _DIRTY_PAGE_THRESHOLDS DirtyPageThresholds;                      //0x270
    struct _WRITE_BEHIND_THROUGHPUT* ThroughputStats;                       //0x2a8
    LONG ThroughputTrend;                                                   //0x2b0
    ULONGLONG AverageAvailablePages;                                        //0x2b8
    ULONGLONG AverageDirtyPages;                                            //0x2c0
    ULONGLONG PagesSkippedDueToHotSpot;                                     //0x2c8
    union _LARGE_INTEGER PrevRegularQueueItemRunTime;                       //0x2d0
    union _LARGE_INTEGER PrevExtraWBThreadCheckTime;                        //0x2d8
    UCHAR AddExtraWriteBehindThreads;                                       //0x2e0
    UCHAR RemoveExtraThreadPending;                                         //0x2e1
    struct _LIST_ENTRY DeferredWrites;                                      //0x2e8
    ULONGLONG DeferredWriteSpinLock;                                        //0x300
    struct _LIST_ENTRY* IdleAsyncReadWorkerThreadList;                      //0x308
    ULONG* NumberActiveAsyncReadWorkerThreads;                              //0x310
    ULONG* NumberActiveCompleteAsyncReadWorkItems;                          //0x318
    struct _LIST_ENTRY* AsyncReadWorkQueue;                                 //0x320
    struct _LIST_ENTRY* AsyncReadCompletionWorkQueue;                       //0x328
    struct _KEVENT* NewAsyncReadRequestEvent;                               //0x330
    struct _ASYNC_READ_THREAD_STATS* ReaderThreadsStats;                    //0x338
    struct _EX_PUSH_LOCK AsyncReadWorkQueueLock;                            //0x340
    struct _LIST_ENTRY VacbFreeHighPriorityList;                            //0x348
    ULONG NumberOfFreeHighPriorityVacbs;                                    //0x358
    struct _ETHREAD* LowPriWorkerThread;                                    //0x360
    struct _SHARED_CACHE_MAP* LowPriSharedCacheMap;                         //0x368
    LONG LowPriOldCpuPriority;                                              //0x370
    enum _IO_PRIORITY_HINT LowPriOldIoPriority;                             //0x374
    struct _EX_PUSH_LOCK LowPriorityWorkerThreadLock;                       //0x378
    ULONG MaxNumberOfWriteBehindThreads;                                    //0x380
    UCHAR CoalescingState;                                                  //0x384
    UCHAR RundownStarted;                                                   //0x385
    LONGLONG RefCount;                                                      //0x388
    struct _KEVENT ExitEvent;                                               //0x390
    struct _KEVENT FinalDereferenceEvent;                                   //0x3a8
    VOID* LazyWriteScanThreadHandle;                                        //0x3c0
}; 
//0x50 bytes (sizeof)
struct _CELL_DATA
{
    union _u u;                                                             //0x0
}; 
//0x8 bytes (sizeof)
struct _CHILD_LIST
{
    ULONG Count;                                                            //0x0
    ULONG List;                                                             //0x4
}; 
//0x0 bytes (sizeof)
struct _CI_NGEN_PATHS; 
//0x10 bytes (sizeof)
struct _CLIENT_ID
{
    VOID* UniqueProcess;                                                    //0x0
    VOID* UniqueThread;                                                     //0x8
}; 
//0x8 bytes (sizeof)
struct _CLIENT_ID32
{
    ULONG UniqueProcess;                                                    //0x0
    ULONG UniqueThread;                                                     //0x4
}; 
//0x10 bytes (sizeof)
struct _CLIENT_ID64
{
    ULONGLONG UniqueProcess;                                                //0x0
    ULONGLONG UniqueThread;                                                 //0x8
}; 
//0x17a8 bytes (sizeof)
struct _CMHIVE
{
    struct _HHIVE Hive;                                                     //0x0
    VOID* FileHandles[6];                                                   //0xa68
    struct _LIST_ENTRY NotifyList;                                          //0xa98
    struct _LIST_ENTRY HiveList;                                            //0xaa8
    struct _LIST_ENTRY PreloadedHiveList;                                   //0xab8
    struct _LIST_ENTRY FailedUnloadList;                                    //0xac8
    struct _EX_RUNDOWN_REF HiveRundown;                                     //0xad8
    struct _LIST_ENTRY ParseCacheEntries;                                   //0xae0
    struct _CM_KEY_HASH_TABLE_ENTRY* KcbCacheTable;                         //0xaf0
    ULONG KcbCacheTableSize;                                                //0xaf8
    struct _CM_KEY_HASH_TABLE_ENTRY* DeletedKcbTable;                       //0xb00
    ULONG DeletedKcbTableSize;                                              //0xb08
    ULONG Identity;                                                         //0xb0c
    struct _FAST_MUTEX* HiveLock;                                           //0xb10
    struct _FAST_MUTEX* WriterLock;                                         //0xb18
    struct _ERESOURCE* FlusherLock;                                         //0xb20
    struct _RTL_BITMAP FlushDirtyVector;                                    //0xb28
    ULONG FlushDirtyVectorSize;                                             //0xb38
    UCHAR* FlushLogEntry;                                                   //0xb40
    ULONG FlushLogEntrySize;                                                //0xb48
    ULONG FlushHiveTruncated;                                               //0xb4c
    UCHAR FlushBaseBlockDirty;                                              //0xb50
    struct _RTL_BITMAP CapturedUnreconciledVector;                          //0xb58
    ULONG CapturedUnreconciledVectorSize;                                   //0xb68
    struct CMP_OFFSET_ARRAY* UnreconciledOffsetArray;                       //0xb70
    ULONG UnreconciledOffsetArrayCount;                                     //0xb78
    struct _HBASE_BLOCK* UnreconciledBaseBlock;                             //0xb80
    struct _EX_PUSH_LOCK SecurityLock;                                      //0xb88
    ULONG UseCount;                                                         //0xb90
    ULONG LastShrinkHiveSize;                                               //0xb94
    union _LARGE_INTEGER ActualFileSize;                                    //0xb98
    union _LARGE_INTEGER LogFileSizes[2];                                   //0xba0
    struct _UNICODE_STRING FileFullPath;                                    //0xbb0
    struct _UNICODE_STRING FileUserName;                                    //0xbc0
    struct _UNICODE_STRING HiveRootPath;                                    //0xbd0
    ULONG SecurityCount;                                                    //0xbe0
    ULONG SecurityCacheSize;                                                //0xbe4
    LONG SecurityHitHint;                                                   //0xbe8
    struct _CM_KEY_SECURITY_CACHE_ENTRY* SecurityCache;                     //0xbf0
    struct _LIST_ENTRY SecurityHash[64];                                    //0xbf8
    ULONG UnloadEventCount;                                                 //0xff8
    struct _KEVENT** UnloadEventArray;                                      //0x1000
    struct _CM_KEY_CONTROL_BLOCK* RootKcb;                                  //0x1008
    UCHAR Frozen;                                                           //0x1010
    struct _CM_WORKITEM* UnloadWorkItem;                                    //0x1018
    struct _CM_WORKITEM UnloadWorkItemHolder;                               //0x1020
    UCHAR GrowOnlyMode;                                                     //0x1048
    ULONG GrowOffset;                                                       //0x104c
    struct _LIST_ENTRY KcbConvertListHead;                                  //0x1050
    struct _CM_CELL_REMAP_BLOCK* CellRemapArray;                            //0x1060
    struct _CM_DIRTY_VECTOR_LOG DirtyVectorLog;                             //0x1068
    ULONG Flags;                                                            //0x14f0
    struct _LIST_ENTRY TrustClassEntry;                                     //0x14f8
    ULONGLONG DirtyTime;                                                    //0x1508
    ULONGLONG UnreconciledTime;                                             //0x1510
    struct _CM_RM* CmRm;                                                    //0x1518
    ULONG CmRmInitFailPoint;                                                //0x1520
    LONG CmRmInitFailStatus;                                                //0x1524
    struct _KTHREAD* CreatorOwner;                                          //0x1528
    struct _KTHREAD* RundownThread;                                         //0x1530
    union _LARGE_INTEGER LastWriteTime;                                     //0x1538
    struct _HIVE_WRITE_WAIT_QUEUE FlushQueue;                               //0x1540
    struct _HIVE_WRITE_WAIT_QUEUE ReconcileQueue;                           //0x1558
    union
    {
        ULONG FlushFlags;                                                   //0x1570
        struct
        {
            ULONG FlushActive:1;                                            //0x1570
            ULONG ReconcileActive:1;                                        //0x1570
            ULONG PrimaryFilePurged:1;                                      //0x1570
            ULONG DiskFileBad:1;                                            //0x1570
        };
    };
    ULONG PrimaryFileSizeBeforeLastFlush;                                   //0x1574
    volatile LONG ReferenceCount;                                           //0x1578
    LONG UnloadHistoryIndex;                                                //0x157c
    ULONG UnloadHistory[128];                                               //0x1580
    ULONG BootStart;                                                        //0x1780
    ULONG UnaccessedStart;                                                  //0x1784
    ULONG UnaccessedEnd;                                                    //0x1788
    ULONG LoadedKeyCount;                                                   //0x178c
    volatile ULONG HandleClosePending;                                      //0x1790
    struct _EX_PUSH_LOCK HandleClosePendingEvent;                           //0x1798
    UCHAR FinalFlushSucceeded;                                              //0x17a0
    UCHAR FailedUnload;                                                     //0x17a1
}; 
//0x20 bytes (sizeof)
struct _CMP_DISCARD_AND_REPLACE_KCB_CONTEXT
{
    struct _CM_KEY_CONTROL_BLOCK* BaseKcb;                                  //0x0
    LONG PrepareStatus;                                                     //0x8
    struct _LIST_ENTRY ClonedKcbListHead;                                   //0x10
}; 
//0x8 bytes (sizeof)
struct _CM_BIG_DATA
{
    USHORT Signature;                                                       //0x0
    USHORT Count;                                                           //0x2
    ULONG List;                                                             //0x4
}; 
//0x58 bytes (sizeof)
struct _CM_CACHED_VALUE_INDEX
{
    ULONG CellIndex;                                                        //0x0
    union
    {
        struct _CELL_DATA CellData;                                         //0x8
        ULONGLONG List[1];                                                  //0x8
    } Data;                                                                 //0x8
};
//0x8 bytes (sizeof)
struct _CM_CELL_REMAP_BLOCK
{
    ULONG OldCell;                                                          //0x0
    ULONG NewCell;                                                          //0x4
}; 
//0x4 bytes (sizeof)
struct _CM_COMPONENT_HASH
{
    ULONG Hash;                                                             //0x0
}; 
//0x488 bytes (sizeof)
struct _CM_DIRTY_VECTOR_LOG
{
    volatile ULONG Next;                                                    //0x0
    ULONG Size;                                                             //0x4
    struct _CM_DIRTY_VECTOR_LOG_ENTRY Log[16];                              //0x8
}; 
//0x48 bytes (sizeof)
struct _CM_DIRTY_VECTOR_LOG_ENTRY
{
    struct _ETHREAD* Thread;                                                //0x0
    enum _CM_DIRTY_VECTOR_OPERATION Operation;                              //0x8
    union
    {
        struct
        {
            ULONG Start;                                                    //0xc
            ULONG Length;                                                   //0x10
        } DirtyVectorModifiedContext;                                       //0xc
        struct
        {
            ULONG RangeCount;                                               //0xc
            ULONG SetBitCount;                                              //0x10
        } DirtyDataCaptureContext;                                          //0xc
        struct
        {
            ULONG Context1;                                                 //0xc
            ULONG Context2;                                                 //0x10
        } Raw;                                                              //0xc
    } Data;                                                                 //0xc
    VOID* Stack[6];                                                         //0x18
}; 
//0x4 bytes (sizeof)
struct _CM_FAST_LEAF_HINT
{
    union
    {
        UCHAR Characters[4];                                                //0x0
        ULONG FullHint;                                                     //0x0
    };
}; 
//0x24 bytes (sizeof)
struct _CM_FULL_RESOURCE_DESCRIPTOR
{
    enum _INTERFACE_TYPE InterfaceType;                                     //0x0
    ULONG BusNumber;                                                        //0x4
    struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList;                   //0x8
}; 
//0x8 bytes (sizeof)
struct _CM_INDEX
{
    ULONG Cell;                                                             //0x0
    union
    {
        struct _CM_FAST_LEAF_HINT NameHint;                                 //0x4
        struct _CM_COMPONENT_HASH HashKey;                                  //0x4
    };
};
//0x8 bytes (sizeof)
struct _CM_INDEX_HINT_BLOCK
{
    ULONG Count;                                                            //0x0
    ULONG HashKey[1];                                                       //0x4
}; 
//0x10 bytes (sizeof)
struct _CM_INTENT_LOCK
{
    ULONG OwnerCount;                                                       //0x0
    struct _CM_KCB_UOW** OwnerTable;                                        //0x8
}; 
//0x30 bytes (sizeof)
struct _CM_KCB_LAYER_INFO
{
    struct _LIST_ENTRY LayerListEntry;                                      //0x0
    struct _CM_KEY_CONTROL_BLOCK* Kcb;                                      //0x10
    struct _CM_KCB_LAYER_INFO* LowerLayer;                                  //0x18
    struct _LIST_ENTRY UpperLayerListHead;                                  //0x20
}; 
//0x78 bytes (sizeof)
struct _CM_KCB_UOW
{
    struct _LIST_ENTRY TransactionListEntry;                                //0x0
    struct _CM_INTENT_LOCK* KCBLock;                                        //0x10
    struct _CM_INTENT_LOCK* KeyLock;                                        //0x18
    struct _LIST_ENTRY KCBListEntry;                                        //0x20
    struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;                          //0x30
    struct _CM_TRANS* Transaction;                                          //0x38
    ULONG UoWState;                                                         //0x40
    enum UoWActionType ActionType;                                          //0x44
    enum HSTORAGE_TYPE StorageType;                                         //0x48
    struct _CM_KCB_UOW* ParentUoW;                                          //0x50
    union
    {
        struct _CM_KEY_CONTROL_BLOCK* ChildKCB;                             //0x58
        ULONG VolatileKeyCell;                                              //0x58
        struct
        {
            ULONG OldValueCell;                                             //0x58
            ULONG NewValueCell;                                             //0x5c
        };
        ULONG UserFlags;                                                    //0x58
        union _LARGE_INTEGER LastWriteTime;                                 //0x58
        struct
        {
            struct _CM_KEY_SECURITY_CACHE* TxCachedSecurity;                //0x58
            ULONG TxSecurityCell;                                           //0x60
        };
        struct
        {
            struct _CM_KEY_CONTROL_BLOCK* OldChildKCB;                      //0x58
            struct _CM_KEY_CONTROL_BLOCK* NewChildKCB;                      //0x60
        };
        struct
        {
            struct _CM_KEY_CONTROL_BLOCK* OtherChildKCB;                    //0x58
            ULONG ThisVolatileKeyCell;                                      //0x60
        };
    };
    union
    {
        VOID* PrepareDataPointer;                                           //0x68
        struct _CM_UOW_SET_SD_DATA* SecurityData;                           //0x68
        struct _CM_UOW_KEY_STATE_MODIFICATION* ModifyKeysData;              //0x68
        struct _CM_UOW_SET_VALUE_LIST_DATA* SetValueData;                   //0x68
    };
    union
    {
        struct _CM_UOW_SET_VALUE_KEY_DATA* ValueData;                       //0x70
        struct _CMP_DISCARD_AND_REPLACE_KCB_CONTEXT* DiscardReplaceContext; //0x70
    };
}; 
//0x60 bytes (sizeof)
struct _CM_KEY_BODY
{
    ULONG Type;                                                             //0x0
    struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;                          //0x8
    struct _CM_NOTIFY_BLOCK* NotifyBlock;                                   //0x10
    VOID* ProcessID;                                                        //0x18
    struct _LIST_ENTRY KeyBodyList;                                         //0x20
    ULONG Flags:16;                                                         //0x30
    ULONG HandleTags:16;                                                    //0x30
    union _CM_TRANS_PTR Trans;                                              //0x38
    struct _GUID* KtmUow;                                                   //0x40
    struct _LIST_ENTRY ContextListHead;                                     //0x48
    VOID* EnumerationResumeContext;                                         //0x58
}; 
//0x130 bytes (sizeof)
struct _CM_KEY_CONTROL_BLOCK
{
    ULONG RefCount;                                                         //0x0
    ULONG ExtFlags:16;                                                      //0x4
    ULONG PrivateAlloc:1;                                                   //0x4
    ULONG Discarded:1;                                                      //0x4
    ULONG HiveUnloaded:1;                                                   //0x4
    ULONG Decommissioned:1;                                                 //0x4
    ULONG SpareExtFlag:1;                                                   //0x4
    ULONG TotalLevels:10;                                                   //0x4
    union
    {
        struct _CM_KEY_HASH KeyHash;                                        //0x8
        struct
        {
            struct _CM_PATH_HASH ConvKey;                                   //0x8
            struct _CM_KEY_HASH* NextHash;                                  //0x10
            struct _HHIVE* KeyHive;                                         //0x18
            ULONG KeyCell;                                                  //0x20
        };
    };
    struct _EX_PUSH_LOCK KcbPushlock;                                       //0x28
    union
    {
        struct _KTHREAD* Owner;                                             //0x30
        LONG SharedCount;                                                   //0x30
    };
    UCHAR DelayedDeref:1;                                                   //0x38
    UCHAR DelayedClose:1;                                                   //0x38
    UCHAR Parking:1;                                                        //0x38
    UCHAR LayerSemantics;                                                   //0x39
    SHORT LayerHeight;                                                      //0x3a
    ULONG Spare1;                                                           //0x3c
    struct _CM_KEY_CONTROL_BLOCK* ParentKcb;                                //0x40
    struct _CM_NAME_CONTROL_BLOCK* NameBlock;                               //0x48
    struct _CM_KEY_SECURITY_CACHE* CachedSecurity;                          //0x50
    struct _CACHED_CHILD_LIST ValueCache;                                   //0x58
    union
    {
        struct _CM_INDEX_HINT_BLOCK* IndexHint;                             //0x68
        ULONG HashKey;                                                      //0x68
        ULONG SubKeyCount;                                                  //0x68
    };
    union
    {
        struct _LIST_ENTRY KeyBodyListHead;                                 //0x70
        struct _LIST_ENTRY FreeListEntry;                                   //0x70
    };
    struct _CM_KEY_BODY* KeyBodyArray[4];                                   //0x80
    union _LARGE_INTEGER KcbLastWriteTime;                                  //0xa0
    USHORT KcbMaxNameLen;                                                   //0xa8
    USHORT KcbMaxValueNameLen;                                              //0xaa
    ULONG KcbMaxValueDataLen;                                               //0xac
    ULONG KcbUserFlags:4;                                                   //0xb0
    ULONG KcbVirtControlFlags:4;                                            //0xb0
    ULONG KcbDebug:8;                                                       //0xb0
    ULONG Flags:16;                                                         //0xb0
    ULONG Spare3;                                                           //0xb4
    struct _CM_KCB_LAYER_INFO* LayerInfo;                                   //0xb8
    CHAR* RealKeyName;                                                      //0xc0
    struct _LIST_ENTRY KCBUoWListHead;                                      //0xc8
    union
    {
        struct _LIST_ENTRY DelayQueueEntry;                                 //0xd8
        volatile UCHAR* Stolen;                                             //0xd8
    };
    struct _CM_TRANS* TransKCBOwner;                                        //0xe8
    struct _CM_INTENT_LOCK KCBLock;                                         //0xf0
    struct _CM_INTENT_LOCK KeyLock;                                         //0x100
    struct _CHILD_LIST TransValueCache;                                     //0x110
    struct _CM_TRANS* TransValueListOwner;                                  //0x118
    union
    {
        struct _UNICODE_STRING* FullKCBName;                                //0x120
        struct
        {
            ULONGLONG FullKCBNameStale:1;                                   //0x120
            ULONGLONG Reserved:63;                                          //0x120
        };
    };
    ULONGLONG SequenceNumber;                                               //0x128
}; 
//0x20 bytes (sizeof)
struct _CM_KEY_HASH
{
    struct _CM_PATH_HASH ConvKey;                                           //0x0
    struct _CM_KEY_HASH* NextHash;                                          //0x8
    struct _HHIVE* KeyHive;                                                 //0x10
    ULONG KeyCell;                                                          //0x18
}; 
//0x18 bytes (sizeof)
struct _CM_KEY_HASH_TABLE_ENTRY
{
    struct _EX_PUSH_LOCK Lock;                                              //0x0
    struct _KTHREAD* Owner;                                                 //0x8
    struct _CM_KEY_HASH* Entry;                                             //0x10
}; 
//0x8 bytes (sizeof)
struct _CM_KEY_INDEX
{
    USHORT Signature;                                                       //0x0
    USHORT Count;                                                           //0x2
    ULONG List[1];                                                          //0x4
}; 
//0x50 bytes (sizeof)
struct _CM_KEY_NODE
{
    USHORT Signature;                                                       //0x0
    USHORT Flags;                                                           //0x2
    union _LARGE_INTEGER LastWriteTime;                                     //0x4
    UCHAR AccessBits;                                                       //0xc
    UCHAR LayerSemantics:2;                                                 //0xd
    UCHAR Spare1:5;                                                         //0xd
    UCHAR InheritClass:1;                                                   //0xd
    USHORT Spare2;                                                          //0xe
    ULONG Parent;                                                           //0x10
    ULONG SubKeyCounts[2];                                                  //0x14
    union
    {
        struct
        {
            ULONG SubKeyLists[2];                                           //0x1c
            struct _CHILD_LIST ValueList;                                   //0x24
        };
        struct _CM_KEY_REFERENCE ChildHiveReference;                        //0x1c
    };
    ULONG Security;                                                         //0x2c
    ULONG Class;                                                            //0x30
    ULONG MaxNameLen:16;                                                    //0x34
    ULONG UserFlags:4;                                                      //0x34
    ULONG VirtControlFlags:4;                                               //0x34
    ULONG Debug:8;                                                          //0x34
    ULONG MaxClassLen;                                                      //0x38
    ULONG MaxValueNameLen;                                                  //0x3c
    ULONG MaxValueDataLen;                                                  //0x40
    ULONG WorkVar;                                                          //0x44
    USHORT NameLength;                                                      //0x48
    USHORT ClassLength;                                                     //0x4a
    WCHAR Name[1];                                                          //0x4c
}; 
//0x10 bytes (sizeof)
struct _CM_KEY_REFERENCE
{
    ULONG KeyCell;                                                          //0x0
    struct _HHIVE* KeyHive;                                                 //0x8
}; 
//0x28 bytes (sizeof)
struct _CM_KEY_SECURITY
{
    USHORT Signature;                                                       //0x0
    USHORT Reserved;                                                        //0x2
    ULONG Flink;                                                            //0x4
    ULONG Blink;                                                            //0x8
    ULONG ReferenceCount;                                                   //0xc
    ULONG DescriptorLength;                                                 //0x10
    struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor;                        //0x14
}; 
//0x38 bytes (sizeof)
struct _CM_KEY_SECURITY_CACHE
{
    ULONG Cell;                                                             //0x0
    ULONG ConvKey;                                                          //0x4
    struct _LIST_ENTRY List;                                                //0x8
    ULONG DescriptorLength;                                                 //0x18
    ULONG RealRefCount;                                                     //0x1c
    struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor;                        //0x20
}; 
//0x10 bytes (sizeof)
struct _CM_KEY_SECURITY_CACHE_ENTRY
{
    ULONG Cell;                                                             //0x0
    struct _CM_KEY_SECURITY_CACHE* CachedSecurity;                          //0x8
}; 
//0x18 bytes (sizeof)
struct _CM_KEY_VALUE
{
    USHORT Signature;                                                       //0x0
    USHORT NameLength;                                                      //0x2
    ULONG DataLength;                                                       //0x4
    ULONG Data;                                                             //0x8
    ULONG Type;                                                             //0xc
    USHORT Flags;                                                           //0x10
    USHORT Spare;                                                           //0x12
    WCHAR Name[1];                                                          //0x14
}; 
//0x20 bytes (sizeof)
struct _CM_NAME_CONTROL_BLOCK
{
    ULONG Compressed:1;                                                     //0x0
    ULONG RefCount:31;                                                      //0x0
    union
    {
        struct _CM_NAME_HASH NameHash;                                      //0x8
        struct
        {
            struct _CM_COMPONENT_HASH ConvKey;                              //0x8
            struct _CM_KEY_HASH* NextHash;                                  //0x10
            USHORT NameLength;                                              //0x18
            WCHAR Name[1];                                                  //0x1a
        };
    };
}; 
//0x18 bytes (sizeof)
struct _CM_NAME_HASH
{
    struct _CM_COMPONENT_HASH ConvKey;                                      //0x0
    struct _CM_NAME_HASH* NextHash;                                         //0x8
    USHORT NameLength;                                                      //0x10
    WCHAR Name[1];                                                          //0x12
}; 
//0x58 bytes (sizeof)
struct _CM_NOTIFY_BLOCK
{
    struct _LIST_ENTRY HiveList;                                            //0x0
    struct _LIST_ENTRY PostList;                                            //0x10
    struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;                          //0x20
    struct _CM_KEY_BODY* KeyBody;                                           //0x28
    ULONG Filter:30;                                                        //0x30
    ULONG WatchTree:1;                                                      //0x30
    ULONG NotifyPending:1;                                                  //0x30
    struct _SECURITY_SUBJECT_CONTEXT SubjectContext;                        //0x38
}; 
//0x14 bytes (sizeof)
struct _CM_PARTIAL_RESOURCE_DESCRIPTOR
{
    UCHAR Type;                                                             //0x0
    UCHAR ShareDisposition;                                                 //0x1
    USHORT Flags;                                                           //0x2
    union
    {
        struct
        {
            union _LARGE_INTEGER Start;                                     //0x4
            ULONG Length;                                                   //0xc
        } Generic;                                                          //0x4
        struct
        {
            union _LARGE_INTEGER Start;                                     //0x4
            ULONG Length;                                                   //0xc
        } Port;                                                             //0x4
        struct
        {
            USHORT Level;                                                   //0x4
            USHORT Group;                                                   //0x6
            ULONG Vector;                                                   //0x8
            ULONGLONG Affinity;                                             //0xc
        } Interrupt;                                                        //0x4
        struct
        {
            union
            {
                struct
                {
                    USHORT Group;                                           //0x4
                    USHORT MessageCount;                                    //0x6
                    ULONG Vector;                                           //0x8
                    ULONGLONG Affinity;                                     //0xc
                } Raw;                                                      //0x4
                struct
                {
                    USHORT Level;                                           //0x4
                    USHORT Group;                                           //0x6
                    ULONG Vector;                                           //0x8
                    ULONGLONG Affinity;                                     //0xc
                } Translated;                                               //0x4
            };
        } MessageInterrupt;                                                 //0x4
        struct
        {
            union _LARGE_INTEGER Start;                                     //0x4
            ULONG Length;                                                   //0xc
        } Memory;                                                           //0x4
        struct
        {
            ULONG Channel;                                                  //0x4
            ULONG Port;                                                     //0x8
            ULONG Reserved1;                                                //0xc
        } Dma;                                                              //0x4
        struct
        {
            ULONG Channel;                                                  //0x4
            ULONG RequestLine;                                              //0x8
            UCHAR TransferWidth;                                            //0xc
            UCHAR Reserved1;                                                //0xd
            UCHAR Reserved2;                                                //0xe
            UCHAR Reserved3;                                                //0xf
        } DmaV3;                                                            //0x4
        struct
        {
            ULONG Data[3];                                                  //0x4
        } DevicePrivate;                                                    //0x4
        struct
        {
            ULONG Start;                                                    //0x4
            ULONG Length;                                                   //0x8
            ULONG Reserved;                                                 //0xc
        } BusNumber;                                                        //0x4
        struct
        {
            ULONG DataSize;                                                 //0x4
            ULONG Reserved1;                                                //0x8
            ULONG Reserved2;                                                //0xc
        } DeviceSpecificData;                                               //0x4
        struct
        {
            union _LARGE_INTEGER Start;                                     //0x4
            ULONG Length40;                                                 //0xc
        } Memory40;                                                         //0x4
        struct
        {
            union _LARGE_INTEGER Start;                                     //0x4
            ULONG Length48;                                                 //0xc
        } Memory48;                                                         //0x4
        struct
        {
            union _LARGE_INTEGER Start;                                     //0x4
            ULONG Length64;                                                 //0xc
        } Memory64;                                                         //0x4
        struct
        {
            UCHAR Class;                                                    //0x4
            UCHAR Type;                                                     //0x5
            UCHAR Reserved1;                                                //0x6
            UCHAR Reserved2;                                                //0x7
            ULONG IdLowPart;                                                //0x8
            ULONG IdHighPart;                                               //0xc
        } Connection;                                                       //0x4
    } u;                                                                    //0x4
}; 
//0x1c bytes (sizeof)
struct _CM_PARTIAL_RESOURCE_LIST
{
    USHORT Version;                                                         //0x0
    USHORT Revision;                                                        //0x2
    ULONG Count;                                                            //0x4
    struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];           //0x8
}; 
//0x4 bytes (sizeof)
struct _CM_PATH_HASH
{
    ULONG Hash;                                                             //0x0
}; 
//0x28 bytes (sizeof)
struct _CM_RESOURCE_LIST
{
    ULONG Count;                                                            //0x0
    struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];                            //0x4
}; 
//0x88 bytes (sizeof)
struct _CM_RM
{
    struct _LIST_ENTRY RmListEntry;                                         //0x0
    struct _LIST_ENTRY TransactionListHead;                                 //0x10
    VOID* TmHandle;                                                         //0x20
    VOID* Tm;                                                               //0x28
    VOID* RmHandle;                                                         //0x30
    VOID* KtmRm;                                                            //0x38
    ULONG RefCount;                                                         //0x40
    ULONG ContainerNum;                                                     //0x44
    ULONGLONG ContainerSize;                                                //0x48
    struct _CMHIVE* CmHive;                                                 //0x50
    VOID* LogFileObject;                                                    //0x58
    VOID* MarshallingContext;                                               //0x60
    ULONG RmFlags;                                                          //0x68
    LONG LogStartStatus1;                                                   //0x6c
    LONG LogStartStatus2;                                                   //0x70
    ULONGLONG BaseLsn;                                                      //0x78
    struct _ERESOURCE* RmLock;                                              //0x80
}; 
//0xb8 bytes (sizeof)
struct _CM_TRANS
{
    struct _LIST_ENTRY TransactionListEntry;                                //0x0
    struct _LIST_ENTRY KCBUoWListHead;                                      //0x10
    struct _LIST_ENTRY LazyCommitListEntry;                                 //0x20
    union
    {
        struct
        {
            ULONG Prepared:1;                                               //0x30
            ULONG Aborted:1;                                                //0x30
            ULONG Committed:1;                                              //0x30
            ULONG Initializing:1;                                           //0x30
            ULONG Invalid:1;                                                //0x30
            ULONG UseReservation:1;                                         //0x30
            ULONG TmCallbacksActive:1;                                      //0x30
            ULONG LightWeight:1;                                            //0x30
            ULONG Freed1:1;                                                 //0x30
            ULONG Freed2:1;                                                 //0x30
            ULONG Spare1:2;                                                 //0x30
            ULONG Freed:1;                                                  //0x30
            ULONG Spare:19;                                                 //0x30
        };
        ULONG TransState;                                                   //0x30
    };
    union _CM_TRANS_PTR Trans;                                              //0x38
    struct _CM_RM* CmRm;                                                    //0x40
    struct _KENLISTMENT* KtmEnlistmentObject;                               //0x48
    VOID* KtmEnlistmentHandle;                                              //0x50
    struct _GUID KtmUow;                                                    //0x58
    ULONGLONG StartLsn;                                                     //0x68
    ULONG HiveCount;                                                        //0x70
    struct _CMHIVE* HiveArray[8];                                           //0x78
}; 
//0x14 bytes (sizeof)
struct _CM_UOW_KEY_STATE_MODIFICATION
{
    ULONG RefCount;                                                         //0x0
    ULONG SubKeyListCount[2];                                               //0x4
    ULONG NewSubKeyList[2];                                                 //0xc
}; 
//0x4 bytes (sizeof)
struct _CM_UOW_SET_SD_DATA
{
    ULONG SecurityCell;                                                     //0x0
}; 
//0x10 bytes (sizeof)
struct _CM_UOW_SET_VALUE_KEY_DATA
{
    ULONG PreparedCell;                                                     //0x0
    ULONG OldValueCell;                                                     //0x4
    USHORT NameLength;                                                      //0x8
    ULONG DataSize;                                                         //0xc
}; 
//0xc bytes (sizeof)
struct _CM_UOW_SET_VALUE_LIST_DATA
{
    ULONG RefCount;                                                         //0x0
    struct _CHILD_LIST ValueList;                                           //0x4
}; 
//0x28 bytes (sizeof)
struct _CM_WORKITEM
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    ULONG Private;                                                          //0x10
    VOID (*WorkerRoutine)(VOID* arg1);                                      //0x18
    VOID* Parameter;                                                        //0x20
}; 
//0xc bytes (sizeof)
struct _COMPRESSED_DATA_INFO
{
    USHORT CompressionFormatAndEngine;                                      //0x0
    UCHAR CompressionUnitShift;                                             //0x2
    UCHAR ChunkShift;                                                       //0x3
    UCHAR ClusterShift;                                                     //0x4
    UCHAR Reserved;                                                         //0x5
    USHORT NumberOfChunks;                                                  //0x6
    ULONG CompressedChunkSizes[1];                                          //0x8
}; 
//0x4d0 bytes (sizeof)
struct _CONTEXT
{
    ULONGLONG P1Home;                                                       //0x0
    ULONGLONG P2Home;                                                       //0x8
    ULONGLONG P3Home;                                                       //0x10
    ULONGLONG P4Home;                                                       //0x18
    ULONGLONG P5Home;                                                       //0x20
    ULONGLONG P6Home;                                                       //0x28
    ULONG ContextFlags;                                                     //0x30
    ULONG MxCsr;                                                            //0x34
    USHORT SegCs;                                                           //0x38
    USHORT SegDs;                                                           //0x3a
    USHORT SegEs;                                                           //0x3c
    USHORT SegFs;                                                           //0x3e
    USHORT SegGs;                                                           //0x40
    USHORT SegSs;                                                           //0x42
    ULONG EFlags;                                                           //0x44
    ULONGLONG Dr0;                                                          //0x48
    ULONGLONG Dr1;                                                          //0x50
    ULONGLONG Dr2;                                                          //0x58
    ULONGLONG Dr3;                                                          //0x60
    ULONGLONG Dr6;                                                          //0x68
    ULONGLONG Dr7;                                                          //0x70
    ULONGLONG Rax;                                                          //0x78
    ULONGLONG Rcx;                                                          //0x80
    ULONGLONG Rdx;                                                          //0x88
    ULONGLONG Rbx;                                                          //0x90
    ULONGLONG Rsp;                                                          //0x98
    ULONGLONG Rbp;                                                          //0xa0
    ULONGLONG Rsi;                                                          //0xa8
    ULONGLONG Rdi;                                                          //0xb0
    ULONGLONG R8;                                                           //0xb8
    ULONGLONG R9;                                                           //0xc0
    ULONGLONG R10;                                                          //0xc8
    ULONGLONG R11;                                                          //0xd0
    ULONGLONG R12;                                                          //0xd8
    ULONGLONG R13;                                                          //0xe0
    ULONGLONG R14;                                                          //0xe8
    ULONGLONG R15;                                                          //0xf0
    ULONGLONG Rip;                                                          //0xf8
    union
    {
        struct _XSAVE_FORMAT FltSave;                                       //0x100
        struct
        {
            struct _M128A Header[2];                                        //0x100
            struct _M128A Legacy[8];                                        //0x120
            struct _M128A Xmm0;                                             //0x1a0
            struct _M128A Xmm1;                                             //0x1b0
            struct _M128A Xmm2;                                             //0x1c0
            struct _M128A Xmm3;                                             //0x1d0
            struct _M128A Xmm4;                                             //0x1e0
            struct _M128A Xmm5;                                             //0x1f0
            struct _M128A Xmm6;                                             //0x200
            struct _M128A Xmm7;                                             //0x210
            struct _M128A Xmm8;                                             //0x220
            struct _M128A Xmm9;                                             //0x230
            struct _M128A Xmm10;                                            //0x240
            struct _M128A Xmm11;                                            //0x250
            struct _M128A Xmm12;                                            //0x260
            struct _M128A Xmm13;                                            //0x270
            struct _M128A Xmm14;                                            //0x280
            struct _M128A Xmm15;                                            //0x290
        };
    };
    struct _M128A VectorRegister[26];                                       //0x300
    ULONGLONG VectorControl;                                                //0x4a0
    ULONGLONG DebugControl;                                                 //0x4a8
    ULONGLONG LastBranchToRip;                                              //0x4b0
    ULONGLONG LastBranchFromRip;                                            //0x4b8
    ULONGLONG LastExceptionToRip;                                           //0x4c0
    ULONGLONG LastExceptionFromRip;                                         //0x4c8
}; 
//0x80 bytes (sizeof)
struct _CONTROL_AREA
{
    struct _SEGMENT* Segment;                                               //0x0
    struct _LIST_ENTRY ListHead;                                            //0x8
    ULONGLONG NumberOfSectionReferences;                                    //0x18
    ULONGLONG NumberOfPfnReferences;                                        //0x20
    ULONGLONG NumberOfMappedViews;                                          //0x28
    ULONGLONG NumberOfUserReferences;                                       //0x30
    union
    {
        ULONG LongFlags;                                                    //0x38
        struct _MMSECTION_FLAGS Flags;                                      //0x38
    } u;                                                                    //0x38
    union
    {
        ULONG LongFlags;                                                    //0x3c
        struct _MMSECTION_FLAGS2 Flags;                                     //0x3c
    } u1;                                                                   //0x3c
    struct _EX_FAST_REF FilePointer;                                        //0x40
    volatile LONG ControlAreaLock;                                          //0x48
    ULONG ModifiedWriteCount;                                               //0x4c
    struct _MI_CONTROL_AREA_WAIT_BLOCK* WaitList;                           //0x50
    union
    {
        struct
        {
            union
            {
                ULONG NumberOfSystemCacheViews;                             //0x58
                ULONG ImageRelocationStartBit;                              //0x58
            };
            union
            {
                volatile LONG WritableUserReferences;                       //0x5c
                struct
                {
                    ULONG ImageRelocationSizeIn64k:16;                      //0x5c
                    ULONG LargePage:1;                                      //0x5c
                    ULONG SystemImage:1;                                    //0x5c
                    ULONG StrongCode:2;                                     //0x5c
                    ULONG CantMove:1;                                       //0x5c
                    ULONG BitMap:2;                                         //0x5c
                    ULONG ImageActive:1;                                    //0x5c
                };
            };
            union
            {
                ULONG FlushInProgressCount;                                 //0x60
                ULONG NumberOfSubsections;                                  //0x60
                struct _MI_IMAGE_SECURITY_REFERENCE* SeImageStub;           //0x60
            };
        } e2;                                                               //0x58
    } u2;                                                                   //0x58
    struct _EX_PUSH_LOCK FileObjectLock;                                    //0x68
    volatile ULONGLONG LockedPages;                                         //0x70
    union
    {
        ULONGLONG IoAttributionContext:61;                                  //0x78
        ULONGLONG Spare:3;                                                  //0x78
        ULONGLONG ImageCrossPartitionCharge;                                //0x78
        ULONGLONG CommittedPageCount:36;                                    //0x78
    } u3;                                                                   //0x78
}; 
//0x18 bytes (sizeof)
struct _COUNTER_READING
{
    enum _HARDWARE_COUNTER_TYPE Type;                                       //0x0
    ULONG Index;                                                            //0x4
    ULONGLONG Start;                                                        //0x8
    ULONGLONG Total;                                                        //0x10
}; 
//0x30 bytes (sizeof)
struct _CRITICAL_PROCESS_EXCEPTION_DATA
{
    struct _GUID ReportId;                                                  //0x0
    struct _UNICODE_STRING ModuleName;                                      //0x10
    ULONG ModuleTimestamp;                                                  //0x20
    ULONG ModuleSize;                                                       //0x24
    ULONGLONG Offset;                                                       //0x28
};
//0x18 bytes (sizeof)
struct _CURDIR
{
    struct _UNICODE_STRING DosPath;                                         //0x0
    VOID* Handle;                                                           //0x10
}; 
//0x1c bytes (sizeof)
struct _DBGKD_ANY_CONTROL_SET
{
    union
    {
        struct _X86_DBGKD_CONTROL_SET X86ControlSet;                        //0x0
        ULONG AlphaControlSet;                                              //0x0
        struct _IA64_DBGKD_CONTROL_SET IA64ControlSet;                      //0x0
        struct _AMD64_DBGKD_CONTROL_SET Amd64ControlSet;                    //0x0
        struct _ARM_DBGKD_CONTROL_SET ArmControlSet;                        //0x0
        struct _ARM64_DBGKD_CONTROL_SET Arm64ControlSet;                    //0x0
        struct _ARMCE_DBGKD_CONTROL_SET ArmCeControlSet;                    //0x0
        struct _PPC_DBGKD_CONTROL_SET PpcControlSet;                        //0x0
    };
}; 
//0x8 bytes (sizeof)
struct _DBGKD_BREAKPOINTEX
{
    ULONG BreakPointCount;                                                  //0x0
    LONG ContinueStatus;                                                    //0x4
}; 
//0xc bytes (sizeof)
struct _DBGKD_CONTEXT_EX
{
    ULONG Offset;                                                           //0x0
    ULONG ByteCount;                                                        //0x4
    ULONG BytesCopied;                                                      //0x8
}; 
//0x4 bytes (sizeof)
struct _DBGKD_CONTINUE
{
    LONG ContinueStatus;                                                    //0x0
}; 
//0x20 bytes (sizeof)
struct _DBGKD_CONTINUE2
{
    LONG ContinueStatus;                                                    //0x0
    union
    {
        struct _AMD64_DBGKD_CONTROL_SET ControlSet;                         //0x4
        struct _DBGKD_ANY_CONTROL_SET AnyControlSet;                        //0x4
    };
}; 
//0x10 bytes (sizeof)
struct _DBGKD_FILL_MEMORY
{
    ULONGLONG Address;                                                      //0x0
    ULONG Length;                                                           //0x8
    USHORT Flags;                                                           //0xc
    USHORT PatternLength;                                                   //0xe
}; 
//0x4 bytes (sizeof)
struct _DBGKD_GET_CONTEXT
{
    ULONG Unused;                                                           //0x0
}; 
//0x1c bytes (sizeof)
struct _DBGKD_GET_INTERNAL_BREAKPOINT32
{
    ULONG BreakpointAddress;                                                //0x0
    ULONG Flags;                                                            //0x4
    ULONG Calls;                                                            //0x8
    ULONG MaxCallsPerPeriod;                                                //0xc
    ULONG MinInstructions;                                                  //0x10
    ULONG MaxInstructions;                                                  //0x14
    ULONG TotalInstructions;                                                //0x18
}; 
//0x20 bytes (sizeof)
struct _DBGKD_GET_INTERNAL_BREAKPOINT64
{
    ULONGLONG BreakpointAddress;                                            //0x0
    ULONG Flags;                                                            //0x8
    ULONG Calls;                                                            //0xc
    ULONG MaxCallsPerPeriod;                                                //0x10
    ULONG MinInstructions;                                                  //0x14
    ULONG MaxInstructions;                                                  //0x18
    ULONG TotalInstructions;                                                //0x1c
}; 
//0x14 bytes (sizeof)
struct _DBGKD_GET_SET_BUS_DATA
{
    ULONG BusDataType;                                                      //0x0
    ULONG BusNumber;                                                        //0x4
    ULONG SlotNumber;                                                       //0x8
    ULONG Offset;                                                           //0xc
    ULONG Length;                                                           //0x10
}; 
//0x28 bytes (sizeof)
struct _DBGKD_GET_VERSION32
{
    USHORT MajorVersion;                                                    //0x0
    USHORT MinorVersion;                                                    //0x2
    USHORT ProtocolVersion;                                                 //0x4
    USHORT Flags;                                                           //0x6
    ULONG KernBase;                                                         //0x8
    ULONG PsLoadedModuleList;                                               //0xc
    USHORT MachineType;                                                     //0x10
    USHORT ThCallbackStack;                                                 //0x12
    USHORT NextCallback;                                                    //0x14
    USHORT FramePointer;                                                    //0x16
    ULONG KiCallUserMode;                                                   //0x18
    ULONG KeUserCallbackDispatcher;                                         //0x1c
    ULONG BreakpointWithStatus;                                             //0x20
    ULONG DebuggerDataList;                                                 //0x24
}; 
//0x28 bytes (sizeof)
struct _DBGKD_GET_VERSION64
{
    USHORT MajorVersion;                                                    //0x0
    USHORT MinorVersion;                                                    //0x2
    UCHAR ProtocolVersion;                                                  //0x4
    UCHAR KdSecondaryVersion;                                               //0x5
    USHORT Flags;                                                           //0x6
    USHORT MachineType;                                                     //0x8
    UCHAR MaxPacketType;                                                    //0xa
    UCHAR MaxStateChange;                                                   //0xb
    UCHAR MaxManipulate;                                                    //0xc
    UCHAR Simulation;                                                       //0xd
    USHORT Unused[1];                                                       //0xe
    ULONGLONG KernBase;                                                     //0x10
    ULONGLONG PsLoadedModuleList;                                           //0x18
    ULONGLONG DebuggerDataList;                                             //0x20
}; 
//0x18 bytes (sizeof)
struct _DBGKD_LOAD_SYMBOLS32
{
    ULONG PathNameLength;                                                   //0x0
    ULONG BaseOfDll;                                                        //0x4
    ULONG ProcessId;                                                        //0x8
    ULONG CheckSum;                                                         //0xc
    ULONG SizeOfImage;                                                      //0x10
    UCHAR UnloadSymbols;                                                    //0x14
};
//0x28 bytes (sizeof)
struct _DBGKD_LOAD_SYMBOLS64
{
    ULONG PathNameLength;                                                   //0x0
    ULONGLONG BaseOfDll;                                                    //0x8
    ULONGLONG ProcessId;                                                    //0x10
    ULONG CheckSum;                                                         //0x18
    ULONG SizeOfImage;                                                      //0x1c
    UCHAR UnloadSymbols;                                                    //0x20
};
//0x34 bytes (sizeof)
struct _DBGKD_MANIPULATE_STATE32
{
    ULONG ApiNumber;                                                        //0x0
    USHORT ProcessorLevel;                                                  //0x4
    USHORT Processor;                                                       //0x6
    LONG ReturnStatus;                                                      //0x8
    union
    {
        struct _DBGKD_READ_MEMORY32 ReadMemory;                             //0xc
        struct _DBGKD_WRITE_MEMORY32 WriteMemory;                           //0xc
        struct _DBGKD_READ_MEMORY64 ReadMemory64;                           //0xc
        struct _DBGKD_WRITE_MEMORY64 WriteMemory64;                         //0xc
        struct _DBGKD_GET_CONTEXT GetContext;                               //0xc
        struct _DBGKD_SET_CONTEXT SetContext;                               //0xc
        struct _DBGKD_WRITE_BREAKPOINT32 WriteBreakPoint;                   //0xc
        struct _DBGKD_RESTORE_BREAKPOINT RestoreBreakPoint;                 //0xc
        struct _DBGKD_CONTINUE Continue;                                    //0xc
        struct _DBGKD_CONTINUE2 Continue2;                                  //0xc
        struct _DBGKD_READ_WRITE_IO32 ReadWriteIo;                          //0xc
        struct _DBGKD_READ_WRITE_IO_EXTENDED32 ReadWriteIoExtended;         //0xc
        struct _DBGKD_QUERY_SPECIAL_CALLS QuerySpecialCalls;                //0xc
        struct _DBGKD_SET_SPECIAL_CALL32 SetSpecialCall;                    //0xc
        struct _DBGKD_SET_INTERNAL_BREAKPOINT32 SetInternalBreakpoint;      //0xc
        struct _DBGKD_GET_INTERNAL_BREAKPOINT32 GetInternalBreakpoint;      //0xc
        struct _DBGKD_GET_VERSION32 GetVersion32;                           //0xc
        struct _DBGKD_BREAKPOINTEX BreakPointEx;                            //0xc
        struct _DBGKD_READ_WRITE_MSR ReadWriteMsr;                          //0xc
        struct _DBGKD_SEARCH_MEMORY SearchMemory;                           //0xc
        struct _DBGKD_CONTEXT_EX GetContextEx;                              //0xc
        struct _DBGKD_CONTEXT_EX SetContextEx;                              //0xc
    } u;                                                                    //0xc
};
//0x38 bytes (sizeof)
struct _DBGKD_MANIPULATE_STATE64
{
    ULONG ApiNumber;                                                        //0x0
    USHORT ProcessorLevel;                                                  //0x4
    USHORT Processor;                                                       //0x6
    LONG ReturnStatus;                                                      //0x8
    union
    {
        struct _DBGKD_READ_MEMORY64 ReadMemory;                             //0x10
        struct _DBGKD_WRITE_MEMORY64 WriteMemory;                           //0x10
        struct _DBGKD_GET_CONTEXT GetContext;                               //0x10
        struct _DBGKD_SET_CONTEXT SetContext;                               //0x10
        struct _DBGKD_WRITE_BREAKPOINT64 WriteBreakPoint;                   //0x10
        struct _DBGKD_RESTORE_BREAKPOINT RestoreBreakPoint;                 //0x10
        struct _DBGKD_CONTINUE Continue;                                    //0x10
        struct _DBGKD_CONTINUE2 Continue2;                                  //0x10
        struct _DBGKD_READ_WRITE_IO64 ReadWriteIo;                          //0x10
        struct _DBGKD_READ_WRITE_IO_EXTENDED64 ReadWriteIoExtended;         //0x10
        struct _DBGKD_QUERY_SPECIAL_CALLS QuerySpecialCalls;                //0x10
        struct _DBGKD_SET_SPECIAL_CALL64 SetSpecialCall;                    //0x10
        struct _DBGKD_SET_INTERNAL_BREAKPOINT64 SetInternalBreakpoint;      //0x10
        struct _DBGKD_GET_INTERNAL_BREAKPOINT64 GetInternalBreakpoint;      //0x10
        struct _DBGKD_GET_VERSION64 GetVersion64;                           //0x10
        struct _DBGKD_BREAKPOINTEX BreakPointEx;                            //0x10
        struct _DBGKD_READ_WRITE_MSR ReadWriteMsr;                          //0x10
        struct _DBGKD_SEARCH_MEMORY SearchMemory;                           //0x10
        struct _DBGKD_GET_SET_BUS_DATA GetSetBusData;                       //0x10
        struct _DBGKD_FILL_MEMORY FillMemory;                               //0x10
        struct _DBGKD_QUERY_MEMORY QueryMemory;                             //0x10
        struct _DBGKD_SWITCH_PARTITION SwitchPartition;                     //0x10
        struct _DBGKD_CONTEXT_EX GetContextEx;                              //0x10
        struct _DBGKD_CONTEXT_EX SetContextEx;                              //0x10
        struct _DBGKD_WRITE_CUSTOM_BREAKPOINT WriteCustomBreakPoint;        //0x10
    } u;                                                                    //0x10
};
//0x18 bytes (sizeof)
struct _DBGKD_QUERY_MEMORY
{
    ULONGLONG Address;                                                      //0x0
    ULONGLONG Reserved;                                                     //0x8
    ULONG AddressSpace;                                                     //0x10
    ULONG Flags;                                                            //0x14
}; 
//0x4 bytes (sizeof)
struct _DBGKD_QUERY_SPECIAL_CALLS
{
    ULONG NumberOfSpecialCalls;                                             //0x0
}; 
//0xc bytes (sizeof)
struct _DBGKD_READ_MEMORY32
{
    ULONG TargetBaseAddress;                                                //0x0
    ULONG TransferCount;                                                    //0x4
    ULONG ActualBytesRead;                                                  //0x8
}; 
//0x10 bytes (sizeof)
struct _DBGKD_READ_MEMORY64
{
    ULONGLONG TargetBaseAddress;                                            //0x0
    ULONG TransferCount;                                                    //0x8
    ULONG ActualBytesRead;                                                  //0xc
}; 
//0xc bytes (sizeof)
struct _DBGKD_READ_WRITE_IO32
{
    ULONG DataSize;                                                         //0x0
    ULONG IoAddress;                                                        //0x4
    ULONG DataValue;                                                        //0x8
}; 
//0x10 bytes (sizeof)
struct _DBGKD_READ_WRITE_IO64
{
    ULONGLONG IoAddress;                                                    //0x0
    ULONG DataSize;                                                         //0x8
    ULONG DataValue;                                                        //0xc
}; 
//0x18 bytes (sizeof)
struct _DBGKD_READ_WRITE_IO_EXTENDED32
{
    ULONG DataSize;                                                         //0x0
    ULONG InterfaceType;                                                    //0x4
    ULONG BusNumber;                                                        //0x8
    ULONG AddressSpace;                                                     //0xc
    ULONG IoAddress;                                                        //0x10
    ULONG DataValue;                                                        //0x14
}; 
//0x20 bytes (sizeof)
struct _DBGKD_READ_WRITE_IO_EXTENDED64
{
    ULONG DataSize;                                                         //0x0
    ULONG InterfaceType;                                                    //0x4
    ULONG BusNumber;                                                        //0x8
    ULONG AddressSpace;                                                     //0xc
    ULONGLONG IoAddress;                                                    //0x10
    ULONG DataValue;                                                        //0x18
}; 
//0xc bytes (sizeof)
struct _DBGKD_READ_WRITE_MSR
{
    ULONG Msr;                                                              //0x0
    ULONG DataValueLow;                                                     //0x4
    ULONG DataValueHigh;                                                    //0x8
}; 
//0x4 bytes (sizeof)
struct _DBGKD_RESTORE_BREAKPOINT
{
    ULONG BreakPointHandle;                                                 //0x0
}; 
//0x18 bytes (sizeof)
struct _DBGKD_SEARCH_MEMORY
{
    union
    {
        ULONGLONG SearchAddress;                                            //0x0
        ULONGLONG FoundAddress;                                             //0x0
    };
    ULONGLONG SearchLength;                                                 //0x8
    ULONG PatternLength;                                                    //0x10
}; 
//0x4 bytes (sizeof)
struct _DBGKD_SET_CONTEXT
{
    ULONG ContextFlags;                                                     //0x0
}; 
//0x8 bytes (sizeof)
struct _DBGKD_SET_INTERNAL_BREAKPOINT32
{
    ULONG BreakpointAddress;                                                //0x0
    ULONG Flags;                                                            //0x4
}; 
//0x10 bytes (sizeof)
struct _DBGKD_SET_INTERNAL_BREAKPOINT64
{
    ULONGLONG BreakpointAddress;                                            //0x0
    ULONG Flags;                                                            //0x8
}; 
//0x4 bytes (sizeof)
struct _DBGKD_SET_SPECIAL_CALL32
{
    ULONG SpecialCall;                                                      //0x0
}; 
//0x8 bytes (sizeof)
struct _DBGKD_SET_SPECIAL_CALL64
{
    ULONGLONG SpecialCall;                                                  //0x0
}; 
//0x4 bytes (sizeof)
struct _DBGKD_SWITCH_PARTITION
{
    ULONG Partition;                                                        //0x0
}; 
//0x8 bytes (sizeof)
struct _DBGKD_WRITE_BREAKPOINT32
{
    ULONG BreakPointAddress;                                                //0x0
    ULONG BreakPointHandle;                                                 //0x4
}; 
//0x10 bytes (sizeof)
struct _DBGKD_WRITE_BREAKPOINT64
{
    ULONGLONG BreakPointAddress;                                            //0x0
    ULONG BreakPointHandle;                                                 //0x8
}; 
//0x18 bytes (sizeof)
struct _DBGKD_WRITE_CUSTOM_BREAKPOINT
{
    ULONGLONG BreakPointAddress;                                            //0x0
    ULONGLONG BreakPointInstruction;                                        //0x8
    ULONG BreakPointHandle;                                                 //0x10
    UCHAR BreakPointInstructionSize;                                        //0x14
    UCHAR BreakPointInstructionAlignment;                                   //0x15
}; 
//0xc bytes (sizeof)
struct _DBGKD_WRITE_MEMORY32
{
    ULONG TargetBaseAddress;                                                //0x0
    ULONG TransferCount;                                                    //0x4
    ULONG ActualBytesWritten;                                               //0x8
}; 
//0x10 bytes (sizeof)
struct _DBGKD_WRITE_MEMORY64
{
    ULONGLONG TargetBaseAddress;                                            //0x0
    ULONG TransferCount;                                                    //0x8
    ULONG ActualBytesWritten;                                               //0xc
}; 
//0x54 bytes (sizeof)
struct _DBGKM_EXCEPTION32
{
    struct _EXCEPTION_RECORD32 ExceptionRecord;                             //0x0
    ULONG FirstChance;                                                      //0x50
};
//0xa0 bytes (sizeof)
struct _DBGKM_EXCEPTION64
{
    struct _EXCEPTION_RECORD64 ExceptionRecord;                             //0x0
    ULONG FirstChance;                                                      //0x98
};
//0x0 bytes (sizeof)
struct _DBGKP_ERROR_PORT; 
//0x20 bytes (sizeof)
struct _DBGK_SILOSTATE
{
    struct _EX_PUSH_LOCK ErrorPortLock;                                     //0x0
    struct _DBGKP_ERROR_PORT* ErrorPort;                                    //0x8
    struct _EPROCESS* ErrorProcess;                                         //0x10
    struct _KEVENT* ErrorPortRegisteredEvent;                               //0x18
}; 
//0x50 bytes (sizeof)
struct _DEFERRED_WRITE
{
    SHORT NodeTypeCode;                                                     //0x0
    SHORT NodeByteSize;                                                     //0x2
    struct _FILE_OBJECT* FileObject;                                        //0x8
    ULONG BytesToWrite;                                                     //0x10
    struct _LIST_ENTRY DeferredWriteLinks;                                  //0x18
    struct _KEVENT* Event;                                                  //0x28
    VOID (*PostRoutine)(VOID* arg1, VOID* arg2);                            //0x30
    VOID* Context1;                                                         //0x38
    VOID* Context2;                                                         //0x40
    struct _CC_PARTITION* Partition;                                        //0x48
};
//0x18 bytes (sizeof)
struct _DELAY_ACK_FO
{
    struct _LIST_ENTRY Links;                                               //0x0
    struct _FILE_OBJECT* OriginalFileObject;                                //0x10
};
//0x40 bytes (sizeof)
struct _DEVICE_CAPABILITIES
{
    USHORT Size;                                                            //0x0
    USHORT Version;                                                         //0x2
    ULONG DeviceD1:1;                                                       //0x4
    ULONG DeviceD2:1;                                                       //0x4
    ULONG LockSupported:1;                                                  //0x4
    ULONG EjectSupported:1;                                                 //0x4
    ULONG Removable:1;                                                      //0x4
    ULONG DockDevice:1;                                                     //0x4
    ULONG UniqueID:1;                                                       //0x4
    ULONG SilentInstall:1;                                                  //0x4
    ULONG RawDeviceOK:1;                                                    //0x4
    ULONG SurpriseRemovalOK:1;                                              //0x4
    ULONG WakeFromD0:1;                                                     //0x4
    ULONG WakeFromD1:1;                                                     //0x4
    ULONG WakeFromD2:1;                                                     //0x4
    ULONG WakeFromD3:1;                                                     //0x4
    ULONG HardwareDisabled:1;                                               //0x4
    ULONG NonDynamic:1;                                                     //0x4
    ULONG WarmEjectSupported:1;                                             //0x4
    ULONG NoDisplayInUI:1;                                                  //0x4
    ULONG Reserved1:1;                                                      //0x4
    ULONG WakeFromInterrupt:1;                                              //0x4
    ULONG SecureDevice:1;                                                   //0x4
    ULONG Reserved:11;                                                      //0x4
    ULONG Address;                                                          //0x8
    ULONG UINumber;                                                         //0xc
    enum _DEVICE_POWER_STATE DeviceState[7];                                //0x10
    enum _SYSTEM_POWER_STATE SystemWake;                                    //0x2c
    enum _DEVICE_POWER_STATE DeviceWake;                                    //0x30
    ULONG D1Latency;                                                        //0x34
    ULONG D2Latency;                                                        //0x38
    ULONG D3Latency;                                                        //0x3c
}; 
//0x40 bytes (sizeof)
struct _DEVICE_DESCRIPTION
{
    ULONG Version;                                                          //0x0
    UCHAR Master;                                                           //0x4
    UCHAR ScatterGather;                                                    //0x5
    UCHAR DemandMode;                                                       //0x6
    UCHAR AutoInitialize;                                                   //0x7
    UCHAR Dma32BitAddresses;                                                //0x8
    UCHAR IgnoreCount;                                                      //0x9
    UCHAR Reserved1;                                                        //0xa
    UCHAR Dma64BitAddresses;                                                //0xb
    ULONG BusNumber;                                                        //0xc
    ULONG DmaChannel;                                                       //0x10
    enum _INTERFACE_TYPE InterfaceType;                                     //0x14
    enum _DMA_WIDTH DmaWidth;                                               //0x18
    enum _DMA_SPEED DmaSpeed;                                               //0x1c
    ULONG MaximumLength;                                                    //0x20
    ULONG DmaPort;                                                          //0x24
    ULONG DmaAddressWidth;                                                  //0x28
    ULONG DmaControllerInstance;                                            //0x2c
    ULONG DmaRequestLine;                                                   //0x30
    union _LARGE_INTEGER DeviceAddress;                                     //0x38
};
//0x48 bytes (sizeof)
struct _DEVICE_MAP
{
    struct _OBJECT_DIRECTORY* DosDevicesDirectory;                          //0x0
    struct _OBJECT_DIRECTORY* GlobalDosDevicesDirectory;                    //0x8
    VOID* DosDevicesDirectoryHandle;                                        //0x10
    volatile LONG ReferenceCount;                                           //0x18
    ULONG DriveMap;                                                         //0x1c
    UCHAR DriveType[32];                                                    //0x20
    struct _EJOB* ServerSilo;                                               //0x40
}; 
//0x2d8 bytes (sizeof)
struct _DEVICE_NODE
{
    struct _DEVICE_NODE* Sibling;                                           //0x0
    struct _DEVICE_NODE* Child;                                             //0x8
    struct _DEVICE_NODE* Parent;                                            //0x10
    struct _DEVICE_NODE* LastChild;                                         //0x18
    struct _DEVICE_OBJECT* PhysicalDeviceObject;                            //0x20
    struct _UNICODE_STRING InstancePath;                                    //0x28
    struct _UNICODE_STRING ServiceName;                                     //0x38
    struct _IRP* PendingIrp;                                                //0x48
    struct _POP_FX_DEVICE* FxDevice;                                        //0x50
    volatile LONG FxDeviceLock;                                             //0x58
    struct _KEVENT FxRemoveEvent;                                           //0x60
    volatile LONG FxActivationCount;                                        //0x78
    volatile LONG FxSleepCount;                                             //0x7c
    struct _POP_FX_PLUGIN* Plugin;                                          //0x80
    ULONG Level;                                                            //0x88
    union _POWER_STATE CurrentPowerState;                                   //0x8c
    struct _PO_DEVICE_NOTIFY Notify;                                        //0x90
    struct _PO_IRP_MANAGER PoIrpManager;                                    //0xf8
    struct _UNICODE_STRING UniqueId;                                        //0x118
    ULONG PowerFlags;                                                       //0x128
    enum _PNP_DEVNODE_STATE State;                                          //0x12c
    enum _PNP_DEVNODE_STATE PreviousState;                                  //0x130
    enum _PNP_DEVNODE_STATE StateHistory[20];                               //0x134
    ULONG StateHistoryEntry;                                                //0x184
    LONG CompletionStatus;                                                  //0x188
    ULONG Flags;                                                            //0x18c
    ULONG UserFlags;                                                        //0x190
    ULONG Problem;                                                          //0x194
    LONG ProblemStatus;                                                     //0x198
    struct _CM_RESOURCE_LIST* ResourceList;                                 //0x1a0
    struct _CM_RESOURCE_LIST* ResourceListTranslated;                       //0x1a8
    struct _DEVICE_OBJECT* DuplicatePDO;                                    //0x1b0
    struct _IO_RESOURCE_REQUIREMENTS_LIST* ResourceRequirements;            //0x1b8
    enum _INTERFACE_TYPE InterfaceType;                                     //0x1c0
    ULONG BusNumber;                                                        //0x1c4
    enum _INTERFACE_TYPE ChildInterfaceType;                                //0x1c8
    ULONG ChildBusNumber;                                                   //0x1cc
    USHORT ChildBusTypeIndex;                                               //0x1d0
    UCHAR RemovalPolicy;                                                    //0x1d2
    UCHAR HardwareRemovalPolicy;                                            //0x1d3
    struct _LIST_ENTRY TargetDeviceNotify;                                  //0x1d8
    struct _LIST_ENTRY DeviceArbiterList;                                   //0x1e8
    struct _LIST_ENTRY DeviceTranslatorList;                                //0x1f8
    USHORT NoTranslatorMask;                                                //0x208
    USHORT QueryTranslatorMask;                                             //0x20a
    USHORT NoArbiterMask;                                                   //0x20c
    USHORT QueryArbiterMask;                                                //0x20e
    union
    {
        struct _DEVICE_NODE* LegacyDeviceNode;                              //0x210
        struct _DEVICE_RELATIONS* PendingDeviceRelations;                   //0x210
        VOID* Information;                                                  //0x210
    } OverUsed1;                                                            //0x210
    union
    {
        struct _DEVICE_NODE* NextResourceDeviceNode;                        //0x218
    } OverUsed2;                                                            //0x218
    struct _CM_RESOURCE_LIST* BootResources;                                //0x220
    struct _CM_RESOURCE_LIST* BootResourcesTranslated;                      //0x228
    ULONG CapabilityFlags;                                                  //0x230
    struct
    {
        enum PROFILE_STATUS DockStatus;                                     //0x238
        struct _LIST_ENTRY ListEntry;                                       //0x240
        WCHAR* SerialNumber;                                                //0x250
    } DockInfo;                                                             //0x238
    ULONG DisableableDepends;                                               //0x258
    struct _LIST_ENTRY PendedSetInterfaceState;                             //0x260
    struct _LIST_ENTRY LegacyBusListEntry;                                  //0x270
    ULONG DriverUnloadRetryCount;                                           //0x280
    struct _DEVICE_NODE* PreviousParent;                                    //0x288
    LONG DeletedChildren;                                                   //0x290
    ULONG NumaNodeIndex;                                                    //0x294
    struct _GUID ContainerID;                                               //0x298
    UCHAR OverrideFlags;                                                    //0x2a8
    ULONG DeviceIdsHash;                                                    //0x2ac
    UCHAR RequiresUnloadedDriver;                                           //0x2b0
    struct _PENDING_RELATIONS_LIST_ENTRY* PendingEjectRelations;            //0x2b8
    ULONG StateFlags;                                                       //0x2c0
    struct _PNP_REBALANCE_TRACE_CONTEXT* RebalanceContext;                  //0x2c8
    struct _DEVICE_NODE_IOMMU_EXTENSION* IommuExtension;                    //0x2d0
}; 
//0x0 bytes (sizeof)
struct _DEVICE_NODE_IOMMU_EXTENSION; 
//0x150 bytes (sizeof)
struct _DEVICE_OBJECT
{
    SHORT Type;                                                             //0x0
    USHORT Size;                                                            //0x2
    LONG ReferenceCount;                                                    //0x4
    struct _DRIVER_OBJECT* DriverObject;                                    //0x8
    struct _DEVICE_OBJECT* NextDevice;                                      //0x10
    struct _DEVICE_OBJECT* AttachedDevice;                                  //0x18
    struct _IRP* CurrentIrp;                                                //0x20
    struct _IO_TIMER* Timer;                                                //0x28
    ULONG Flags;                                                            //0x30
    ULONG Characteristics;                                                  //0x34
    struct _VPB* Vpb;                                                       //0x38
    VOID* DeviceExtension;                                                  //0x40
    ULONG DeviceType;                                                       //0x48
    CHAR StackSize;                                                         //0x4c
    union
    {
        struct _LIST_ENTRY ListEntry;                                       //0x50
        struct _WAIT_CONTEXT_BLOCK Wcb;                                     //0x50
    } Queue;                                                                //0x50
    ULONG AlignmentRequirement;                                             //0x98
    struct _KDEVICE_QUEUE DeviceQueue;                                      //0xa0
    struct _KDPC Dpc;                                                       //0xc8
    ULONG ActiveThreadCount;                                                //0x108
    VOID* SecurityDescriptor;                                               //0x110
    struct _KEVENT DeviceLock;                                              //0x118
    USHORT SectorSize;                                                      //0x130
    USHORT Spare1;                                                          //0x132
    struct _DEVOBJ_EXTENSION* DeviceObjectExtension;                        //0x138
    VOID* Reserved;                                                         //0x140
}; 
//0x28 bytes (sizeof)
struct _DEVICE_OBJECT_LIST
{
    ULONG Count;                                                            //0x0
    ULONG MaxCount;                                                         //0x4
    ULONG TagCount;                                                         //0x8
    enum _PNP_DEVICE_DELETE_TYPE OperationCode;                             //0xc
    struct _DEVICE_OBJECT_LIST_ENTRY Devices[1];                            //0x10
}; 
//0x18 bytes (sizeof)
struct _DEVICE_OBJECT_LIST_ENTRY
{
    struct _DEVICE_OBJECT* DeviceObject;                                    //0x0
    enum _DEVICE_RELATION_LEVEL RelationLevel;                              //0x8
    ULONG Ordinal;                                                          //0xc
    ULONG Flags;                                                            //0x10
}; 
//0x60 bytes (sizeof)
struct _DEVICE_OBJECT_POWER_EXTENSION
{
    volatile ULONG IdleCount;                                               //0x0
    volatile ULONG BusyCount;                                               //0x4
    volatile ULONG BusyReference;                                           //0x8
    ULONG TotalBusyCount;                                                   //0xc
    ULONG ConservationIdleTime;                                             //0x10
    ULONG PerformanceIdleTime;                                              //0x14
    struct _DEVICE_OBJECT* DeviceObject;                                    //0x18
    struct _LIST_ENTRY IdleList;                                            //0x20
    enum _POP_DEVICE_IDLE_TYPE IdleType;                                    //0x30
    enum _DEVICE_POWER_STATE IdleState;                                     //0x34
    enum _DEVICE_POWER_STATE CurrentState;                                  //0x38
    struct _POP_COOLING_EXTENSION* CoolingExtension;                        //0x40
    struct _LIST_ENTRY Volume;                                              //0x48
    union
    {
        struct
        {
            ULONG IdleTime;                                                 //0x58
            ULONG NonIdleTime;                                              //0x5c
        } Disk;                                                             //0x58
    } Specific;                                                             //0x58
}; 
//0x10 bytes (sizeof)
struct _DEVICE_RELATIONS
{
    ULONG Count;                                                            //0x0
    struct _DEVICE_OBJECT* Objects[1];                                      //0x8
}; 
//0x68 bytes (sizeof)
struct _DEVOBJ_EXTENSION
{
    SHORT Type;                                                             //0x0
    USHORT Size;                                                            //0x2
    struct _DEVICE_OBJECT* DeviceObject;                                    //0x8
    ULONG PowerFlags;                                                       //0x10
    struct _DEVICE_OBJECT_POWER_EXTENSION* Dope;                            //0x18
    ULONG ExtensionFlags;                                                   //0x20
    VOID* DeviceNode;                                                       //0x28
    struct _DEVICE_OBJECT* AttachedTo;                                      //0x30
    LONG StartIoCount;                                                      //0x38
    LONG StartIoKey;                                                        //0x3c
    ULONG StartIoFlags;                                                     //0x40
    struct _VPB* Vpb;                                                       //0x48
    VOID* DependencyNode;                                                   //0x50
    VOID* InterruptContext;                                                 //0x58
    VOID* VerifierContext;                                                  //0x60
}; 
//0x28 bytes (sizeof)
struct _DIAGNOSTIC_BUFFER
{
    ULONGLONG Size;                                                         //0x0
    enum _REQUESTER_TYPE CallerType;                                        //0x8
    union
    {
        struct
        {
            ULONGLONG ProcessImageNameOffset;                               //0x10
            ULONG ProcessId;                                                //0x18
            ULONG ServiceTag;                                               //0x1c
        };
        struct
        {
            ULONGLONG DeviceDescriptionOffset;                              //0x10
            ULONGLONG DevicePathOffset;                                     //0x18
        };
    };
    ULONGLONG ReasonOffset;                                                 //0x20
}; 
//0x20 bytes (sizeof)
struct _DIAGNOSTIC_CONTEXT
{
    enum _REQUESTER_TYPE CallerType;                                        //0x0
    union
    {
        struct
        {
            struct _EPROCESS* Process;                                      //0x8
            ULONG ServiceTag;                                               //0x10
        };
        struct _DEVICE_OBJECT* DeviceObject;                                //0x8
    };
    ULONGLONG ReasonSize;                                                   //0x18
}; 
//0x18 bytes (sizeof)
struct _DIRTY_PAGE_STATISTICS
{
    ULONGLONG DirtyPages;                                                   //0x0
    ULONGLONG DirtyPagesLastScan;                                           //0x8
    ULONG DirtyPagesScheduledLastScan;                                      //0x10
}; 
//0x38 bytes (sizeof)
struct _DIRTY_PAGE_THRESHOLDS
{
    ULONGLONG DirtyPageThreshold;                                           //0x0
    ULONGLONG DirtyPageThresholdTop;                                        //0x8
    ULONGLONG DirtyPageThresholdBottom;                                     //0x10
    ULONG DirtyPageTarget;                                                  //0x18
    ULONGLONG AggregateAvailablePages;                                      //0x20
    ULONGLONG AggregateDirtyPages;                                          //0x28
    ULONG AvailableHistory;                                                 //0x30
}; 
//0x10 bytes (sizeof)
struct _DISALLOWED_GUIDS
{
    USHORT Count;                                                           //0x0
    struct _GUID* Guids;                                                    //0x8
}; 
//0x18 bytes (sizeof)
struct _DISPATCHER_HEADER
{
    union
    {
        volatile LONG Lock;                                                 //0x0
        LONG LockNV;                                                        //0x0
        struct
        {
            UCHAR Type;                                                     //0x0
            UCHAR Signalling;                                               //0x1
            UCHAR Size;                                                     //0x2
            UCHAR Reserved1;                                                //0x3
        };
        struct
        {
            UCHAR TimerType;                                                //0x0
            union
            {
                UCHAR TimerControlFlags;                                    //0x1
                struct
                {
                    UCHAR Absolute:1;                                       //0x1
                    UCHAR Wake:1;                                           //0x1
                    UCHAR EncodedTolerableDelay:6;                          //0x1
                };
            };
            UCHAR Hand;                                                     //0x2
            union
            {
                UCHAR TimerMiscFlags;                                       //0x3
                struct
                {
                    UCHAR Index:6;                                          //0x3
                    UCHAR Inserted:1;                                       //0x3
                    volatile UCHAR Expired:1;                               //0x3
                };
            };
        };
        struct
        {
            UCHAR Timer2Type;                                               //0x0
            union
            {
                UCHAR Timer2Flags;                                          //0x1
                struct
                {
                    UCHAR Timer2Inserted:1;                                 //0x1
                    UCHAR Timer2Expiring:1;                                 //0x1
                    UCHAR Timer2CancelPending:1;                            //0x1
                    UCHAR Timer2SetPending:1;                               //0x1
                    UCHAR Timer2Running:1;                                  //0x1
                    UCHAR Timer2Disabled:1;                                 //0x1
                    UCHAR Timer2ReservedFlags:2;                            //0x1
                };
            };
            UCHAR Timer2ComponentId;                                        //0x2
            UCHAR Timer2RelativeId;                                         //0x3
        };
        struct
        {
            UCHAR QueueType;                                                //0x0
            union
            {
                UCHAR QueueControlFlags;                                    //0x1
                struct
                {
                    UCHAR Abandoned:1;                                      //0x1
                    UCHAR DisableIncrement:1;                               //0x1
                    UCHAR QueueReservedControlFlags:6;                      //0x1
                };
            };
            UCHAR QueueSize;                                                //0x2
            UCHAR QueueReserved;                                            //0x3
        };
        struct
        {
            UCHAR ThreadType;                                               //0x0
            UCHAR ThreadReserved;                                           //0x1
            union
            {
                UCHAR ThreadControlFlags;                                   //0x2
                struct
                {
                    UCHAR CycleProfiling:1;                                 //0x2
                    UCHAR CounterProfiling:1;                               //0x2
                    UCHAR GroupScheduling:1;                                //0x2
                    UCHAR AffinitySet:1;                                    //0x2
                    UCHAR Tagged:1;                                         //0x2
                    UCHAR EnergyProfiling:1;                                //0x2
                    UCHAR ThreadReservedControlFlags:2;                     //0x2
                };
            };
            union
            {
                UCHAR DebugActive;                                          //0x3
                struct
                {
                    UCHAR ActiveDR7:1;                                      //0x3
                    UCHAR Instrumented:1;                                   //0x3
                    UCHAR Minimal:1;                                        //0x3
                    UCHAR Reserved4:3;                                      //0x3
                    UCHAR UmsScheduled:1;                                   //0x3
                    UCHAR UmsPrimary:1;                                     //0x3
                };
            };
        };
        struct
        {
            UCHAR MutantType;                                               //0x0
            UCHAR MutantSize;                                               //0x1
            UCHAR DpcActive;                                                //0x2
            UCHAR MutantReserved;                                           //0x3
        };
    };
    LONG SignalState;                                                       //0x4
    struct _LIST_ENTRY WaitListHead;                                        //0x8
}; 
//0x50 bytes (sizeof)
struct _DRIVER_EXTENSION
{
    struct _DRIVER_OBJECT* DriverObject;                                    //0x0
    LONG (*AddDevice)(struct _DRIVER_OBJECT* arg1, struct _DEVICE_OBJECT* arg2); //0x8
    ULONG Count;                                                            //0x10
    struct _UNICODE_STRING ServiceKeyName;                                  //0x18
    struct _IO_CLIENT_EXTENSION* ClientDriverExtension;                     //0x28
    struct _FS_FILTER_CALLBACKS* FsFilterCallbacks;                         //0x30
    VOID* KseCallbacks;                                                     //0x38
    VOID* DvCallbacks;                                                      //0x40
    VOID* VerifierContext;                                                  //0x48
}; 
//0x150 bytes (sizeof)
struct _DRIVER_OBJECT
{
    SHORT Type;                                                             //0x0
    SHORT Size;                                                             //0x2
    struct _DEVICE_OBJECT* DeviceObject;                                    //0x8
    ULONG Flags;                                                            //0x10
    VOID* DriverStart;                                                      //0x18
    ULONG DriverSize;                                                       //0x20
    VOID* DriverSection;                                                    //0x28
    struct _DRIVER_EXTENSION* DriverExtension;                              //0x30
    struct _UNICODE_STRING DriverName;                                      //0x38
    struct _UNICODE_STRING* HardwareDatabase;                               //0x48
    struct _FAST_IO_DISPATCH* FastIoDispatch;                               //0x50
    LONG (*DriverInit)(struct _DRIVER_OBJECT* arg1, struct _UNICODE_STRING* arg2); //0x58
    VOID (*DriverStartIo)(struct _DEVICE_OBJECT* arg1, struct _IRP* arg2);  //0x60
    VOID (*DriverUnload)(struct _DRIVER_OBJECT* arg1);                      //0x68
    LONG (*MajorFunction[28])(struct _DEVICE_OBJECT* arg1, struct _IRP* arg2); //0x70
}; 
//0x278 bytes (sizeof)
struct _DUAL
{
    ULONG Length;                                                           //0x0
    struct _HMAP_DIRECTORY* Map;                                            //0x8
    struct _HMAP_TABLE* SmallDir;                                           //0x10
    ULONG Guard;                                                            //0x18
    struct _FREE_DISPLAY FreeDisplay[24];                                   //0x20
    struct _LIST_ENTRY FreeBins;                                            //0x260
    ULONG FreeSummary;                                                      //0x270
}; 
//0x110 bytes (sizeof)
struct _DUMMY_FILE_OBJECT
{
    struct _OBJECT_HEADER ObjectHeader;                                     //0x0
    CHAR FileObjectBody[216];                                               //0x38
}; 
//0x108 bytes (sizeof)
struct _DUMP_INITIALIZATION_CONTEXT
{
    ULONG Length;                                                           //0x0
    ULONG Reserved;                                                         //0x4
    VOID* MemoryBlock;                                                      //0x8
    VOID* CommonBuffer[2];                                                  //0x10
    union _LARGE_INTEGER PhysicalAddress[2];                                //0x20
    VOID (*StallRoutine)(ULONG arg1);                                       //0x30
    UCHAR (*OpenRoutine)(union _LARGE_INTEGER arg1);                        //0x38
    LONG (*WriteRoutine)(union _LARGE_INTEGER* arg1, struct _MDL* arg2);    //0x40
    VOID (*FinishRoutine)();                                                //0x48
    struct _ADAPTER_OBJECT* AdapterObject;                                  //0x50
    VOID* MappedRegisterBase;                                               //0x58
    VOID* PortConfiguration;                                                //0x60
    UCHAR CrashDump;                                                        //0x68
    UCHAR MarkMemoryOnly;                                                   //0x69
    UCHAR HiberResume;                                                      //0x6a
    UCHAR Reserved1;                                                        //0x6b
    ULONG MaximumTransferSize;                                              //0x6c
    ULONG CommonBufferSize;                                                 //0x70
    VOID* TargetAddress;                                                    //0x78
    LONG (*WritePendingRoutine)(LONG arg1, union _LARGE_INTEGER* arg2, struct _MDL* arg3, VOID* arg4); //0x80
    ULONG PartitionStyle;                                                   //0x88
    union
    {
        struct
        {
            ULONG Signature;                                                //0x8c
            ULONG CheckSum;                                                 //0x90
        } Mbr;                                                              //0x8c
        struct
        {
            struct _GUID DiskId;                                            //0x8c
        } Gpt;                                                              //0x8c
    } DiskInfo;                                                             //0x8c
    LONG (*ReadRoutine)(LONG arg1, union _LARGE_INTEGER* arg2, struct _MDL* arg3); //0xa0
    LONG (*GetDriveTelemetryRoutine)(ULONG arg1, ULONG arg2, VOID* arg3, ULONG arg4); //0xa8
    ULONG LogSectionTruncateSize;                                           //0xb0
    ULONG Parameters[16];                                                   //0xb4
    VOID (*GetTransferSizesRoutine)(ULONG* arg1, ULONG* arg2);              //0xf8
    VOID (*DumpNotifyRoutine)(enum _DUMP_EVENTS arg1, VOID* arg2, ULONG arg3); //0x100
}; 
//0x178 bytes (sizeof)
struct _DUMP_STACK_CONTEXT
{
    struct _DUMP_INITIALIZATION_CONTEXT Init;                               //0x0
    union _LARGE_INTEGER PartitionOffset;                                   //0x108
    union
    {
        VOID* DumpPointers;                                                 //0x110
        VOID* StorageInfo;                                                  //0x110
    };
    UCHAR UseStorageInfo;                                                   //0x118
    ULONG PointersLength;                                                   //0x11c
    WCHAR* ModulePrefix;                                                    //0x120
    struct _LIST_ENTRY DriverList;                                          //0x128
    struct _STRING InitMsg;                                                 //0x138
    struct _STRING ProgMsg;                                                 //0x148
    struct _STRING DoneMsg;                                                 //0x158
    VOID* FileObject;                                                       //0x168
    enum _DEVICE_USAGE_NOTIFICATION_TYPE UsageType;                         //0x170
}; 
//0x70 bytes (sizeof)
struct _DYNAMIC_FUNCTION_TABLE
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    struct _IMAGE_RUNTIME_FUNCTION_ENTRY* FunctionTable;                    //0x10
    union _LARGE_INTEGER TimeStamp;                                         //0x18
    ULONGLONG MinimumAddress;                                               //0x20
    ULONGLONG MaximumAddress;                                               //0x28
    ULONGLONG BaseAddress;                                                  //0x30
    struct _IMAGE_RUNTIME_FUNCTION_ENTRY* (*Callback)(ULONGLONG arg1, VOID* arg2); //0x38
    VOID* Context;                                                          //0x40
    WCHAR* OutOfProcessCallbackDll;                                         //0x48
    enum _FUNCTION_TABLE_TYPE Type;                                         //0x50
    ULONG EntryCount;                                                       //0x54
    struct _RTL_BALANCED_NODE TreeNode;                                     //0x58
}; 
//0x18 bytes (sizeof)
struct _ECP_LIST
{
    ULONG Signature;                                                        //0x0
    ULONG Flags;                                                            //0x4
    struct _LIST_ENTRY EcpList;                                             //0x8
}; 
//0x620 bytes (sizeof)
struct _EJOB
{
    struct _KEVENT Event;                                                   //0x0
    struct _LIST_ENTRY JobLinks;                                            //0x18
    struct _LIST_ENTRY ProcessListHead;                                     //0x28
    struct _ERESOURCE JobLock;                                              //0x38
    union _LARGE_INTEGER TotalUserTime;                                     //0xa0
    union _LARGE_INTEGER TotalKernelTime;                                   //0xa8
    union _LARGE_INTEGER TotalCycleTime;                                    //0xb0
    union _LARGE_INTEGER ThisPeriodTotalUserTime;                           //0xb8
    union _LARGE_INTEGER ThisPeriodTotalKernelTime;                         //0xc0
    ULONGLONG TotalContextSwitches;                                         //0xc8
    ULONG TotalPageFaultCount;                                              //0xd0
    ULONG TotalProcesses;                                                   //0xd4
    ULONG ActiveProcesses;                                                  //0xd8
    ULONG TotalTerminatedProcesses;                                         //0xdc
    union _LARGE_INTEGER PerProcessUserTimeLimit;                           //0xe0
    union _LARGE_INTEGER PerJobUserTimeLimit;                               //0xe8
    ULONGLONG MinimumWorkingSetSize;                                        //0xf0
    ULONGLONG MaximumWorkingSetSize;                                        //0xf8
    ULONG LimitFlags;                                                       //0x100
    ULONG ActiveProcessLimit;                                               //0x104
    struct _KAFFINITY_EX Affinity;                                          //0x108
    struct _JOB_ACCESS_STATE* AccessState;                                  //0x1b0
    VOID* AccessStateQuotaReference;                                        //0x1b8
    ULONG UIRestrictionsClass;                                              //0x1c0
    ULONG EndOfJobTimeAction;                                               //0x1c4
    VOID* CompletionPort;                                                   //0x1c8
    VOID* CompletionKey;                                                    //0x1d0
    ULONGLONG CompletionCount;                                              //0x1d8
    ULONG SessionId;                                                        //0x1e0
    ULONG SchedulingClass;                                                  //0x1e4
    ULONGLONG ReadOperationCount;                                           //0x1e8
    ULONGLONG WriteOperationCount;                                          //0x1f0
    ULONGLONG OtherOperationCount;                                          //0x1f8
    ULONGLONG ReadTransferCount;                                            //0x200
    ULONGLONG WriteTransferCount;                                           //0x208
    ULONGLONG OtherTransferCount;                                           //0x210
    struct _PROCESS_DISK_COUNTERS DiskIoInfo;                               //0x218
    ULONGLONG ProcessMemoryLimit;                                           //0x240
    ULONGLONG JobMemoryLimit;                                               //0x248
    ULONGLONG JobTotalMemoryLimit;                                          //0x250
    ULONGLONG PeakProcessMemoryUsed;                                        //0x258
    ULONGLONG PeakJobMemoryUsed;                                            //0x260
    struct _KAFFINITY_EX EffectiveAffinity;                                 //0x268
    union _LARGE_INTEGER EffectivePerProcessUserTimeLimit;                  //0x310
    ULONGLONG EffectiveMinimumWorkingSetSize;                               //0x318
    ULONGLONG EffectiveMaximumWorkingSetSize;                               //0x320
    ULONGLONG EffectiveProcessMemoryLimit;                                  //0x328
    struct _EJOB* EffectiveProcessMemoryLimitJob;                           //0x330
    struct _EJOB* EffectivePerProcessUserTimeLimitJob;                      //0x338
    struct _EJOB* EffectiveNetIoRateLimitJob;                               //0x340
    struct _EJOB* EffectiveHeapAttributionJob;                              //0x348
    ULONG EffectiveLimitFlags;                                              //0x350
    ULONG EffectiveSchedulingClass;                                         //0x354
    ULONG EffectiveFreezeCount;                                             //0x358
    ULONG EffectiveBackgroundCount;                                         //0x35c
    ULONG EffectiveSwapCount;                                               //0x360
    ULONG EffectiveNotificationLimitCount;                                  //0x364
    UCHAR EffectivePriorityClass;                                           //0x368
    UCHAR PriorityClass;                                                    //0x369
    UCHAR NestingDepth;                                                     //0x36a
    UCHAR Reserved1[1];                                                     //0x36b
    ULONG CompletionFilter;                                                 //0x36c
    union
    {
        struct _WNF_STATE_NAME WakeChannel;                                 //0x370
        struct _PS_JOB_WAKE_INFORMATION WakeInfo;                           //0x370
    };
    struct _JOBOBJECT_WAKE_FILTER WakeFilter;                               //0x3b8
    ULONG LowEdgeLatchFilter;                                               //0x3c0
    struct _EJOB* NotificationLink;                                         //0x3c8
    ULONGLONG CurrentJobMemoryUsed;                                         //0x3d0
    struct _JOB_NOTIFICATION_INFORMATION* NotificationInfo;                 //0x3d8
    VOID* NotificationInfoQuotaReference;                                   //0x3e0
    struct _IO_MINI_COMPLETION_PACKET_USER* NotificationPacket;             //0x3e8
    struct _JOB_CPU_RATE_CONTROL* CpuRateControl;                           //0x3f0
    VOID* EffectiveSchedulingGroup;                                         //0x3f8
    ULONGLONG ReadyTime;                                                    //0x400
    struct _EX_PUSH_LOCK MemoryLimitsLock;                                  //0x408
    struct _LIST_ENTRY SiblingJobLinks;                                     //0x410
    struct _LIST_ENTRY ChildJobListHead;                                    //0x420
    struct _EJOB* ParentJob;                                                //0x430
    struct _EJOB* volatile RootJob;                                         //0x438
    struct _LIST_ENTRY IteratorListHead;                                    //0x440
    ULONGLONG AncestorCount;                                                //0x450
    union
    {
        struct _EJOB** Ancestors;                                           //0x458
        VOID* SessionObject;                                                //0x458
    };
    struct _EPROCESS_VALUES Accounting;                                     //0x460
    ULONG ShadowActiveProcessCount;                                         //0x4b8
    ULONG ActiveAuxiliaryProcessCount;                                      //0x4bc
    ULONG SequenceNumber;                                                   //0x4c0
    ULONG JobId;                                                            //0x4c4
    struct _GUID ContainerId;                                               //0x4c8
    struct _GUID ContainerTelemetryId;                                      //0x4d8
    struct _ESERVERSILO_GLOBALS* ServerSiloGlobals;                         //0x4e8
    struct _PS_PROPERTY_SET PropertySet;                                    //0x4f0
    struct _PSP_STORAGE* Storage;                                           //0x508
    struct _JOB_NET_RATE_CONTROL* NetRateControl;                           //0x510
    union
    {
        ULONG JobFlags;                                                     //0x518
        struct
        {
            ULONG CloseDone:1;                                              //0x518
            ULONG MultiGroup:1;                                             //0x518
            ULONG OutstandingNotification:1;                                //0x518
            ULONG NotificationInProgress:1;                                 //0x518
            ULONG UILimits:1;                                               //0x518
            ULONG CpuRateControlActive:1;                                   //0x518
            ULONG OwnCpuRateControl:1;                                      //0x518
            ULONG Terminating:1;                                            //0x518
            ULONG WorkingSetLock:1;                                         //0x518
            ULONG JobFrozen:1;                                              //0x518
            ULONG Background:1;                                             //0x518
            ULONG WakeNotificationAllocated:1;                              //0x518
            ULONG WakeNotificationEnabled:1;                                //0x518
            ULONG WakeNotificationPending:1;                                //0x518
            ULONG LimitNotificationRequired:1;                              //0x518
            ULONG ZeroCountNotificationRequired:1;                          //0x518
            ULONG CycleTimeNotificationRequired:1;                          //0x518
            ULONG CycleTimeNotificationPending:1;                           //0x518
            ULONG TimersVirtualized:1;                                      //0x518
            ULONG JobSwapped:1;                                             //0x518
            ULONG ViolationDetected:1;                                      //0x518
            ULONG EmptyJobNotified:1;                                       //0x518
            ULONG NoSystemCharge:1;                                         //0x518
            ULONG DropNoWakeCharges:1;                                      //0x518
            ULONG NoWakeChargePolicyDecided:1;                              //0x518
            ULONG NetRateControlActive:1;                                   //0x518
            ULONG OwnNetRateControl:1;                                      //0x518
            ULONG IoRateControlActive:1;                                    //0x518
            ULONG OwnIoRateControl:1;                                       //0x518
            ULONG DisallowNewProcesses:1;                                   //0x518
            ULONG Silo:1;                                                   //0x518
            ULONG ContainerTelemetryIdSet:1;                                //0x518
        };
    };
    union
    {
        ULONG JobFlags2;                                                    //0x51c
        struct
        {
            ULONG ParentLocked:1;                                           //0x51c
            ULONG EnableUsermodeSiloThreadImpersonation:1;                  //0x51c
            ULONG DisallowUsermodeSiloThreadImpersonation:1;                //0x51c
        };
    };
    struct _PROCESS_EXTENDED_ENERGY_VALUES* EnergyValues;                   //0x520
    volatile ULONGLONG SharedCommitCharge;                                  //0x528
    ULONG DiskIoAttributionUserRefCount;                                    //0x530
    ULONG DiskIoAttributionRefCount;                                        //0x534
    union
    {
        VOID* DiskIoAttributionContext;                                     //0x538
        struct _EJOB* DiskIoAttributionOwnerJob;                            //0x538
    };
    struct _JOB_RATE_CONTROL_HEADER IoRateControlHeader;                    //0x540
    struct _PS_IO_CONTROL_ENTRY GlobalIoControl;                            //0x568
    volatile LONG IoControlStateLock;                                       //0x5a0
    struct _RTL_RB_TREE VolumeIoControlTree;                                //0x5a8
    ULONGLONG IoRateOverQuotaHistory;                                       //0x5b8
    ULONG IoRateCurrentGeneration;                                          //0x5c0
    ULONG IoRateLastQueryGeneration;                                        //0x5c4
    ULONG IoRateGenerationLength;                                           //0x5c8
    ULONG IoRateOverQuotaNotifySequenceId;                                  //0x5cc
    ULONGLONG LastThrottledIoTime;                                          //0x5d0
    struct _EX_PUSH_LOCK IoControlLock;                                     //0x5d8
    ULONGLONG SiloHardReferenceCount;                                       //0x5e0
    struct _WORK_QUEUE_ITEM RundownWorkItem;                                //0x5e8
    VOID* PartitionObject;                                                  //0x608
    struct _EJOB* PartitionOwnerJob;                                        //0x610
    union _JOBOBJECT_ENERGY_TRACKING_STATE EnergyTrackingState;             //0x618
}; 
//0x180 bytes (sizeof)
struct _ENODE
{
    struct _KNODE Ncb;                                                      //0x0
    struct _WORK_QUEUE_ITEM HotAddProcessorWorkItem;                        //0x140
}; 
//0x80 bytes (sizeof)
struct _EPARTITION
{
    VOID* MmPartition;                                                      //0x0
    VOID* CcPartition;                                                      //0x8
    VOID* ExPartition;                                                      //0x10
    LONGLONG HardReferenceCount;                                            //0x18
    LONGLONG OpenHandleCount;                                               //0x20
    struct _LIST_ENTRY ActivePartitionLinks;                                //0x28
    struct _EPARTITION* ParentPartition;                                    //0x38
    struct _WORK_QUEUE_ITEM TeardownWorkItem;                               //0x40
    struct _EX_PUSH_LOCK TeardownLock;                                      //0x60
    struct _EPROCESS* SystemProcess;                                        //0x68
    VOID* SystemProcessHandle;                                              //0x70
    union
    {
        ULONG PartitionFlags;                                               //0x78
        ULONG PairedWithJob:1;                                              //0x78
    };
    ULONG Padding;                                                          //0x7c
}; 
//0x838 bytes (sizeof)
struct _EPROCESS
{
    struct _KPROCESS Pcb;                                                   //0x0
    struct _EX_PUSH_LOCK ProcessLock;                                       //0x2d8
    VOID* UniqueProcessId;                                                  //0x2e0
    struct _LIST_ENTRY ActiveProcessLinks;                                  //0x2e8
    struct _EX_RUNDOWN_REF RundownProtect;                                  //0x2f8
    union
    {
        ULONG Flags2;                                                       //0x300
        struct
        {
            ULONG JobNotReallyActive:1;                                     //0x300
            ULONG AccountingFolded:1;                                       //0x300
            ULONG NewProcessReported:1;                                     //0x300
            ULONG ExitProcessReported:1;                                    //0x300
            ULONG ReportCommitChanges:1;                                    //0x300
            ULONG LastReportMemory:1;                                       //0x300
            ULONG ForceWakeCharge:1;                                        //0x300
            ULONG CrossSessionCreate:1;                                     //0x300
            ULONG NeedsHandleRundown:1;                                     //0x300
            ULONG RefTraceEnabled:1;                                        //0x300
            ULONG PicoCreated:1;                                            //0x300
            ULONG EmptyJobEvaluated:1;                                      //0x300
            ULONG DefaultPagePriority:3;                                    //0x300
            ULONG PrimaryTokenFrozen:1;                                     //0x300
            ULONG ProcessVerifierTarget:1;                                  //0x300
            ULONG RestrictSetThreadContext:1;                               //0x300
            ULONG AffinityPermanent:1;                                      //0x300
            ULONG AffinityUpdateEnable:1;                                   //0x300
            ULONG PropagateNode:1;                                          //0x300
            ULONG ExplicitAffinity:1;                                       //0x300
            ULONG ProcessExecutionState:2;                                  //0x300
            ULONG EnableReadVmLogging:1;                                    //0x300
            ULONG EnableWriteVmLogging:1;                                   //0x300
            ULONG FatalAccessTerminationRequested:1;                        //0x300
            ULONG DisableSystemAllowedCpuSet:1;                             //0x300
            ULONG ProcessStateChangeRequest:2;                              //0x300
            ULONG ProcessStateChangeInProgress:1;                           //0x300
            ULONG InPrivate:1;                                              //0x300
        };
    };
    union
    {
        ULONG Flags;                                                        //0x304
        struct
        {
            ULONG CreateReported:1;                                         //0x304
            ULONG NoDebugInherit:1;                                         //0x304
            ULONG ProcessExiting:1;                                         //0x304
            ULONG ProcessDelete:1;                                          //0x304
            ULONG ManageExecutableMemoryWrites:1;                           //0x304
            ULONG VmDeleted:1;                                              //0x304
            ULONG OutswapEnabled:1;                                         //0x304
            ULONG Outswapped:1;                                             //0x304
            ULONG FailFastOnCommitFail:1;                                   //0x304
            ULONG Wow64VaSpace4Gb:1;                                        //0x304
            ULONG AddressSpaceInitialized:2;                                //0x304
            ULONG SetTimerResolution:1;                                     //0x304
            ULONG BreakOnTermination:1;                                     //0x304
            ULONG DeprioritizeViews:1;                                      //0x304
            ULONG WriteWatch:1;                                             //0x304
            ULONG ProcessInSession:1;                                       //0x304
            ULONG OverrideAddressSpace:1;                                   //0x304
            ULONG HasAddressSpace:1;                                        //0x304
            ULONG LaunchPrefetched:1;                                       //0x304
            ULONG Background:1;                                             //0x304
            ULONG VmTopDown:1;                                              //0x304
            ULONG ImageNotifyDone:1;                                        //0x304
            ULONG PdeUpdateNeeded:1;                                        //0x304
            ULONG VdmAllowed:1;                                             //0x304
            ULONG ProcessRundown:1;                                         //0x304
            ULONG ProcessInserted:1;                                        //0x304
            ULONG DefaultIoPriority:3;                                      //0x304
            ULONG ProcessSelfDelete:1;                                      //0x304
            ULONG SetTimerResolutionLink:1;                                 //0x304
        };
    };
    union _LARGE_INTEGER CreateTime;                                        //0x308
    ULONGLONG ProcessQuotaUsage[2];                                         //0x310
    ULONGLONG ProcessQuotaPeak[2];                                          //0x320
    ULONGLONG PeakVirtualSize;                                              //0x330
    ULONGLONG VirtualSize;                                                  //0x338
    struct _LIST_ENTRY SessionProcessLinks;                                 //0x340
    union
    {
        VOID* ExceptionPortData;                                            //0x350
        ULONGLONG ExceptionPortValue;                                       //0x350
        ULONGLONG ExceptionPortState:3;                                     //0x350
    };
    struct _EX_FAST_REF Token;                                              //0x358
    ULONGLONG MmReserved;                                                   //0x360
    struct _EX_PUSH_LOCK AddressCreationLock;                               //0x368
    struct _EX_PUSH_LOCK PageTableCommitmentLock;                           //0x370
    struct _ETHREAD* RotateInProgress;                                      //0x378
    struct _ETHREAD* ForkInProgress;                                        //0x380
    struct _EJOB* volatile CommitChargeJob;                                 //0x388
    struct _RTL_AVL_TREE CloneRoot;                                         //0x390
    volatile ULONGLONG NumberOfPrivatePages;                                //0x398
    volatile ULONGLONG NumberOfLockedPages;                                 //0x3a0
    VOID* Win32Process;                                                     //0x3a8
    struct _EJOB* volatile Job;                                             //0x3b0
    VOID* SectionObject;                                                    //0x3b8
    VOID* SectionBaseAddress;                                               //0x3c0
    ULONG Cookie;                                                           //0x3c8
    struct _PAGEFAULT_HISTORY* WorkingSetWatch;                             //0x3d0
    VOID* Win32WindowStation;                                               //0x3d8
    VOID* InheritedFromUniqueProcessId;                                     //0x3e0
    VOID* LdtInformation;                                                   //0x3e8
    volatile ULONGLONG OwnerProcessId;                                      //0x3f0
    struct _PEB* Peb;                                                       //0x3f8
    struct _MM_SESSION_SPACE* Session;                                      //0x400
    VOID* AweInfo;                                                          //0x408
    struct _EPROCESS_QUOTA_BLOCK* QuotaBlock;                               //0x410
    struct _HANDLE_TABLE* ObjectTable;                                      //0x418
    VOID* DebugPort;                                                        //0x420
    struct _EWOW64PROCESS* WoW64Process;                                    //0x428
    VOID* DeviceMap;                                                        //0x430
    VOID* EtwDataSource;                                                    //0x438
    ULONGLONG PageDirectoryPte;                                             //0x440
    struct _FILE_OBJECT* ImageFilePointer;                                  //0x448
    UCHAR ImageFileName[15];                                                //0x450
    UCHAR PriorityClass;                                                    //0x45f
    VOID* SecurityPort;                                                     //0x460
    struct _SE_AUDIT_PROCESS_CREATION_INFO SeAuditProcessCreationInfo;      //0x468
    struct _LIST_ENTRY JobLinks;                                            //0x470
    VOID* HighestUserAddress;                                               //0x480
    struct _LIST_ENTRY ThreadListHead;                                      //0x488
    volatile ULONG ActiveThreads;                                           //0x498
    ULONG ImagePathHash;                                                    //0x49c
    ULONG DefaultHardErrorProcessing;                                       //0x4a0
    LONG LastThreadExitStatus;                                              //0x4a4
    struct _EX_FAST_REF PrefetchTrace;                                      //0x4a8
    VOID* LockedPagesList;                                                  //0x4b0
    union _LARGE_INTEGER ReadOperationCount;                                //0x4b8
    union _LARGE_INTEGER WriteOperationCount;                               //0x4c0
    union _LARGE_INTEGER OtherOperationCount;                               //0x4c8
    union _LARGE_INTEGER ReadTransferCount;                                 //0x4d0
    union _LARGE_INTEGER WriteTransferCount;                                //0x4d8
    union _LARGE_INTEGER OtherTransferCount;                                //0x4e0
    ULONGLONG CommitChargeLimit;                                            //0x4e8
    volatile ULONGLONG CommitCharge;                                        //0x4f0
    volatile ULONGLONG CommitChargePeak;                                    //0x4f8
    struct _MMSUPPORT_FULL Vm;                                              //0x500
    struct _LIST_ENTRY MmProcessLinks;                                      //0x610
    ULONG ModifiedPageCount;                                                //0x620
    LONG ExitStatus;                                                        //0x624
    struct _RTL_AVL_TREE VadRoot;                                           //0x628
    VOID* VadHint;                                                          //0x630
    ULONGLONG VadCount;                                                     //0x638
    volatile ULONGLONG VadPhysicalPages;                                    //0x640
    ULONGLONG VadPhysicalPagesLimit;                                        //0x648
    struct _ALPC_PROCESS_CONTEXT AlpcContext;                               //0x650
    struct _LIST_ENTRY TimerResolutionLink;                                 //0x670
    struct _PO_DIAG_STACK_RECORD* TimerResolutionStackRecord;               //0x680
    ULONG RequestedTimerResolution;                                         //0x688
    ULONG SmallestTimerResolution;                                          //0x68c
    union _LARGE_INTEGER ExitTime;                                          //0x690
    struct _INVERTED_FUNCTION_TABLE* InvertedFunctionTable;                 //0x698
    struct _EX_PUSH_LOCK InvertedFunctionTableLock;                         //0x6a0
    ULONG ActiveThreadsHighWatermark;                                       //0x6a8
    ULONG LargePrivateVadCount;                                             //0x6ac
    struct _EX_PUSH_LOCK ThreadListLock;                                    //0x6b0
    VOID* WnfContext;                                                       //0x6b8
    struct _EJOB* ServerSilo;                                               //0x6c0
    UCHAR SignatureLevel;                                                   //0x6c8
    UCHAR SectionSignatureLevel;                                            //0x6c9
    struct _PS_PROTECTION Protection;                                       //0x6ca
    UCHAR HangCount:4;                                                      //0x6cb
    UCHAR GhostCount:4;                                                     //0x6cb
    union
    {
        ULONG Flags3;                                                       //0x6cc
        struct
        {
            ULONG Minimal:1;                                                //0x6cc
            ULONG ReplacingPageRoot:1;                                      //0x6cc
            ULONG Crashed:1;                                                //0x6cc
            ULONG JobVadsAreTracked:1;                                      //0x6cc
            ULONG VadTrackingDisabled:1;                                    //0x6cc
            ULONG AuxiliaryProcess:1;                                       //0x6cc
            ULONG SubsystemProcess:1;                                       //0x6cc
            ULONG IndirectCpuSets:1;                                        //0x6cc
            ULONG RelinquishedCommit:1;                                     //0x6cc
            ULONG HighGraphicsPriority:1;                                   //0x6cc
            ULONG CommitFailLogged:1;                                       //0x6cc
            ULONG ReserveFailLogged:1;                                      //0x6cc
            ULONG SystemProcess:1;                                          //0x6cc
            ULONG HideImageBaseAddresses:1;                                 //0x6cc
        };
    };
    LONG DeviceAsid;                                                        //0x6d0
    VOID* SvmData;                                                          //0x6d8
    struct _EX_PUSH_LOCK SvmProcessLock;                                    //0x6e0
    ULONGLONG SvmLock;                                                      //0x6e8
    struct _LIST_ENTRY SvmProcessDeviceListHead;                            //0x6f0
    ULONGLONG LastFreezeInterruptTime;                                      //0x700
    struct _PROCESS_DISK_COUNTERS* DiskCounters;                            //0x708
    VOID* PicoContext;                                                      //0x710
    ULONGLONG TrustletIdentity;                                             //0x718
    VOID* EnclaveTable;                                                     //0x720
    ULONGLONG EnclaveNumber;                                                //0x728
    struct _EX_PUSH_LOCK EnclaveLock;                                       //0x730
    ULONG HighPriorityFaultsAllowed;                                        //0x738
    struct _PO_PROCESS_ENERGY_CONTEXT* EnergyContext;                       //0x740
    VOID* VmContext;                                                        //0x748
    ULONGLONG SequenceNumber;                                               //0x750
    ULONGLONG CreateInterruptTime;                                          //0x758
    ULONGLONG CreateUnbiasedInterruptTime;                                  //0x760
    ULONGLONG TotalUnbiasedFrozenTime;                                      //0x768
    ULONGLONG LastAppStateUpdateTime;                                       //0x770
    ULONGLONG LastAppStateUptime:61;                                        //0x778
    ULONGLONG LastAppState:3;                                               //0x778
    volatile ULONGLONG SharedCommitCharge;                                  //0x780
    struct _EX_PUSH_LOCK SharedCommitLock;                                  //0x788
    struct _LIST_ENTRY SharedCommitLinks;                                   //0x790
    union
    {
        struct
        {
            ULONGLONG AllowedCpuSets;                                       //0x7a0
            ULONGLONG DefaultCpuSets;                                       //0x7a8
        };
        struct
        {
            ULONGLONG* AllowedCpuSetsIndirect;                              //0x7a0
            ULONGLONG* DefaultCpuSetsIndirect;                              //0x7a8
        };
    };
    VOID* DiskIoAttribution;                                                //0x7b0
    VOID* DxgProcess;                                                       //0x7b8
    ULONG Win32KFilterSet;                                                  //0x7c0
    unionvolatile _PS_INTERLOCKED_TIMER_DELAY_VALUES ProcessTimerDelay;     //0x7c8
    volatile ULONG KTimerSets;                                              //0x7d0
    volatile ULONG KTimer2Sets;                                             //0x7d4
    volatile ULONG ThreadTimerSets;                                         //0x7d8
    ULONGLONG VirtualTimerListLock;                                         //0x7e0
    struct _LIST_ENTRY VirtualTimerListHead;                                //0x7e8
    union
    {
        struct _WNF_STATE_NAME WakeChannel;                                 //0x7f8
        struct _PS_PROCESS_WAKE_INFORMATION WakeInfo;                       //0x7f8
    };
    union
    {
        ULONG MitigationFlags;                                              //0x828
        struct
        {
            ULONG ControlFlowGuardEnabled:1;                                //0x828
            ULONG ControlFlowGuardExportSuppressionEnabled:1;               //0x828
            ULONG ControlFlowGuardStrict:1;                                 //0x828
            ULONG DisallowStrippedImages:1;                                 //0x828
            ULONG ForceRelocateImages:1;                                    //0x828
            ULONG HighEntropyASLREnabled:1;                                 //0x828
            ULONG StackRandomizationDisabled:1;                             //0x828
            ULONG ExtensionPointDisable:1;                                  //0x828
            ULONG DisableDynamicCode:1;                                     //0x828
            ULONG DisableDynamicCodeAllowOptOut:1;                          //0x828
            ULONG DisableDynamicCodeAllowRemoteDowngrade:1;                 //0x828
            ULONG AuditDisableDynamicCode:1;                                //0x828
            ULONG DisallowWin32kSystemCalls:1;                              //0x828
            ULONG AuditDisallowWin32kSystemCalls:1;                         //0x828
            ULONG EnableFilteredWin32kAPIs:1;                               //0x828
            ULONG AuditFilteredWin32kAPIs:1;                                //0x828
            ULONG DisableNonSystemFonts:1;                                  //0x828
            ULONG AuditNonSystemFontLoading:1;                              //0x828
            ULONG PreferSystem32Images:1;                                   //0x828
            ULONG ProhibitRemoteImageMap:1;                                 //0x828
            ULONG AuditProhibitRemoteImageMap:1;                            //0x828
            ULONG ProhibitLowILImageMap:1;                                  //0x828
            ULONG AuditProhibitLowILImageMap:1;                             //0x828
            ULONG SignatureMitigationOptIn:1;                               //0x828
            ULONG AuditBlockNonMicrosoftBinaries:1;                         //0x828
            ULONG AuditBlockNonMicrosoftBinariesAllowStore:1;               //0x828
            ULONG LoaderIntegrityContinuityEnabled:1;                       //0x828
            ULONG AuditLoaderIntegrityContinuity:1;                         //0x828
            ULONG EnableModuleTamperingProtection:1;                        //0x828
            ULONG EnableModuleTamperingProtectionNoInherit:1;               //0x828
        } MitigationFlagsValues;                                            //0x828
    };
    union
    {
        ULONG MitigationFlags2;                                             //0x82c
        struct
        {
            ULONG EnableExportAddressFilter:1;                              //0x82c
            ULONG AuditExportAddressFilter:1;                               //0x82c
            ULONG EnableExportAddressFilterPlus:1;                          //0x82c
            ULONG AuditExportAddressFilterPlus:1;                           //0x82c
            ULONG EnableRopStackPivot:1;                                    //0x82c
            ULONG AuditRopStackPivot:1;                                     //0x82c
            ULONG EnableRopCallerCheck:1;                                   //0x82c
            ULONG AuditRopCallerCheck:1;                                    //0x82c
            ULONG EnableRopSimExec:1;                                       //0x82c
            ULONG AuditRopSimExec:1;                                        //0x82c
            ULONG EnableImportAddressFilter:1;                              //0x82c
            ULONG AuditImportAddressFilter:1;                               //0x82c
        } MitigationFlags2Values;                                           //0x82c
    };
    VOID* PartitionObject;                                                  //0x830
}; 
//0x0 bytes (sizeof)
struct _EPROCESS_QUOTA_BLOCK; 
//0x58 bytes (sizeof)
struct _EPROCESS_VALUES
{
    ULONGLONG KernelTime;                                                   //0x0
    ULONGLONG UserTime;                                                     //0x8
    ULONGLONG ReadyTime;                                                    //0x10
    ULONGLONG CycleTime;                                                    //0x18
    ULONGLONG ContextSwitches;                                              //0x20
    LONGLONG ReadOperationCount;                                            //0x28
    LONGLONG WriteOperationCount;                                           //0x30
    LONGLONG OtherOperationCount;                                           //0x38
    LONGLONG ReadTransferCount;                                             //0x40
    LONGLONG WriteTransferCount;                                            //0x48
    LONGLONG OtherTransferCount;                                            //0x50
}; 
//0x68 bytes (sizeof)
struct _ERESOURCE
{
    struct _LIST_ENTRY SystemResourcesList;                                 //0x0
    struct _OWNER_ENTRY* OwnerTable;                                        //0x10
    SHORT ActiveCount;                                                      //0x18
    union
    {
        USHORT Flag;                                                        //0x1a
        struct
        {
            UCHAR ReservedLowFlags;                                         //0x1a
            UCHAR WaiterPriority;                                           //0x1b
        };
    };
    VOID* SharedWaiters;                                                    //0x20
    VOID* ExclusiveWaiters;                                                 //0x28
    struct _OWNER_ENTRY OwnerEntry;                                         //0x30
    ULONG ActiveEntries;                                                    //0x40
    ULONG ContentionCount;                                                  //0x44
    ULONG NumberOfSharedWaiters;                                            //0x48
    ULONG NumberOfExclusiveWaiters;                                         //0x4c
    VOID* Reserved2;                                                        //0x50
    union
    {
        VOID* Address;                                                      //0x58
        ULONGLONG CreatorBackTraceIndex;                                    //0x58
    };
    ULONGLONG SpinLock;                                                     //0x60
}; 
//0x480 bytes (sizeof)
struct _ESERVERSILO_GLOBALS
{
    struct _OBP_SILODRIVERSTATE ObSiloState;                                //0x0
    struct _SEP_SILOSTATE SeSiloState;                                      //0x2e0
    struct _SEP_RM_LSA_CONNECTION_STATE SeRmSiloState;                      //0x310
    struct _ETW_SILODRIVERSTATE* EtwSiloState;                              //0x360
    struct _EPROCESS* MiSessionLeaderProcess;                               //0x368
    struct _EPROCESS* ExpDefaultErrorPortProcess;                           //0x370
    VOID* ExpDefaultErrorPort;                                              //0x378
    ULONG HardErrorState;                                                   //0x380
    struct _WNF_SILODRIVERSTATE WnfSiloState;                               //0x388
    struct _DBGK_SILOSTATE DbgkSiloState;                                   //0x3c0
    struct _UNICODE_STRING PsProtectedCurrentDirectory;                     //0x3e0
    struct _UNICODE_STRING PsProtectedEnvironment;                          //0x3f0
    VOID* ApiSetSection;                                                    //0x400
    VOID* ApiSetSchema;                                                     //0x408
    UCHAR OneCoreForwardersEnabled;                                         //0x410
    struct _UNICODE_STRING NtSystemRoot;                                    //0x418
    struct _UNICODE_STRING SiloRootDirectoryName;                           //0x428
    struct _PSP_STORAGE* Storage;                                           //0x438
    enum _SERVERSILO_STATE State;                                           //0x440
    LONG ExitStatus;                                                        //0x444
    struct _KEVENT* DeleteEvent;                                            //0x448
    struct _SILO_USER_SHARED_DATA* UserSharedData;                          //0x450
    VOID* UserSharedSection;                                                //0x458
    struct _WORK_QUEUE_ITEM TerminateWorkItem;                              //0x460
}; 
//0x818 bytes (sizeof)
struct _ETHREAD
{
    struct _KTHREAD Tcb;                                                    //0x0
    union _LARGE_INTEGER CreateTime;                                        //0x5f0
    union
    {
        union _LARGE_INTEGER ExitTime;                                      //0x5f8
        struct _LIST_ENTRY KeyedWaitChain;                                  //0x5f8
    };
    union
    {
        struct _LIST_ENTRY PostBlockList;                                   //0x608
        struct
        {
            VOID* ForwardLinkShadow;                                        //0x608
            VOID* StartAddress;                                             //0x610
        };
    };
    union
    {
        struct _TERMINATION_PORT* TerminationPort;                          //0x618
        struct _ETHREAD* ReaperLink;                                        //0x618
        VOID* KeyedWaitValue;                                               //0x618
    };
    ULONGLONG ActiveTimerListLock;                                          //0x620
    struct _LIST_ENTRY ActiveTimerListHead;                                 //0x628
    struct _CLIENT_ID Cid;                                                  //0x638
    union
    {
        struct _KSEMAPHORE KeyedWaitSemaphore;                              //0x648
        struct _KSEMAPHORE AlpcWaitSemaphore;                               //0x648
    };
    union _PS_CLIENT_SECURITY_CONTEXT ClientSecurity;                       //0x668
    struct _LIST_ENTRY IrpList;                                             //0x670
    ULONGLONG TopLevelIrp;                                                  //0x680
    struct _DEVICE_OBJECT* DeviceToVerify;                                  //0x688
    VOID* Win32StartAddress;                                                //0x690
    VOID* ChargeOnlySession;                                                //0x698
    VOID* LegacyPowerObject;                                                //0x6a0
    struct _LIST_ENTRY ThreadListEntry;                                     //0x6a8
    struct _EX_RUNDOWN_REF RundownProtect;                                  //0x6b8
    struct _EX_PUSH_LOCK ThreadLock;                                        //0x6c0
    ULONG ReadClusterSize;                                                  //0x6c8
    volatile LONG MmLockOrdering;                                           //0x6cc
    union
    {
        ULONG CrossThreadFlags;                                             //0x6d0
        struct
        {
            ULONG Terminated:1;                                             //0x6d0
            ULONG ThreadInserted:1;                                         //0x6d0
            ULONG HideFromDebugger:1;                                       //0x6d0
            ULONG ActiveImpersonationInfo:1;                                //0x6d0
            ULONG HardErrorsAreDisabled:1;                                  //0x6d0
            ULONG BreakOnTermination:1;                                     //0x6d0
            ULONG SkipCreationMsg:1;                                        //0x6d0
            ULONG SkipTerminationMsg:1;                                     //0x6d0
            ULONG CopyTokenOnOpen:1;                                        //0x6d0
            ULONG ThreadIoPriority:3;                                       //0x6d0
            ULONG ThreadPagePriority:3;                                     //0x6d0
            ULONG RundownFail:1;                                            //0x6d0
            ULONG UmsForceQueueTermination:1;                               //0x6d0
            ULONG IndirectCpuSets:1;                                        //0x6d0
            ULONG DisableDynamicCodeOptOut:1;                               //0x6d0
            ULONG ExplicitCaseSensitivity:1;                                //0x6d0
            ULONG PicoNotifyExit:1;                                         //0x6d0
            ULONG DbgWerUserReportActive:1;                                 //0x6d0
            ULONG ForcedSelfTrimActive:1;                                   //0x6d0
            ULONG ReservedCrossThreadFlags:9;                               //0x6d0
        };
    };
    union
    {
        ULONG SameThreadPassiveFlags;                                       //0x6d4
        struct
        {
            ULONG ActiveExWorker:1;                                         //0x6d4
            ULONG MemoryMaker:1;                                            //0x6d4
            ULONG StoreLockThread:2;                                        //0x6d4
            ULONG ClonedThread:1;                                           //0x6d4
            ULONG KeyedEventInUse:1;                                        //0x6d4
            ULONG SelfTerminate:1;                                          //0x6d4
            ULONG RespectIoPriority:1;                                      //0x6d4
            ULONG ActivePageLists:1;                                        //0x6d4
            ULONG SecureContext:1;                                          //0x6d4
            ULONG ZeroPageThread:1;                                         //0x6d4
            ULONG ReservedSameThreadPassiveFlags:21;                        //0x6d4
        };
    };
    union
    {
        ULONG SameThreadApcFlags;                                           //0x6d8
        struct
        {
            UCHAR OwnsProcessAddressSpaceExclusive:1;                       //0x6d8
            UCHAR OwnsProcessAddressSpaceShared:1;                          //0x6d8
            UCHAR HardFaultBehavior:1;                                      //0x6d8
            volatile UCHAR StartAddressInvalid:1;                           //0x6d8
            UCHAR EtwCalloutActive:1;                                       //0x6d8
            UCHAR SuppressSymbolLoad:1;                                     //0x6d8
            UCHAR Prefetching:1;                                            //0x6d8
            UCHAR OwnsVadExclusive:1;                                       //0x6d8
            UCHAR SystemPagePriorityActive:1;                               //0x6d9
            UCHAR SystemPagePriority:3;                                     //0x6d9
            UCHAR AllowWritesToExecutableMemory:1;                          //0x6d9
        };
    };
    UCHAR CacheManagerActive;                                               //0x6dc
    UCHAR DisablePageFaultClustering;                                       //0x6dd
    UCHAR ActiveFaultCount;                                                 //0x6de
    UCHAR LockOrderState;                                                   //0x6df
    ULONGLONG AlpcMessageId;                                                //0x6e0
    union
    {
        VOID* AlpcMessage;                                                  //0x6e8
        ULONG AlpcReceiveAttributeSet;                                      //0x6e8
    };
    struct _LIST_ENTRY AlpcWaitListEntry;                                   //0x6f0
    LONG ExitStatus;                                                        //0x700
    ULONG CacheManagerCount;                                                //0x704
    ULONG IoBoostCount;                                                     //0x708
    ULONG IoQoSBoostCount;                                                  //0x70c
    ULONG IoQoSThrottleCount;                                               //0x710
    struct _LIST_ENTRY BoostList;                                           //0x718
    struct _LIST_ENTRY DeboostList;                                         //0x728
    ULONGLONG BoostListLock;                                                //0x738
    ULONGLONG IrpListLock;                                                  //0x740
    VOID* ReservedForSynchTracking;                                         //0x748
    struct _SINGLE_LIST_ENTRY CmCallbackListHead;                           //0x750
    struct _GUID* ActivityId;                                               //0x758
    struct _SINGLE_LIST_ENTRY SeLearningModeListHead;                       //0x760
    VOID* VerifierContext;                                                  //0x768
    ULONG KernelStackReference;                                             //0x770
    VOID* AdjustedClientToken;                                              //0x778
    VOID* WorkOnBehalfThread;                                               //0x780
    struct _PS_PROPERTY_SET PropertySet;                                    //0x788
    VOID* PicoContext;                                                      //0x7a0
    ULONGLONG UserFsBase;                                                   //0x7a8
    ULONGLONG UserGsBase;                                                   //0x7b0
    struct _THREAD_ENERGY_VALUES* EnergyValues;                             //0x7b8
    VOID* CmDbgInfo;                                                        //0x7c0
    union
    {
        ULONGLONG SelectedCpuSets;                                          //0x7c8
        ULONGLONG* SelectedCpuSetsIndirect;                                 //0x7c8
    };
    struct _EJOB* Silo;                                                     //0x7d0
    struct _UNICODE_STRING* ThreadName;                                     //0x7d8
    struct _CONTEXT* SetContextState;                                       //0x7e0
    ULONG LastExpectedRunTime;                                              //0x7e8
    struct _LIST_ENTRY OwnerEntryListHead;                                  //0x7f0
    ULONGLONG DisownedOwnerEntryListLock;                                   //0x800
    struct _LIST_ENTRY DisownedOwnerEntryListHead;                          //0x808
}; 
//0x138 bytes (sizeof)
struct _ETIMER
{
    struct _KTIMER KeTimer;                                                 //0x0
    ULONGLONG Lock;                                                         //0x40
    struct _KAPC TimerApc;                                                  //0x48
    struct _KDPC TimerDpc;                                                  //0xa0
    struct _LIST_ENTRY ActiveTimerListEntry;                                //0xe0
    ULONG Period;                                                           //0xf0
    union
    {
        CHAR TimerFlags;                                                    //0xf4
        struct
        {
            UCHAR ApcAssociated:1;                                          //0xf4
            UCHAR FlushDpcs:1;                                              //0xf4
            UCHAR Paused:1;                                                 //0xf4
            UCHAR Spare1:5;                                                 //0xf4
        };
    };
    UCHAR DueTimeType;                                                      //0xf5
    USHORT Spare2;                                                          //0xf6
    struct _DIAGNOSTIC_CONTEXT* volatile WakeReason;                        //0xf8
    struct _LIST_ENTRY WakeTimerListEntry;                                  //0x100
    VOID* VirtualizedTimerCookie;                                           //0x110
    struct _LIST_ENTRY VirtualizedTimerLinks;                               //0x118
    ULONGLONG DueTime;                                                      //0x128
    ULONG CoalescingWindow;                                                 //0x130
};
//0x48 bytes (sizeof)
struct _ETWP_NOTIFICATION_HEADER
{
    enum _ETW_NOTIFICATION_TYPE NotificationType;                           //0x0
    ULONG NotificationSize;                                                 //0x4
    LONG RefCount;                                                          //0x8
    UCHAR ReplyRequested;                                                   //0xc
    union
    {
        ULONG ReplyIndex;                                                   //0x10
        ULONG Timeout;                                                      //0x10
    };
    union
    {
        ULONG ReplyCount;                                                   //0x14
        ULONG NotifyeeCount;                                                //0x14
    };
    union
    {
        ULONGLONG ReplyHandle;                                              //0x18
        VOID* ReplyObject;                                                  //0x18
        ULONG RegIndex;                                                     //0x18
    };
    ULONG TargetPID;                                                        //0x20
    ULONG SourcePID;                                                        //0x24
    struct _GUID DestinationGuid;                                           //0x28
    struct _GUID SourceGuid;                                                //0x38
}; 
//0x60 bytes (sizeof)
struct _ETW_APC_ENTRY
{
    union
    {
        struct _SLIST_ENTRY SListEntry;                                     //0x0
        struct _KAPC Apc;                                                   //0x0
    };
}; 
//0x4 bytes (sizeof)
struct _ETW_BUFFER_CONTEXT
{
    union
    {
        struct
        {
            UCHAR ProcessorNumber;                                          //0x0
            UCHAR Alignment;                                                //0x1
        };
        USHORT ProcessorIndex;                                              //0x0
    };
    USHORT LoggerId;                                                        //0x2
}; 
//0x10 bytes (sizeof)
struct _ETW_BUFFER_QUEUE
{
    struct _SINGLE_LIST_ENTRY* QueueTail;                                   //0x0
    struct _SINGLE_LIST_ENTRY QueueEntry;                                   //0x8
}; 
//0x10 bytes (sizeof)
struct _ETW_COUNTERS
{
    LONG GuidCount;                                                         //0x0
    LONG PoolUsage[2];                                                      //0x4
    LONG SessionCount;                                                      //0xc
}; 
//0x38 bytes (sizeof)
struct _ETW_DEBUGID_TRACKING_ENTRY
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    UCHAR ConsumersNotified;                                                //0x10
    UCHAR Spare[3];                                                         //0x11
    ULONG DebugIdSize;                                                      //0x14
    union _CVDD DebugId;                                                    //0x18
};
//0x30 bytes (sizeof)
struct _ETW_DECODE_CONTROL_ENTRY
{
    struct _ETW_DECODE_CONTROL_ENTRY* Next;                                 //0x0
    struct _GUID Decode;                                                    //0x8
    struct _GUID Control;                                                   //0x18
    UCHAR ConsumersNotified;                                                //0x28
}; 
//0x28 bytes (sizeof)
struct _ETW_FILTER_EVENT_NAME_DATA
{
    UCHAR FilterIn;                                                         //0x0
    UCHAR Level;                                                            //0x1
    ULONGLONG MatchAnyKeyword;                                              //0x8
    ULONGLONG MatchAllKeyword;                                              //0x10
    struct _RTL_HASH_TABLE NameTable;                                       //0x18
}; 
//0x60 bytes (sizeof)
struct _ETW_FILTER_HEADER
{
    LONG FilterFlags;                                                       //0x0
    struct _ETW_FILTER_PID* PidFilter;                                      //0x8
    struct _ETW_FILTER_STRING_TOKEN* ExeFilter;                             //0x10
    struct _ETW_FILTER_STRING_TOKEN* PkgIdFilter;                           //0x18
    struct _ETW_FILTER_STRING_TOKEN* PkgAppIdFilter;                        //0x20
    struct _ETW_PERFECT_HASH_FUNCTION* StackWalkIdFilter;                   //0x28
    struct _ETW_FILTER_EVENT_NAME_DATA* StackWalkNameFilter;                //0x30
    struct _EVENT_FILTER_LEVEL_KW* StackWalkLevelKwFilter;                  //0x38
    struct _ETW_PERFECT_HASH_FUNCTION* EventIdFilter;                       //0x40
    struct _ETW_PAYLOAD_FILTER* PayloadFilter;                              //0x48
    struct _EVENT_FILTER_HEADER* ProviderSideFilter;                        //0x50
    struct _ETW_FILTER_EVENT_NAME_DATA* EventNameFilter;                    //0x58
}; 
//0x24 bytes (sizeof)
struct _ETW_FILTER_PID
{
    ULONG Count;                                                            //0x0
    ULONG Pids[8];                                                          //0x4
}; 
//0x18 bytes (sizeof)
struct _ETW_FILTER_STRING_TOKEN
{
    USHORT Count;                                                           //0x0
    struct _ETW_FILTER_STRING_TOKEN_ELEMENT Tokens[1];                      //0x8
}; 
//0x10 bytes (sizeof)
struct _ETW_FILTER_STRING_TOKEN_ELEMENT
{
    USHORT Length;                                                          //0x0
    WCHAR* String;                                                          //0x8
}; 
//0x190 bytes (sizeof)
struct _ETW_GUID_ENTRY
{
    struct _LIST_ENTRY GuidList;                                            //0x0
    volatile LONGLONG RefCount;                                             //0x10
    struct _GUID Guid;                                                      //0x18
    struct _LIST_ENTRY RegListHead;                                         //0x28
    VOID* SecurityDescriptor;                                               //0x38
    union
    {
        struct _ETW_LAST_ENABLE_INFO LastEnable;                            //0x40
        ULONGLONG MatchId;                                                  //0x40
    };
    struct _TRACE_ENABLE_INFO ProviderEnableInfo;                           //0x50
    struct _TRACE_ENABLE_INFO EnableInfo[8];                                //0x70
    struct _ETW_FILTER_HEADER* FilterData;                                  //0x170
    struct _ETW_SILODRIVERSTATE* SiloState;                                 //0x178
    struct _EX_PUSH_LOCK Lock;                                              //0x180
    struct _ETHREAD* LockOwner;                                             //0x188
}; 
//0x38 bytes (sizeof)
struct _ETW_HASH_BUCKET
{
    struct _LIST_ENTRY ListHead[3];                                         //0x0
    struct _EX_PUSH_LOCK BucketLock;                                        //0x30
}; 
//0x10 bytes (sizeof)
struct _ETW_LAST_ENABLE_INFO
{
    union _LARGE_INTEGER EnableFlags;                                       //0x0
    USHORT LoggerId;                                                        //0x8
    UCHAR Level;                                                            //0xa
    UCHAR Enabled:1;                                                        //0xb
    UCHAR InternalFlag:7;                                                   //0xb
}; 
//0x14 bytes (sizeof)
struct _ETW_LBR_SUPPORT
{
    ULONG LbrHandle;                                                        //0x0
    ULONG LbrOptions;                                                       //0x4
    volatile ULONG HookIdCount;                                             //0x8
    USHORT HookId[4];                                                       //0xc
}; 
//0x1 bytes (sizeof)
struct _ETW_LOGGER_HANDLE
{
    UCHAR DereferenceAndLeave;                                              //0x0
};
//0x58 bytes (sizeof)
struct _ETW_PAYLOAD_FILTER
{
    LONG RefCount;                                                          //0x0
    struct _AGGREGATED_PAYLOAD_FILTER PayloadFilter;                        //0x8
}; 
//0x0 bytes (sizeof)
struct _ETW_PERFECT_HASH_FUNCTION; 
//0x18 bytes (sizeof)
struct _ETW_PERF_COUNTERS
{
    LONG TotalActiveSessions;                                               //0x0
    LONG TotalBufferMemoryNonPagedPool;                                     //0x4
    LONG TotalBufferMemoryPagedPool;                                        //0x8
    LONG TotalGuidsEnabled;                                                 //0xc
    LONG TotalGuidsNotEnabled;                                              //0x10
    LONG TotalGuidsPreEnabled;                                              //0x14
};
//0x38 bytes (sizeof)
struct _ETW_PMC_SUPPORT
{
    enum _KPROFILE_SOURCE Source[8];                                        //0x0
    volatile ULONG HookIdCount;                                             //0x20
    USHORT HookId[4];                                                       //0x24
    volatile ULONG CountersCount;                                           //0x2c
    struct _HAL_PMC_COUNTERS* ProcessorCtrs[1];                             //0x30
}; 
//0x20 bytes (sizeof)
struct _ETW_PRIV_HANDLE_DEMUX_TABLE
{
    struct _RTL_RB_TREE Tree;                                               //0x0
    struct _EX_PUSH_LOCK Lock;                                              //0x10
    USHORT SequenceNumber;                                                  //0x18
}; 
//0x20 bytes (sizeof)
struct _ETW_PROVIDER_TRAITS
{
    struct _RTL_BALANCED_NODE Node;                                         //0x0
    ULONG ReferenceCount;                                                   //0x18
    UCHAR Traits[1];                                                        //0x1c
}; 
//0x38 bytes (sizeof)
struct _ETW_QUEUE_ENTRY
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    struct _ETWP_NOTIFICATION_HEADER* DataBlock;                            //0x10
    struct _ETW_REG_ENTRY* RegEntry;                                        //0x18
    struct _ETW_REG_ENTRY* ReplyObject;                                     //0x20
    VOID* WakeReference;                                                    //0x28
    USHORT RegIndex;                                                        //0x30
    USHORT ReplyIndex;                                                      //0x32
    ULONG Flags;                                                            //0x34
}; 
//0xa0 bytes (sizeof)
struct _ETW_REALTIME_CONSUMER
{
    struct _LIST_ENTRY Links;                                               //0x0
    VOID* ProcessHandle;                                                    //0x10
    struct _EPROCESS* ProcessObject;                                        //0x18
    VOID* NextNotDelivered;                                                 //0x20
    VOID* RealtimeConnectContext;                                           //0x28
    struct _KEVENT* DisconnectEvent;                                        //0x30
    struct _KEVENT* DataAvailableEvent;                                     //0x38
    ULONG* UserBufferCount;                                                 //0x40
    struct _SINGLE_LIST_ENTRY* UserBufferListHead;                          //0x48
    ULONG BuffersLost;                                                      //0x50
    ULONG EmptyBuffersCount;                                                //0x54
    USHORT LoggerId;                                                        //0x58
    union
    {
        UCHAR Flags;                                                        //0x5a
        struct
        {
            UCHAR ShutDownRequested:1;                                      //0x5a
            UCHAR NewBuffersLost:1;                                         //0x5a
            UCHAR Disconnected:1;                                           //0x5a
            UCHAR Notified:1;                                               //0x5a
            UCHAR Wow:1;                                                    //0x5a
        };
    };
    struct _RTL_BITMAP ReservedBufferSpaceBitMap;                           //0x60
    UCHAR* ReservedBufferSpace;                                             //0x70
    ULONG ReservedBufferSpaceSize;                                          //0x78
    ULONG UserPagesAllocated;                                               //0x7c
    ULONG UserPagesReused;                                                  //0x80
    ULONG* EventsLostCount;                                                 //0x88
    ULONG* BuffersLostCount;                                                //0x90
    struct _ETW_SILODRIVERSTATE* SiloState;                                 //0x98
}; 
//0x10 bytes (sizeof)
struct _ETW_REF_CLOCK
{
    union _LARGE_INTEGER StartTime;                                         //0x0
    union _LARGE_INTEGER StartPerfClock;                                    //0x8
}; 
//0x70 bytes (sizeof)
struct _ETW_REG_ENTRY
{
    struct _LIST_ENTRY RegList;                                             //0x0
    struct _LIST_ENTRY GroupRegList;                                        //0x10
    struct _ETW_GUID_ENTRY* GuidEntry;                                      //0x20
    struct _ETW_GUID_ENTRY* GroupEntry;                                     //0x28
    union
    {
        struct _ETW_REPLY_QUEUE* ReplyQueue;                                //0x30
        struct _ETW_QUEUE_ENTRY* ReplySlot[4];                              //0x30
        struct
        {
            VOID* Caller;                                                   //0x30
            ULONG SessionId;                                                //0x38
        };
    };
    union
    {
        struct _EPROCESS* Process;                                          //0x50
        VOID* CallbackContext;                                              //0x50
    };
    VOID* Callback;                                                         //0x58
    USHORT Index;                                                           //0x60
    union
    {
        USHORT Flags;                                                       //0x62
        struct
        {
            USHORT DbgKernelRegistration:1;                                 //0x62
            USHORT DbgUserRegistration:1;                                   //0x62
            USHORT DbgReplyRegistration:1;                                  //0x62
            USHORT DbgClassicRegistration:1;                                //0x62
            USHORT DbgSessionSpaceRegistration:1;                           //0x62
            USHORT DbgModernRegistration:1;                                 //0x62
            USHORT DbgClosed:1;                                             //0x62
            USHORT DbgInserted:1;                                           //0x62
            USHORT DbgWow64:1;                                              //0x62
            USHORT DbgUseDescriptorType:1;                                  //0x62
            USHORT DbgDropProviderTraits:1;                                 //0x62
        };
    };
    UCHAR EnableMask;                                                       //0x64
    UCHAR GroupEnableMask;                                                  //0x65
    struct _ETW_PROVIDER_TRAITS* Traits;                                    //0x68
}; 
//0x48 bytes (sizeof)
struct _ETW_REPLY_QUEUE
{
    struct _KQUEUE Queue;                                                   //0x0
    LONG EventsLost;                                                        //0x40
}; 
//0x18 bytes (sizeof)
struct _ETW_SESSION_PERF_COUNTERS
{
    LONG BufferMemoryPagedPool;                                             //0x0
    LONG BufferMemoryNonPagedPool;                                          //0x4
    ULONGLONG EventsLoggedCount;                                            //0x8
    LONG EventsLost;                                                        //0x10
    LONG NumConsumers;                                                      //0x14
};
//0x1190 bytes (sizeof)
struct _ETW_SILODRIVERSTATE
{
    struct _ESERVERSILO_GLOBALS* SiloGlobals;                               //0x0
    ULONG MaxLoggers;                                                       //0x8
    struct _ETW_GUID_ENTRY EtwpSecurityProviderGuidEntry;                   //0x10
    struct _EX_RUNDOWN_REF_CACHE_AWARE** EtwpLoggerRundown;                 //0x1a0
    struct _WMI_LOGGER_CONTEXT** EtwpLoggerContext;                         //0x1a8
    struct _ETW_HASH_BUCKET EtwpGuidHashTable[64];                          //0x1b0
    USHORT EtwpSecurityLoggers[8];                                          //0xfb0
    UCHAR EtwpSecurityProviderEnableMask;                                   //0xfc0
    LONG EtwpShutdownInProgress;                                            //0xfc4
    ULONG EtwpSecurityProviderPID;                                          //0xfc8
    struct _ETW_PRIV_HANDLE_DEMUX_TABLE PrivHandleDemuxTable;               //0xfd0
    struct _ETW_COUNTERS EtwpCounters;                                      //0xff0
    union _LARGE_INTEGER LogfileBytesWritten;                               //0x1000
    struct _ETW_SILO_TRACING_BLOCK* ProcessorBlocks;                        //0x1008
    struct _GUID PartitionId;                                               //0x1010
    struct _GUID ParentId;                                                  //0x1020
    union _LARGE_INTEGER QpcOffsetFromRoot;                                 //0x1030
    ULONG PartitionType;                                                    //0x1038
    struct _ETW_SYSTEM_LOGGER_SETTINGS SystemLoggerSettings;                //0x103c
}; 
//0x40 bytes (sizeof)
struct _ETW_SILO_TRACING_BLOCK
{
    struct _EX_FAST_REF* ProcessorBuffers;                                  //0x0
    ULONGLONG* EventsLoggedCount;                                           //0x8
}; 
//0x0 bytes (sizeof)
struct _ETW_SOFT_RESTART_CONTEXT; 
//0x0 bytes (sizeof)
struct _ETW_STACK_CACHE; 
//0x500 bytes (sizeof)
struct _ETW_STACK_TRACE_BLOCK
{
    LONG Flags;                                                             //0x0
    union _LARGE_INTEGER RelatedTimestamp;                                  //0x8
    struct _ETHREAD* Thread;                                                //0x10
    struct _KDPC StackWalkDpc;                                              //0x18
    union _SLIST_HEADER ApcListHead;                                        //0x60
    struct _ETW_APC_ENTRY ApcEntry[12];                                     //0x70
    LONG ApcCount;                                                          //0x4f0
    LONG MaxApcCount;                                                       //0x4f4
}; 
//0x10 bytes (sizeof)
struct _ETW_SYSTEMTIME
{
    USHORT Year;                                                            //0x0
    USHORT Month;                                                           //0x2
    USHORT DayOfWeek;                                                       //0x4
    USHORT Day;                                                             //0x6
    USHORT Hour;                                                            //0x8
    USHORT Minute;                                                          //0xa
    USHORT Second;                                                          //0xc
    USHORT Milliseconds;                                                    //0xe
};
//0x2 bytes (sizeof)
struct _ETW_SYSTEM_LOGGER
{
    UCHAR LoggerId;                                                         //0x0
    UCHAR ClockType;                                                        //0x1
}; 
//0x154 bytes (sizeof)
struct _ETW_SYSTEM_LOGGER_SETTINGS
{
    struct _ETW_SYSTEM_LOGGER EtwpSystemLogger[8];                          //0x0
    volatile ULONG EtwpActiveSystemLoggers;                                 //0x10
    struct _PERFINFO_GROUPMASK SiloGlobalGroupMask;                         //0x14
    struct _PERFINFO_GROUPMASK EtwpGroupMasks[9];                           //0x34
}; 
//0xf0 bytes (sizeof)
struct _ETW_WMITRACE_WORK
{
    ULONG LoggerId;                                                         //0x0
    ULONG SiloSessionId;                                                    //0x4
    union
    {
        struct
        {
            CHAR LoggerName[65];                                            //0x8
            CHAR FileName[129];                                             //0x49
            ULONG MaximumFileSize;                                          //0xcc
            ULONG MinBuffers;                                               //0xd0
            ULONG MaxBuffers;                                               //0xd4
            ULONG BufferSize;                                               //0xd8
            ULONG Mode;                                                     //0xdc
            ULONG FlushTimer;                                               //0xe0
        };
        struct
        {
            ULONGLONG MatchAny;                                             //0x8
            ULONGLONG MatchAll;                                             //0x10
            ULONG EnableProperty;                                           //0x18
            struct _GUID Guid;                                              //0x1c
            UCHAR Level;                                                    //0x2c
        };
    };
    LONG Status;                                                            //0xe8
};
//0x10 bytes (sizeof)
struct _EVENT_DATA_DESCRIPTOR
{
    ULONGLONG Ptr;                                                          //0x0
    ULONG Size;                                                             //0x8
    union
    {
        ULONG Reserved;                                                     //0xc
        struct
        {
            UCHAR Type;                                                     //0xc
            UCHAR Reserved1;                                                //0xd
            USHORT Reserved2;                                               //0xe
        };
    };
};
//0x10 bytes (sizeof)
struct _EVENT_DESCRIPTOR
{
    USHORT Id;                                                              //0x0
    UCHAR Version;                                                          //0x2
    UCHAR Channel;                                                          //0x3
    UCHAR Level;                                                            //0x4
    UCHAR Opcode;                                                           //0x5
    USHORT Task;                                                            //0x6
    ULONGLONG Keyword;                                                      //0x8
}; 
//0x10 bytes (sizeof)
struct _EVENT_FILTER_DESCRIPTOR
{
    ULONGLONG Ptr;                                                          //0x0
    ULONG Size;                                                             //0x8
    ULONG Type;                                                             //0xc
}; 
//0x18 bytes (sizeof)
struct _EVENT_FILTER_HEADER
{
    USHORT Id;                                                              //0x0
    UCHAR Version;                                                          //0x2
    UCHAR Reserved[5];                                                      //0x3
    ULONGLONG InstanceId;                                                   //0x8
    ULONG Size;                                                             //0x10
    ULONG NextOffset;                                                       //0x14
}; 
//0x18 bytes (sizeof)
struct _EVENT_FILTER_LEVEL_KW
{
    ULONGLONG MatchAnyKeyword;                                              //0x0
    ULONGLONG MatchAllKeyword;                                              //0x8
    UCHAR Level;                                                            //0x10
    UCHAR FilterIn;                                                         //0x11
}; 
//0x50 bytes (sizeof)
struct _EVENT_HEADER
{
    USHORT Size;                                                            //0x0
    USHORT HeaderType;                                                      //0x2
    USHORT Flags;                                                           //0x4
    USHORT EventProperty;                                                   //0x6
    ULONG ThreadId;                                                         //0x8
    ULONG ProcessId;                                                        //0xc
    union _LARGE_INTEGER TimeStamp;                                         //0x10
    struct _GUID ProviderId;                                                //0x18
    struct _EVENT_DESCRIPTOR EventDescriptor;                               //0x28
    union
    {
        struct
        {
            ULONG KernelTime;                                               //0x38
            ULONG UserTime;                                                 //0x3c
        };
        ULONGLONG ProcessorTime;                                            //0x38
    };
    struct _GUID ActivityId;                                                //0x40
}; 
//0x10 bytes (sizeof)
struct _EVENT_HEADER_EXTENDED_DATA_ITEM
{
    USHORT Reserved1;                                                       //0x0
    USHORT ExtType;                                                         //0x2
    USHORT Linkage:1;                                                       //0x4
    USHORT Reserved2:15;                                                    //0x4
    USHORT DataSize;                                                        //0x6
    ULONGLONG DataPtr;                                                      //0x8
}; 
//0x18 bytes (sizeof)
struct _EVENT_PAYLOAD_PREDICATE
{
    USHORT FieldIndex;                                                      //0x0
    USHORT CompareOp;                                                       //0x2
    ULONGLONG Value[2];                                                     //0x8
}; 
//0x70 bytes (sizeof)
struct _EVENT_RECORD
{
    struct _EVENT_HEADER EventHeader;                                       //0x0
    struct _ETW_BUFFER_CONTEXT BufferContext;                               //0x50
    USHORT ExtendedDataCount;                                               //0x54
    USHORT UserDataLength;                                                  //0x56
    struct _EVENT_HEADER_EXTENDED_DATA_ITEM* ExtendedData;                  //0x58
    VOID* UserData;                                                         //0x60
    VOID* UserContext;                                                      //0x68
};
//0x10 bytes (sizeof)
struct _EWOW64PROCESS
{
    VOID* Peb;                                                              //0x0
    USHORT Machine;                                                         //0x8
    enum _SYSTEM_DLL_TYPE NtdllType;                                        //0xc
}; 
//0x10 bytes (sizeof)
struct _EXCEPTION_POINTERS
{
    struct _EXCEPTION_RECORD* ExceptionRecord;                              //0x0
    struct _CONTEXT* ContextRecord;                                         //0x8
};
//0x98 bytes (sizeof)
struct _EXCEPTION_RECORD
{
    LONG ExceptionCode;                                                     //0x0
    ULONG ExceptionFlags;                                                   //0x4
    struct _EXCEPTION_RECORD* ExceptionRecord;                              //0x8
    VOID* ExceptionAddress;                                                 //0x10
    ULONG NumberParameters;                                                 //0x18
    ULONGLONG ExceptionInformation[15];                                     //0x20
}; 
//0x50 bytes (sizeof)
struct _EXCEPTION_RECORD32
{
    LONG ExceptionCode;                                                     //0x0
    ULONG ExceptionFlags;                                                   //0x4
    ULONG ExceptionRecord;                                                  //0x8
    ULONG ExceptionAddress;                                                 //0xc
    ULONG NumberParameters;                                                 //0x10
    ULONG ExceptionInformation[15];                                         //0x14
}; 
//0x98 bytes (sizeof)
struct _EXCEPTION_RECORD64
{
    LONG ExceptionCode;                                                     //0x0
    ULONG ExceptionFlags;                                                   //0x4
    ULONGLONG ExceptionRecord;                                              //0x8
    ULONGLONG ExceptionAddress;                                             //0x10
    ULONG NumberParameters;                                                 //0x18
    ULONG __unusedAlignment;                                                //0x1c
    ULONGLONG ExceptionInformation[15];                                     //0x20
}; 
//0x10 bytes (sizeof)
struct _EXCEPTION_REGISTRATION_RECORD
{
    struct _EXCEPTION_REGISTRATION_RECORD* Next;                            //0x0
    enum _EXCEPTION_DISPOSITION (*Handler)(struct _EXCEPTION_RECORD* arg1, VOID* arg2, struct _CONTEXT* arg3, VOID* arg4); //0x8
}; 
//0x8 bytes (sizeof)
struct _EXHANDLE
{
    union
    {
        struct
        {
            ULONG TagBits:2;                                                //0x0
            ULONG Index:30;                                                 //0x0
        };
        VOID* GenericHandleOverlay;                                         //0x0
        ULONGLONG Value;                                                    //0x0
    };
}; 
//0x18 bytes (sizeof)
struct _EXT_DELETE_PARAMETERS
{
    ULONG Version;                                                          //0x0
    ULONG Reserved;                                                         //0x4
    VOID (*DeleteCallback)(VOID* arg1);                                     //0x8
    VOID* DeleteContext;                                                    //0x10
};
//0x10 bytes (sizeof)
struct _EXT_SET_PARAMETERS_V0
{
    ULONG Version;                                                          //0x0
    ULONG Reserved;                                                         //0x4
    LONGLONG NoWakeTolerance;                                               //0x8
};
//0x8 bytes (sizeof)
struct _EX_FAST_REF
{
    union
    {
        VOID* Object;                                                       //0x0
        ULONGLONG RefCnt:4;                                                 //0x0
        ULONGLONG Value;                                                    //0x0
    };
}; 
//0x20 bytes (sizeof)
struct _EX_PARTITION
{
    struct _EPARTITION* PartitionObject;                                    //0x0
    struct _EX_WORK_QUEUE** volatile* WorkQueues;                           //0x8
    struct _EX_WORK_QUEUE_MANAGER** WorkQueueManagers;                      //0x10
    volatile LONG QueueAllocationMask;                                      //0x18
}; 
//0x8 bytes (sizeof)
struct _EX_PUSH_LOCK
{
    union
    {
        struct
        {
            ULONGLONG Locked:1;                                             //0x0
            ULONGLONG Waiting:1;                                            //0x0
            ULONGLONG Waking:1;                                             //0x0
            ULONGLONG MultipleShared:1;                                     //0x0
            ULONGLONG Shared:60;                                            //0x0
        };
        ULONGLONG Value;                                                    //0x0
        VOID* Ptr;                                                          //0x0
    };
}; 
//0x10 bytes (sizeof)
struct _EX_PUSH_LOCK_AUTO_EXPAND
{
    struct _EX_PUSH_LOCK LocalLock;                                         //0x0
    struct _EX_PUSH_LOCK_AUTO_EXPAND_STATE State;                           //0x8
    ULONG Stats;                                                            //0xc
};
//0x4 bytes (sizeof)
struct _EX_PUSH_LOCK_AUTO_EXPAND_STATE
{
    union
    {
        struct
        {
            ULONG Expanded:1;                                               //0x0
            ULONG Transitioning:1;                                          //0x0
            ULONG Pageable:1;                                               //0x0
        };
        ULONG Value;                                                        //0x0
    };
}; 
//0x8 bytes (sizeof)
struct _EX_RUNDOWN_REF
{
    union
    {
        ULONGLONG Count;                                                    //0x0
        VOID* Ptr;                                                          //0x0
    };
}; 
//0x18 bytes (sizeof)
struct _EX_RUNDOWN_REF_CACHE_AWARE
{
    struct _EX_RUNDOWN_REF* RunRefs;                                        //0x0
    VOID* PoolToFree;                                                       //0x8
    ULONG RunRefSize;                                                       //0x10
    ULONG Number;                                                           //0x14
}; 
//0x0 bytes (sizeof)
struct _EX_TIMER; 
//0x2e0 bytes (sizeof)
struct _EX_WORK_QUEUE
{
    struct _KPRIQUEUE WorkPriQueue;                                         //0x0
    struct _EX_PARTITION* Partition;                                        //0x2b0
    struct _ENODE* Node;                                                    //0x2b8
    volatile ULONG WorkItemsProcessed;                                      //0x2c0
    ULONG WorkItemsProcessedLastPass;                                       //0x2c4
    volatile LONG ThreadCount;                                              //0x2c8
    LONG MinThreads:31;                                                     //0x2cc
    volatile ULONG TryFailed:1;                                             //0x2cc
    LONG MaxThreads;                                                        //0x2d0
    enum _EXQUEUEINDEX QueueIndex;                                          //0x2d4
    struct _KEVENT* AllThreadsExitedEvent;                                  //0x2d8
}; 
//0x118 bytes (sizeof)
struct _EX_WORK_QUEUE_MANAGER
{
    struct _EX_PARTITION* Partition;                                        //0x0
    struct _ENODE* Node;                                                    //0x8
    struct _KEVENT Event;                                                   //0x10
    struct _KTIMER DeadlockTimer;                                           //0x28
    struct _KEVENT ReaperEvent;                                             //0x68
    struct _KTIMER2 ReaperTimer;                                            //0x80
    VOID* ThreadHandle;                                                     //0x108
    volatile ULONG ExitThread;                                              //0x110
    ULONG ThreadSeed;                                                       //0x114
}; 
//0x68 bytes (sizeof)
struct _FAST_ERESOURCE
{
    VOID* Reserved1[3];                                                     //0x0
    ULONG Reserved2;                                                        //0x18
    VOID* Reserved3[4];                                                     //0x20
    ULONG Reserved4[4];                                                     //0x40
    VOID* Reserved5;                                                        //0x50
    VOID* Reserved6[2];                                                     //0x58
};
//0x68 bytes (sizeof)
struct _FAST_ERESOURCE_INTERNAL
{
    struct _LIST_ENTRY SystemResourcesList;                                 //0x0
    VOID* ReservedPointer;                                                  //0x10
    SHORT ActiveCount;                                                      //0x18
    USHORT Flag;                                                            //0x1a
    struct _KWAIT_CHAIN SharedWaiters;                                      //0x20
    struct _KWAIT_CHAIN ExclusiveWaiters;                                   //0x28
    struct _LIST_ENTRY OwnerEntryListHead;                                  //0x30
    ULONG ActiveEntries;                                                    //0x40
    ULONG ContentionCount;                                                  //0x44
    ULONG NumberOfSharedWaiters;                                            //0x48
    ULONG NumberOfExclusiveWaiters;                                         //0x4c
    VOID* ReservedWin64OnlyPointer;                                         //0x50
    union
    {
        VOID* Address;                                                      //0x58
        ULONGLONG CreatorBackTraceIndex;                                    //0x58
    };
    ULONGLONG SpinLock;                                                     //0x60
};
//0xe0 bytes (sizeof)
struct _FAST_IO_DISPATCH
{
    ULONG SizeOfFastIoDispatch;                                             //0x0
    UCHAR (*FastIoCheckIfPossible)(struct _FILE_OBJECT* arg1, union _LARGE_INTEGER* arg2, ULONG arg3, UCHAR arg4, ULONG arg5, UCHAR arg6, struct _IO_STATUS_BLOCK* arg7, struct _DEVICE_OBJECT* arg8); //0x8
    UCHAR (*FastIoRead)(struct _FILE_OBJECT* arg1, union _LARGE_INTEGER* arg2, ULONG arg3, UCHAR arg4, ULONG arg5, VOID* arg6, struct _IO_STATUS_BLOCK* arg7, struct _DEVICE_OBJECT* arg8); //0x10
    UCHAR (*FastIoWrite)(struct _FILE_OBJECT* arg1, union _LARGE_INTEGER* arg2, ULONG arg3, UCHAR arg4, ULONG arg5, VOID* arg6, struct _IO_STATUS_BLOCK* arg7, struct _DEVICE_OBJECT* arg8); //0x18
    UCHAR (*FastIoQueryBasicInfo)(struct _FILE_OBJECT* arg1, UCHAR arg2, struct _FILE_BASIC_INFORMATION* arg3, struct _IO_STATUS_BLOCK* arg4, struct _DEVICE_OBJECT* arg5); //0x20
    UCHAR (*FastIoQueryStandardInfo)(struct _FILE_OBJECT* arg1, UCHAR arg2, struct _FILE_STANDARD_INFORMATION* arg3, struct _IO_STATUS_BLOCK* arg4, struct _DEVICE_OBJECT* arg5); //0x28
    UCHAR (*FastIoLock)(struct _FILE_OBJECT* arg1, union _LARGE_INTEGER* arg2, union _LARGE_INTEGER* arg3, struct _EPROCESS* arg4, ULONG arg5, UCHAR arg6, UCHAR arg7, struct _IO_STATUS_BLOCK* arg8, struct _DEVICE_OBJECT* arg9); //0x30
    UCHAR (*FastIoUnlockSingle)(struct _FILE_OBJECT* arg1, union _LARGE_INTEGER* arg2, union _LARGE_INTEGER* arg3, struct _EPROCESS* arg4, ULONG arg5, struct _IO_STATUS_BLOCK* arg6, struct _DEVICE_OBJECT* arg7); //0x38
    UCHAR (*FastIoUnlockAll)(struct _FILE_OBJECT* arg1, struct _EPROCESS* arg2, struct _IO_STATUS_BLOCK* arg3, struct _DEVICE_OBJECT* arg4); //0x40
    UCHAR (*FastIoUnlockAllByKey)(struct _FILE_OBJECT* arg1, VOID* arg2, ULONG arg3, struct _IO_STATUS_BLOCK* arg4, struct _DEVICE_OBJECT* arg5); //0x48
    UCHAR (*FastIoDeviceControl)(struct _FILE_OBJECT* arg1, UCHAR arg2, VOID* arg3, ULONG arg4, VOID* arg5, ULONG arg6, ULONG arg7, struct _IO_STATUS_BLOCK* arg8, struct _DEVICE_OBJECT* arg9); //0x50
    VOID (*AcquireFileForNtCreateSection)(struct _FILE_OBJECT* arg1);       //0x58
    VOID (*ReleaseFileForNtCreateSection)(struct _FILE_OBJECT* arg1);       //0x60
    VOID (*FastIoDetachDevice)(struct _DEVICE_OBJECT* arg1, struct _DEVICE_OBJECT* arg2); //0x68
    UCHAR (*FastIoQueryNetworkOpenInfo)(struct _FILE_OBJECT* arg1, UCHAR arg2, struct _FILE_NETWORK_OPEN_INFORMATION* arg3, struct _IO_STATUS_BLOCK* arg4, struct _DEVICE_OBJECT* arg5); //0x70
    LONG (*AcquireForModWrite)(struct _FILE_OBJECT* arg1, union _LARGE_INTEGER* arg2, struct _ERESOURCE** arg3, struct _DEVICE_OBJECT* arg4); //0x78
    UCHAR (*MdlRead)(struct _FILE_OBJECT* arg1, union _LARGE_INTEGER* arg2, ULONG arg3, ULONG arg4, struct _MDL** arg5, struct _IO_STATUS_BLOCK* arg6, struct _DEVICE_OBJECT* arg7); //0x80
    UCHAR (*MdlReadComplete)(struct _FILE_OBJECT* arg1, struct _MDL* arg2, struct _DEVICE_OBJECT* arg3); //0x88
    UCHAR (*PrepareMdlWrite)(struct _FILE_OBJECT* arg1, union _LARGE_INTEGER* arg2, ULONG arg3, ULONG arg4, struct _MDL** arg5, struct _IO_STATUS_BLOCK* arg6, struct _DEVICE_OBJECT* arg7); //0x90
    UCHAR (*MdlWriteComplete)(struct _FILE_OBJECT* arg1, union _LARGE_INTEGER* arg2, struct _MDL* arg3, struct _DEVICE_OBJECT* arg4); //0x98
    UCHAR (*FastIoReadCompressed)(struct _FILE_OBJECT* arg1, union _LARGE_INTEGER* arg2, ULONG arg3, ULONG arg4, VOID* arg5, struct _MDL** arg6, struct _IO_STATUS_BLOCK* arg7, struct _COMPRESSED_DATA_INFO* arg8, ULONG arg9, struct _DEVICE_OBJECT* arg10); //0xa0
    UCHAR (*FastIoWriteCompressed)(struct _FILE_OBJECT* arg1, union _LARGE_INTEGER* arg2, ULONG arg3, ULONG arg4, VOID* arg5, struct _MDL** arg6, struct _IO_STATUS_BLOCK* arg7, struct _COMPRESSED_DATA_INFO* arg8, ULONG arg9, struct _DEVICE_OBJECT* arg10); //0xa8
    UCHAR (*MdlReadCompleteCompressed)(struct _FILE_OBJECT* arg1, struct _MDL* arg2, struct _DEVICE_OBJECT* arg3); //0xb0
    UCHAR (*MdlWriteCompleteCompressed)(struct _FILE_OBJECT* arg1, union _LARGE_INTEGER* arg2, struct _MDL* arg3, struct _DEVICE_OBJECT* arg4); //0xb8
    UCHAR (*FastIoQueryOpen)(struct _IRP* arg1, struct _FILE_NETWORK_OPEN_INFORMATION* arg2, struct _DEVICE_OBJECT* arg3); //0xc0
    LONG (*ReleaseForModWrite)(struct _FILE_OBJECT* arg1, struct _ERESOURCE* arg2, struct _DEVICE_OBJECT* arg3); //0xc8
    LONG (*AcquireForCcFlush)(struct _FILE_OBJECT* arg1, struct _DEVICE_OBJECT* arg2); //0xd0
    LONG (*ReleaseForCcFlush)(struct _FILE_OBJECT* arg1, struct _DEVICE_OBJECT* arg2); //0xd8
}; 
//0x38 bytes (sizeof)
struct _FAST_MUTEX
{
    LONG Count;                                                             //0x0
    VOID* Owner;                                                            //0x8
    ULONG Contention;                                                       //0x10
    struct _KEVENT Event;                                                   //0x18
    ULONG OldIrql;                                                          //0x30
}; 
//0x48 bytes (sizeof)
struct _FAST_OWNER_ENTRY
{
    VOID* Reserved[9];                                                      //0x0
};
//0x48 bytes (sizeof)
struct _FAST_OWNER_ENTRY_INTERNAL
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    UCHAR AbLockHandle;                                                     //0x10
    UCHAR Disowned:1;                                                       //0x11
    UCHAR DynamicallyAllocated:1;                                           //0x11
    UCHAR CallerExclusive:1;                                                //0x11
    UCHAR IsSublistHead;                                                    //0x12
    UCHAR IsWaiting;                                                        //0x13
    VOID* LockAddress;                                                      //0x18
    VOID* ThreadAddress;                                                    //0x20
    struct _LIST_ENTRY SublistHead;                                         //0x28
    struct _LIST_ENTRY LockListEntry;                                       //0x38
};
//0x10 bytes (sizeof)
struct _FILESYSTEM_DISK_COUNTERS
{
    ULONGLONG FsBytesRead;                                                  //0x0
    ULONGLONG FsBytesWritten;                                               //0x8
}; 
//0x28 bytes (sizeof)
struct _FILE_BASIC_INFORMATION
{
    union _LARGE_INTEGER CreationTime;                                      //0x0
    union _LARGE_INTEGER LastAccessTime;                                    //0x8
    union _LARGE_INTEGER LastWriteTime;                                     //0x10
    union _LARGE_INTEGER ChangeTime;                                        //0x18
    ULONG FileAttributes;                                                   //0x20
}; 
//0x14 bytes (sizeof)
struct _FILE_GET_QUOTA_INFORMATION
{
    ULONG NextEntryOffset;                                                  //0x0
    ULONG SidLength;                                                        //0x4
    struct _SID Sid;                                                        //0x8
}; 
//0x38 bytes (sizeof)
struct _FILE_NETWORK_OPEN_INFORMATION
{
    union _LARGE_INTEGER CreationTime;                                      //0x0
    union _LARGE_INTEGER LastAccessTime;                                    //0x8
    union _LARGE_INTEGER LastWriteTime;                                     //0x10
    union _LARGE_INTEGER ChangeTime;                                        //0x18
    union _LARGE_INTEGER AllocationSize;                                    //0x20
    union _LARGE_INTEGER EndOfFile;                                         //0x28
    ULONG FileAttributes;                                                   //0x30
}; 
//0xd8 bytes (sizeof)
struct _FILE_OBJECT
{
    SHORT Type;                                                             //0x0
    SHORT Size;                                                             //0x2
    struct _DEVICE_OBJECT* DeviceObject;                                    //0x8
    struct _VPB* Vpb;                                                       //0x10
    VOID* FsContext;                                                        //0x18
    VOID* FsContext2;                                                       //0x20
    struct _SECTION_OBJECT_POINTERS* SectionObjectPointer;                  //0x28
    VOID* PrivateCacheMap;                                                  //0x30
    LONG FinalStatus;                                                       //0x38
    struct _FILE_OBJECT* RelatedFileObject;                                 //0x40
    UCHAR LockOperation;                                                    //0x48
    UCHAR DeletePending;                                                    //0x49
    UCHAR ReadAccess;                                                       //0x4a
    UCHAR WriteAccess;                                                      //0x4b
    UCHAR DeleteAccess;                                                     //0x4c
    UCHAR SharedRead;                                                       //0x4d
    UCHAR SharedWrite;                                                      //0x4e
    UCHAR SharedDelete;                                                     //0x4f
    ULONG Flags;                                                            //0x50
    struct _UNICODE_STRING FileName;                                        //0x58
    union _LARGE_INTEGER CurrentByteOffset;                                 //0x68
    ULONG Waiters;                                                          //0x70
    ULONG Busy;                                                             //0x74
    VOID* LastLock;                                                         //0x78
    struct _KEVENT Lock;                                                    //0x80
    struct _KEVENT Event;                                                   //0x98
    struct _IO_COMPLETION_CONTEXT* CompletionContext;                       //0xb0
    ULONGLONG IrpListLock;                                                  //0xb8
    struct _LIST_ENTRY IrpList;                                             //0xc0
    VOID* FileObjectExtension;                                              //0xd0
}; 
//0x18 bytes (sizeof)
struct _FILE_STANDARD_INFORMATION
{
    union _LARGE_INTEGER AllocationSize;                                    //0x0
    union _LARGE_INTEGER EndOfFile;                                         //0x8
    ULONG NumberOfLinks;                                                    //0x10
    UCHAR DeletePending;                                                    //0x14
    UCHAR Directory;                                                        //0x15
}; 
//0x0 bytes (sizeof)
struct _FLS_CALLBACK_INFO; 
//0x18 bytes (sizeof)
struct _FREE_DISPLAY
{
    ULONG RealVectorSize;                                                   //0x0
    ULONG Hint;                                                             //0x4
    struct _RTL_BITMAP Display;                                             //0x8
}; 
//0x68 bytes (sizeof)
struct _FSRTL_ADVANCED_FCB_HEADER
{
    SHORT NodeTypeCode;                                                     //0x0
    SHORT NodeByteSize;                                                     //0x2
    UCHAR Flags;                                                            //0x4
    UCHAR IsFastIoPossible;                                                 //0x5
    UCHAR Flags2;                                                           //0x6
    UCHAR Reserved:4;                                                       //0x7
    UCHAR Version:4;                                                        //0x7
    struct _ERESOURCE* Resource;                                            //0x8
    struct _ERESOURCE* PagingIoResource;                                    //0x10
    union _LARGE_INTEGER AllocationSize;                                    //0x18
    union _LARGE_INTEGER FileSize;                                          //0x20
    union _LARGE_INTEGER ValidDataLength;                                   //0x28
    struct _FAST_MUTEX* FastMutex;                                          //0x30
    struct _LIST_ENTRY FilterContexts;                                      //0x38
    struct _EX_PUSH_LOCK PushLock;                                          //0x48
    VOID** FileContextSupportPointer;                                       //0x50
    union
    {
        VOID* Oplock;                                                       //0x58
        VOID* ReservedForRemote;                                            //0x58
    };
    VOID* ReservedContext;                                                  //0x60
};
//0x78 bytes (sizeof)
struct _FS_FILTER_CALLBACKS
{
    ULONG SizeOfFsFilterCallbacks;                                          //0x0
    ULONG Reserved;                                                         //0x4
    LONG (*PreAcquireForSectionSynchronization)(struct _FS_FILTER_CALLBACK_DATA* arg1, VOID** arg2); //0x8
    VOID (*PostAcquireForSectionSynchronization)(struct _FS_FILTER_CALLBACK_DATA* arg1, LONG arg2, VOID* arg3); //0x10
    LONG (*PreReleaseForSectionSynchronization)(struct _FS_FILTER_CALLBACK_DATA* arg1, VOID** arg2); //0x18
    VOID (*PostReleaseForSectionSynchronization)(struct _FS_FILTER_CALLBACK_DATA* arg1, LONG arg2, VOID* arg3); //0x20
    LONG (*PreAcquireForCcFlush)(struct _FS_FILTER_CALLBACK_DATA* arg1, VOID** arg2); //0x28
    VOID (*PostAcquireForCcFlush)(struct _FS_FILTER_CALLBACK_DATA* arg1, LONG arg2, VOID* arg3); //0x30
    LONG (*PreReleaseForCcFlush)(struct _FS_FILTER_CALLBACK_DATA* arg1, VOID** arg2); //0x38
    VOID (*PostReleaseForCcFlush)(struct _FS_FILTER_CALLBACK_DATA* arg1, LONG arg2, VOID* arg3); //0x40
    LONG (*PreAcquireForModifiedPageWriter)(struct _FS_FILTER_CALLBACK_DATA* arg1, VOID** arg2); //0x48
    VOID (*PostAcquireForModifiedPageWriter)(struct _FS_FILTER_CALLBACK_DATA* arg1, LONG arg2, VOID* arg3); //0x50
    LONG (*PreReleaseForModifiedPageWriter)(struct _FS_FILTER_CALLBACK_DATA* arg1, VOID** arg2); //0x58
    VOID (*PostReleaseForModifiedPageWriter)(struct _FS_FILTER_CALLBACK_DATA* arg1, LONG arg2, VOID* arg3); //0x60
    LONG (*PreQueryOpen)(struct _FS_FILTER_CALLBACK_DATA* arg1, VOID** arg2); //0x68
    VOID (*PostQueryOpen)(struct _FS_FILTER_CALLBACK_DATA* arg1, LONG arg2, VOID* arg3); //0x70
}; 
//0x40 bytes (sizeof)
struct _FS_FILTER_CALLBACK_DATA
{
    ULONG SizeOfFsFilterCallbackData;                                       //0x0
    UCHAR Operation;                                                        //0x4
    UCHAR Reserved;                                                         //0x5
    struct _DEVICE_OBJECT* DeviceObject;                                    //0x8
    struct _FILE_OBJECT* FileObject;                                        //0x10
    union _FS_FILTER_PARAMETERS Parameters;                                 //0x18
}; 
//0x10 bytes (sizeof)
struct _FS_FILTER_SECTION_SYNC_OUTPUT
{
    ULONG StructureSize;                                                    //0x0
    ULONG SizeReturned;                                                     //0x4
    ULONG Flags;                                                            //0x8
    ULONG DesiredReadAlignment;                                             //0xc
}; 
//0x4e8 bytes (sizeof)
struct _GDI_TEB_BATCH
{
    ULONG Offset:31;                                                        //0x0
    ULONG HasRenderingCommand:1;                                            //0x0
    ULONGLONG HDC;                                                          //0x8
    ULONG Buffer[310];                                                      //0x10
}; 
//0x4e0 bytes (sizeof)
struct _GDI_TEB_BATCH32
{
    ULONG Offset:31;                                                        //0x0
    ULONG HasRenderingCommand:1;                                            //0x0
    ULONG HDC;                                                              //0x4
    ULONG Buffer[310];                                                      //0x8
}; 
//0x4e8 bytes (sizeof)
struct _GDI_TEB_BATCH64
{
    ULONG Offset:31;                                                        //0x0
    ULONG HasRenderingCommand:1;                                            //0x0
    ULONGLONG HDC;                                                          //0x8
    ULONG Buffer[310];                                                      //0x10
}; 
//0x80 bytes (sizeof)
struct _GENERAL_LOOKASIDE
{
    union
    {
        union _SLIST_HEADER ListHead;                                       //0x0
        struct _SINGLE_LIST_ENTRY SingleListHead;                           //0x0
    };
    USHORT Depth;                                                           //0x10
    USHORT MaximumDepth;                                                    //0x12
    ULONG TotalAllocates;                                                   //0x14
    union
    {
        ULONG AllocateMisses;                                               //0x18
        ULONG AllocateHits;                                                 //0x18
    };
    ULONG TotalFrees;                                                       //0x1c
    union
    {
        ULONG FreeMisses;                                                   //0x20
        ULONG FreeHits;                                                     //0x20
    };
    enum _POOL_TYPE Type;                                                   //0x24
    ULONG Tag;                                                              //0x28
    ULONG Size;                                                             //0x2c
    union
    {
        VOID* (*AllocateEx)(enum _POOL_TYPE arg1, ULONGLONG arg2, ULONG arg3, struct _LOOKASIDE_LIST_EX* arg4); //0x30
        VOID* (*Allocate)(enum _POOL_TYPE arg1, ULONGLONG arg2, ULONG arg3); //0x30
    };
    union
    {
        VOID (*FreeEx)(VOID* arg1, struct _LOOKASIDE_LIST_EX* arg2);        //0x38
        VOID (*Free)(VOID* arg1);                                           //0x38
    };
    struct _LIST_ENTRY ListEntry;                                           //0x40
    ULONG LastTotalAllocates;                                               //0x50
    union
    {
        ULONG LastAllocateMisses;                                           //0x54
        ULONG LastAllocateHits;                                             //0x54
    };
    ULONG Future[2];                                                        //0x58
}; 
//0x60 bytes (sizeof)
struct _GENERAL_LOOKASIDE_POOL
{
    union
    {
        union _SLIST_HEADER ListHead;                                       //0x0
        struct _SINGLE_LIST_ENTRY SingleListHead;                           //0x0
    };
    USHORT Depth;                                                           //0x10
    USHORT MaximumDepth;                                                    //0x12
    ULONG TotalAllocates;                                                   //0x14
    union
    {
        ULONG AllocateMisses;                                               //0x18
        ULONG AllocateHits;                                                 //0x18
    };
    ULONG TotalFrees;                                                       //0x1c
    union
    {
        ULONG FreeMisses;                                                   //0x20
        ULONG FreeHits;                                                     //0x20
    };
    enum _POOL_TYPE Type;                                                   //0x24
    ULONG Tag;                                                              //0x28
    ULONG Size;                                                             //0x2c
    union
    {
        VOID* (*AllocateEx)(enum _POOL_TYPE arg1, ULONGLONG arg2, ULONG arg3, struct _LOOKASIDE_LIST_EX* arg4); //0x30
        VOID* (*Allocate)(enum _POOL_TYPE arg1, ULONGLONG arg2, ULONG arg3); //0x30
    };
    union
    {
        VOID (*FreeEx)(VOID* arg1, struct _LOOKASIDE_LIST_EX* arg2);        //0x38
        VOID (*Free)(VOID* arg1);                                           //0x38
    };
    struct _LIST_ENTRY ListEntry;                                           //0x40
    ULONG LastTotalAllocates;                                               //0x50
    union
    {
        ULONG LastAllocateMisses;                                           //0x54
        ULONG LastAllocateHits;                                             //0x54
    };
    ULONG Future[2];                                                        //0x58
}; 
//0x10 bytes (sizeof)
struct _GENERIC_MAPPING
{
    ULONG GenericRead;                                                      //0x0
    ULONG GenericWrite;                                                     //0x4
    ULONG GenericExecute;                                                   //0x8
    ULONG GenericAll;                                                       //0xc
}; 
//0x10 bytes (sizeof)
struct _GROUP_AFFINITY
{
    ULONGLONG Mask;                                                         //0x0
    USHORT Group;                                                           //0x8
    USHORT Reserved[3];                                                     //0xa
}; 
//0x10 bytes (sizeof)
struct _GUID
{
    ULONG Data1;                                                            //0x0
    USHORT Data2;                                                           //0x4
    USHORT Data3;                                                           //0x6
    UCHAR Data4[8];                                                         //0x8
}; 
//0x10 bytes (sizeof)
struct _HAL_CHANNEL_MEMORY_RANGES
{
    ULONGLONG PageFrameIndex;                                               //0x0
    USHORT MpnId;                                                           //0x8
    USHORT Node;                                                            //0xa
    USHORT Channel;                                                         //0xc
    UCHAR IsPowerManageable;                                                //0xe
    UCHAR DeepPowerState;                                                   //0xf
}; 
//0x10 bytes (sizeof)
struct _HAL_NODE_RANGE
{
    ULONGLONG PageFrameIndex;                                               //0x0
    ULONG Node;                                                             //0x8
}; 
//0x0 bytes (sizeof)
struct _HAL_PMC_COUNTERS; 
//0x20 bytes (sizeof)
struct _HANDLE_REVOCATION_INFO
{
    struct _LIST_ENTRY ListEntry;                                           //0x0
    struct _OB_HANDLE_REVOCATION_BLOCK* RevocationBlock;                    //0x10
    UCHAR AllowHandleRevocation;                                            //0x18
    UCHAR Padding1[3];                                                      //0x19
    UCHAR Padding2[4];                                                      //0x1c
}; 
//0x80 bytes (sizeof)
struct _HANDLE_TABLE
{
    ULONG NextHandleNeedingPool;                                            //0x0
    LONG ExtraInfoPages;                                                    //0x4
    volatile ULONGLONG TableCode;                                           //0x8
    struct _EPROCESS* QuotaProcess;                                         //0x10
    struct _LIST_ENTRY HandleTableList;                                     //0x18
    ULONG UniqueProcessId;                                                  //0x28
    union
    {
        ULONG Flags;                                                        //0x2c
        struct
        {
            UCHAR StrictFIFO:1;                                             //0x2c
            UCHAR EnableHandleExceptions:1;                                 //0x2c
            UCHAR Rundown:1;                                                //0x2c
            UCHAR Duplicated:1;                                             //0x2c
            UCHAR RaiseUMExceptionOnInvalidHandleClose:1;                   //0x2c
        };
    };
    struct _EX_PUSH_LOCK HandleContentionEvent;                             //0x30
    struct _EX_PUSH_LOCK HandleTableLock;                                   //0x38
    union
    {
        struct _HANDLE_TABLE_FREE_LIST FreeLists[1];                        //0x40
        struct
        {
            UCHAR ActualEntry[32];                                          //0x40
            struct _HANDLE_TRACE_DEBUG_INFO* DebugInfo;                     //0x60
        };
    };
}; 
//0x8 bytes (sizeof)
struct _HANDLE_TABLE_ENTRY_INFO
{
    ULONG AuditMask;                                                        //0x0
    ULONG MaxRelativeAccessMask;                                            //0x4
}; 
//0x40 bytes (sizeof)
struct _HANDLE_TABLE_FREE_LIST
{
    struct _EX_PUSH_LOCK FreeListLock;                                      //0x0
    union _HANDLE_TABLE_ENTRY* FirstFreeHandleEntry;                        //0x8
    union _HANDLE_TABLE_ENTRY* LastFreeHandleEntry;                         //0x10
    LONG HandleCount;                                                       //0x18
    ULONG HighWaterMark;                                                    //0x1c
}; 
//0xa0 bytes (sizeof)
struct _HANDLE_TRACE_DB_ENTRY
{
    struct _CLIENT_ID ClientId;                                             //0x0
    VOID* Handle;                                                           //0x10
    ULONG Type;                                                             //0x18
    VOID* StackTrace[16];                                                   //0x20
}; 
//0xf0 bytes (sizeof)
struct _HANDLE_TRACE_DEBUG_INFO
{
    LONG RefCount;                                                          //0x0
    ULONG TableSize;                                                        //0x4
    ULONG BitMaskFlags;                                                     //0x8
    struct _FAST_MUTEX CloseCompactionLock;                                 //0x10
    ULONG CurrentStackIndex;                                                //0x48
    struct _HANDLE_TRACE_DB_ENTRY TraceDb[1];                               //0x50
}; 
//0x8 bytes (sizeof)
struct _HARDWARE_PTE
{
    ULONGLONG Valid:1;                                                      //0x0
    ULONGLONG Write:1;                                                      //0x0
    ULONGLONG Owner:1;                                                      //0x0
    ULONGLONG WriteThrough:1;                                               //0x0
    ULONGLONG CacheDisable:1;                                               //0x0
    ULONGLONG Accessed:1;                                                   //0x0
    ULONGLONG Dirty:1;                                                      //0x0
    ULONGLONG LargePage:1;                                                  //0x0
    ULONGLONG Global:1;                                                     //0x0
    ULONGLONG CopyOnWrite:1;                                                //0x0
    ULONGLONG Prototype:1;                                                  //0x0
    ULONGLONG reserved0:1;                                                  //0x0
    ULONGLONG PageFrameNumber:36;                                           //0x0
    ULONGLONG reserved1:4;                                                  //0x0
    ULONGLONG SoftwareWsIndex:11;                                           //0x0
    ULONGLONG NoExecute:1;                                                  //0x0
}; 
//0x1000 bytes (sizeof)
struct _HBASE_BLOCK
{
    ULONG Signature;                                                        //0x0
    ULONG Sequence1;                                                        //0x4
    ULONG Sequence2;                                                        //0x8
    union _LARGE_INTEGER TimeStamp;                                         //0xc
    ULONG Major;                                                            //0x14
    ULONG Minor;                                                            //0x18
    ULONG Type;                                                             //0x1c
    ULONG Format;                                                           //0x20
    ULONG RootCell;                                                         //0x24
    ULONG Length;                                                           //0x28
    ULONG Cluster;                                                          //0x2c
    UCHAR FileName[64];                                                     //0x30
    struct _GUID RmId;                                                      //0x70
    struct _GUID LogId;                                                     //0x80
    ULONG Flags;                                                            //0x90
    struct _GUID TmId;                                                      //0x94
    ULONG GuidSignature;                                                    //0xa4
    ULONGLONG LastReorganizeTime;                                           //0xa8
    ULONG Reserved1[83];                                                    //0xb0
    ULONG CheckSum;                                                         //0x1fc
    ULONG Reserved2[882];                                                   //0x200
    struct _GUID ThawTmId;                                                  //0xfc8
    struct _GUID ThawRmId;                                                  //0xfd8
    struct _GUID ThawLogId;                                                 //0xfe8
    ULONG BootType;                                                         //0xff8
    ULONG BootRecover;                                                      //0xffc
}; 
//0x20 bytes (sizeof)
struct _HBIN
{
    ULONG Signature;                                                        //0x0
    ULONG FileOffset;                                                       //0x4
    ULONG Size;                                                             //0x8
    ULONG Reserved1[2];                                                     //0xc
    union _LARGE_INTEGER TimeStamp;                                         //0x14
    ULONG Spare;                                                            //0x1c
}; 
//0x8 bytes (sizeof)
struct _HCELL
{
    LONG Size;                                                              //0x0
    union
    {
        struct
        {
            union
            {
                ULONG UserData;                                             //0x4
                ULONG Next;                                                 //0x4
            } u;                                                            //0x4
        } NewCell;                                                          //0x4
    } u;                                                                    //0x4
}; 
//0x2a0 bytes (sizeof)
struct _HEAP
{
    union
    {
        struct _HEAP_SEGMENT Segment;                                       //0x0
        struct
        {
            struct _HEAP_ENTRY Entry;                                       //0x0
            ULONG SegmentSignature;                                         //0x10
            ULONG SegmentFlags;                                             //0x14
            struct _LIST_ENTRY SegmentListEntry;                            //0x18
            struct _HEAP* Heap;                                             //0x28
            VOID* BaseAddress;                                              //0x30
            ULONG NumberOfPages;                                            //0x38
            struct _HEAP_ENTRY* FirstEntry;                                 //0x40
            struct _HEAP_ENTRY* LastValidEntry;                             //0x48
            ULONG NumberOfUnCommittedPages;                                 //0x50
            ULONG NumberOfUnCommittedRanges;                                //0x54
            USHORT SegmentAllocatorBackTraceIndex;                          //0x58
            USHORT Reserved;                                                //0x5a
            struct _LIST_ENTRY UCRSegmentList;                              //0x60
        };
    };
    ULONG Flags;                                                            //0x70
    ULONG ForceFlags;                                                       //0x74
    ULONG CompatibilityFlags;                                               //0x78
    ULONG EncodeFlagMask;                                                   //0x7c
    struct _HEAP_ENTRY Encoding;                                            //0x80
    ULONG Interceptor;                                                      //0x90
    ULONG VirtualMemoryThreshold;                                           //0x94
    ULONG Signature;                                                        //0x98
    ULONGLONG SegmentReserve;                                               //0xa0
    ULONGLONG SegmentCommit;                                                //0xa8
    ULONGLONG DeCommitFreeBlockThreshold;                                   //0xb0
    ULONGLONG DeCommitTotalFreeThreshold;                                   //0xb8
    ULONGLONG TotalFreeSize;                                                //0xc0
    ULONGLONG MaximumAllocationSize;                                        //0xc8
    USHORT ProcessHeapsListIndex;                                           //0xd0
    USHORT HeaderValidateLength;                                            //0xd2
    VOID* HeaderValidateCopy;                                               //0xd8
    USHORT NextAvailableTagIndex;                                           //0xe0
    USHORT MaximumTagIndex;                                                 //0xe2
    struct _HEAP_TAG_ENTRY* TagEntries;                                     //0xe8
    struct _LIST_ENTRY UCRList;                                             //0xf0
    ULONGLONG AlignRound;                                                   //0x100
    ULONGLONG AlignMask;                                                    //0x108
    struct _LIST_ENTRY VirtualAllocdBlocks;                                 //0x110
    struct _LIST_ENTRY SegmentList;                                         //0x120
    USHORT AllocatorBackTraceIndex;                                         //0x130
    ULONG NonDedicatedListLength;                                           //0x134
    VOID* BlocksIndex;                                                      //0x138
    VOID* UCRIndex;                                                         //0x140
    struct _HEAP_PSEUDO_TAG_ENTRY* PseudoTagEntries;                        //0x148
    struct _LIST_ENTRY FreeLists;                                           //0x150
    struct _HEAP_LOCK* LockVariable;                                        //0x160
    LONG (*CommitRoutine)(VOID* arg1, VOID** arg2, ULONGLONG* arg3);        //0x168
    union _RTL_RUN_ONCE StackTraceInitVar;                                  //0x170
    VOID* FrontEndHeap;                                                     //0x178
    USHORT FrontHeapLockCount;                                              //0x180
    UCHAR FrontEndHeapType;                                                 //0x182
    UCHAR RequestedFrontEndHeapType;                                        //0x183
    USHORT* FrontEndHeapUsageData;                                          //0x188
    USHORT FrontEndHeapMaximumIndex;                                        //0x190
    volatile UCHAR FrontEndHeapStatusBitmap[129];                           //0x192
    struct _HEAP_COUNTERS Counters;                                         //0x218
    struct _HEAP_TUNING_PARAMETERS TuningParameters;                        //0x290
}; 
//0x78 bytes (sizeof)
struct _HEAP_COUNTERS
{
    ULONGLONG TotalMemoryReserved;                                          //0x0
    ULONGLONG TotalMemoryCommitted;                                         //0x8
    ULONGLONG TotalMemoryLargeUCR;                                          //0x10
    ULONGLONG TotalSizeInVirtualBlocks;                                     //0x18
    ULONG TotalSegments;                                                    //0x20
    ULONG TotalUCRs;                                                        //0x24
    ULONG CommittOps;                                                       //0x28
    ULONG DeCommitOps;                                                      //0x2c
    ULONG LockAcquires;                                                     //0x30
    ULONG LockCollisions;                                                   //0x34
    ULONG CommitRate;                                                       //0x38
    ULONG DecommittRate;                                                    //0x3c
    ULONG CommitFailures;                                                   //0x40
    ULONG InBlockCommitFailures;                                            //0x44
    ULONG PollIntervalCounter;                                              //0x48
    ULONG DecommitsSinceLastCheck;                                          //0x4c
    ULONG HeapPollInterval;                                                 //0x50
    ULONG AllocAndFreeOps;                                                  //0x54
    ULONG AllocationIndicesActive;                                          //0x58
    ULONG InBlockDeccommits;                                                //0x5c
    ULONGLONG InBlockDeccomitSize;                                          //0x60
    ULONGLONG HighWatermarkSize;                                            //0x68
    ULONGLONG LastPolledSize;                                               //0x70
}; 
//0x10 bytes (sizeof)
struct _HEAP_ENTRY
{
    union
    {
        struct _HEAP_UNPACKED_ENTRY UnpackedEntry;                          //0x0
        struct
        {
            VOID* PreviousBlockPrivateData;                                 //0x0
            union
            {
                struct
                {
                    USHORT Size;                                            //0x8
                    UCHAR Flags;                                            //0xa
                    UCHAR SmallTagIndex;                                    //0xb
                };
                struct
                {
                    ULONG SubSegmentCode;                                   //0x8
                    USHORT PreviousSize;                                    //0xc
                    union
                    {
                        UCHAR SegmentOffset;                                //0xe
                        UCHAR LFHFlags;                                     //0xe
                    };
                    UCHAR UnusedBytes;                                      //0xf
                };
                ULONGLONG CompactHeader;                                    //0x8
            };
        };
        struct _HEAP_EXTENDED_ENTRY ExtendedEntry;                          //0x0
        struct
        {
            VOID* Reserved;                                                 //0x0
            union
            {
                struct
                {
                    USHORT FunctionIndex;                                   //0x8
                    USHORT ContextValue;                                    //0xa
                };
                ULONG InterceptorValue;                                     //0x8
            };
            USHORT UnusedBytesLength;                                       //0xc
            UCHAR EntryOffset;                                              //0xe
            UCHAR ExtendedBlockSignature;                                   //0xf
        };
        struct
        {
            VOID* ReservedForAlignment;                                     //0x0
            union
            {
                struct
                {
                    ULONG Code1;                                            //0x8
                    union
                    {
                        struct
                        {
                            USHORT Code2;                                   //0xc
                            UCHAR Code3;                                    //0xe
                            UCHAR Code4;                                    //0xf
                        };
                        ULONG Code234;                                      //0xc
                    };
                };
                ULONGLONG AgregateCode;                                     //0x8
            };
        };
    };
}; 
//0x10 bytes (sizeof)
struct _HEAP_ENTRY_EXTRA
{
    union
    {
        struct
        {
            USHORT AllocatorBackTraceIndex;                                 //0x0
            USHORT TagIndex;                                                //0x2
            ULONGLONG Settable;                                             //0x8
        };
        struct
        {
            ULONGLONG ZeroInit;                                             //0x0
            ULONGLONG ZeroInit1;                                            //0x8
        };
    };
}; 
//0x10 bytes (sizeof)
struct _HEAP_EXTENDED_ENTRY
{
    VOID* Reserved;                                                         //0x0
    union
    {
        struct
        {
            USHORT FunctionIndex;                                           //0x8
            USHORT ContextValue;                                            //0xa
        };
        ULONG InterceptorValue;                                             //0x8
    };
    USHORT UnusedBytesLength;                                               //0xc
    UCHAR EntryOffset;                                                      //0xe
    UCHAR ExtendedBlockSignature;                                           //0xf
}; 
//0x20 bytes (sizeof)
struct _HEAP_FREE_ENTRY
{
    union
    {
        struct _HEAP_ENTRY HeapEntry;                                       //0x0
        struct _HEAP_UNPACKED_ENTRY UnpackedEntry;                          //0x0
        struct
        {
            VOID* PreviousBlockPrivateData;                                 //0x0
            union
            {
                struct
                {
                    USHORT Size;                                            //0x8
                    UCHAR Flags;                                            //0xa
                    UCHAR SmallTagIndex;                                    //0xb
                };
                struct
                {
                    ULONG SubSegmentCode;                                   //0x8
                    USHORT PreviousSize;                                    //0xc
                    union
                    {
                        UCHAR SegmentOffset;                                //0xe
                        UCHAR LFHFlags;                                     //0xe
                    };
                    UCHAR UnusedBytes;                                      //0xf
                };
                ULONGLONG CompactHeader;                                    //0x8
            };
        };
        struct _HEAP_EXTENDED_ENTRY ExtendedEntry;                          //0x0
        struct
        {
            VOID* Reserved;                                                 //0x0
            union
            {
                struct
                {
                    USHORT FunctionIndex;                                   //0x8
                    USHORT ContextValue;                                    //0xa
                };
                ULONG InterceptorValue;                                     //0x8
            };
            USHORT UnusedBytesLength;                                       //0xc
            UCHAR EntryOffset;                                              //0xe
            UCHAR ExtendedBlockSignature;                                   //0xf
        };
        struct
        {
            VOID* ReservedForAlignment;                                     //0x0
            union
            {
                struct
                {
                    ULONG Code1;                                            //0x8
                    union
                    {
                        struct
                        {
                            USHORT Code2;                                   //0xc
                            UCHAR Code3;                                    //0xe
                            UCHAR Code4;                                    //0xf
                        };
                        ULONG Code234;                                      //0xc
                    };
                };
                ULONGLONG AgregateCode;                                     //0x8
            };
        };
    };
    struct _LIST_ENTRY FreeList;                                            //0x10
};
//0x4 bytes (sizeof)
struct _HEAP_FREE_ENTRY_EXTRA
{
    USHORT TagIndex;                                                        //0x0
    USHORT FreeBackTraceIndex;                                              //0x2
};
//0x38 bytes (sizeof)
struct _HEAP_LIST_LOOKUP
{
    struct _HEAP_LIST_LOOKUP* ExtendedLookup;                               //0x0
    ULONG ArraySize;                                                        //0x8
    ULONG ExtraItem;                                                        //0xc
    ULONG ItemCount;                                                        //0x10
    ULONG OutOfRangeItems;                                                  //0x14
    ULONG BaseIndex;                                                        //0x18
    struct _LIST_ENTRY* ListHead;                                           //0x20
    ULONG* ListsInUseUlong;                                                 //0x28
    struct _LIST_ENTRY** ListHints;                                         //0x30
}; 
//0x68 bytes (sizeof)
struct _HEAP_LOCK
{
    union
    {
        struct _RTL_CRITICAL_SECTION CriticalSection;                       //0x0
        struct _ERESOURCE Resource;                                         //0x0
    } Lock;                                                                 //0x0
}; 
//0x40 bytes (sizeof)
struct _HEAP_LOOKASIDE
{
    union _SLIST_HEADER ListHead;                                           //0x0
    USHORT Depth;                                                           //0x10
    USHORT MaximumDepth;                                                    //0x12
    ULONG TotalAllocates;                                                   //0x14
    ULONG AllocateMisses;                                                   //0x18
    ULONG TotalFrees;                                                       //0x1c
    ULONG FreeMisses;                                                       //0x20
    ULONG LastTotalAllocates;                                               //0x24
    ULONG LastAllocateMisses;                                               //0x28
